[
	{
		"title": "Burton Zipline Boa Snowboard Boots - Big Kids' 2022 - Used",
		"formattedTitle": "burton-zipline-boa-snowboard-boots---big-kids'----used",
		"brand": "burton",
		"description": "Get your little ones on the hill this season, with the Burton Zipline Boa Snowboard Boots. Forgiving flex and an easy to use Boa® Coiler lacing system means your little shredder will be lacing his own boots up and learning faster than you can keep up with. Complete with heat moldable liners and superior cushioning system the Zipline Boa Boots ensure that they won't miss a beat as they acclimate to the slopes.",
		"image": "1648851374153.jpg",
		"price": "134.99",
		"sized": ["S", "M", "L"],
		"stock": 44
	},
	{
		"title": "Union Cadet Snowboard Boots - Kids' 2022",
		"formattedTitle": "union-cadet-snowboard-boots---kids'-",
		"brand": "union",
		"description": "Long known for producing some of the finest bindings in the business, Union have finally turned their attention to the boot game. Starting with the next generation of shredders makes perfect sense, and the Union Cadet Snowboard Boots are ideal for making those first steps towards a lifetime of fun on the slopes. They pack a soft, park friendly flex, with BOA lacing that can be easily operated by small mitts. Who said boot camp had to be difficult?",
		"image": "1648851376615.jpg",
		"price": "152.96",
		"sized": ["S", "M", "L"],
		"stock": 107
	},
	{
		"title": "thirtytwo Kids Boa Snowboard Boots - Kids' 2022",
		"formattedTitle": "thirtytwo-kids-boa-snowboard-boots---kids'-",
		"brand": "thirtytwo",
		"description": "How soon should your grom start snowboarding? Well, if they can walk with confidence and express an interest, the thirtytwo Kids Boa Snowboard Boots will help them get started. These boots for shredders-to-be are a comfy and toasty way to let them enjoy the winter like the grownups. The Kids Boa is super soft, comfortable, and sized for the mini-grom in your family.",
		"image": "1648851378903.jpg",
		"price": "114.71",
		"sized": ["S", "M", "L"],
		"stock": 181
	},
	{
		"title": "K2 Mini Turbo Snowboard Boots - Little Boys' 2022",
		"formattedTitle": "k2-mini-turbo-snowboard-boots---little-boys'-",
		"brand": "k2",
		"description": "The K2 Mini Turbo Snowboard Boots will give your grom a leg up on the competition with their excellent fit and convenient Youth Boa® closure system (kids love Boa® dials, and so will you). Not only that, K2's Grows-A-Long shim system makes it simple to adjust the length of the boot for growing feet, even mid-season.",
		"image": "1648851382601.jpg",
		"price": "103.96",
		"sized": ["S", "M", "L"],
		"stock": 166
	},
	{
		"title": "Burton Zipline Step On Snowboard Boots - Kids' 2020",
		"formattedTitle": "burton-zipline-step-on-snowboard-boots---kids'-",
		"brand": "burton",
		"description": "In all your years on snow, you've learned that a good pair of boots can make or break your day. Give your kids the step up they need with the Burton Zipline Step On Snowboard Boots. These boots work with the exclusive Burton Step On™ technology to deliver a foot to board connection that's stable, secure, and insanely responsive. With the Youth Imprint™ Liner and softer flex, these boots put comfort and control at the forefront so junior can have a blast on the hill.",
		"image": "1648851385755.jpg",
		"price": "189.95",
		"sized": ["S", "M", "L"],
		"stock": 30
	},
	{
		"title": "thirtytwo Youth Lashed Crab Grab Boa Snowboard Boots - Kids' 2022",
		"formattedTitle": "thirtytwo-youth-lashed-crab-grab-boa-snowboard-boots---kids'-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Youth Lashed Crab Grab Boa Snowboard Boots have heat-moldable comfort liners and integrated internal lacing, plus all the style and convenience of the big Crabs. Let the convenient Boa dial take the stress out of getting ready to ride.",
		"image": "1648851387798.jpg",
		"price": "152.96",
		"sized": ["S", "M", "L"],
		"stock": 158
	},
	{
		"title": "K2 Lil Kat Snowboard Boots - Little Girls' 2022",
		"formattedTitle": "k2-lil-kat-snowboard-boots---little-girls'-",
		"brand": "k2",
		"description": "The K2 Lil Kat Snowboard Boots are a quick and comfortable answer to the question of kid's snowboarding footwear, with Grows-A-Long shims to adjust for inevitable growth and a single youth Boa® \"dial it up\" closure for convenience. Keep it simple, keep it fun, the Lil Kat is the one.",
		"image": "1648851390062.jpg",
		"price": "103.96",
		"sized": ["S", "M", "L"],
		"stock": 59
	},
	{
		"title": "Burton Grom Boa Snowboard Boots - Little Kids' 2022",
		"formattedTitle": "burton-grom-boa-snowboard-boots---little-kids'-",
		"brand": "burton",
		"description": "Grab your grom the perfect pair of starter boots and watch them shoot up the learning curve like a tiny human rocket ship. The Burton Grom Boa Snowboard Boots are simple for your little dude to put on himself, featuring the Boa® closure system for easy, intuitive lacing even with gloves on. A soft, forgiving flex is ideal for messing around in the park and when the next growth spurt hits, remove the Room-To-Grow footbed to squeeze another season out!",
		"image": "1648851393337.jpg",
		"price": "129.95",
		"sized": ["S", "M", "L"],
		"stock": 90
	},
	{
		"title": "K2 Vandal Snowboard Boots - Boys' 2022",
		"formattedTitle": "k2-vandal-snowboard-boots---boys'-",
		"brand": "k2",
		"description": "The K2 Vandal Snowboard Boots are built to last, providing top-notch comfort and longevity in a kid's boot. The Comfort Fit liner is built for all day riding, and the sturdy rubber outsoles, EVA interiors, and Grows-A-Long shims enable the boot to last long enough to keep up with the growth spurts of your youngster.",
		"image": "1648851395454.jpg",
		"price": "135.96",
		"sized": ["S", "M", "L"],
		"stock": 69
	},
	{
		"title": "Rome Minishred Snowboard Boots - Little Kids' 2022",
		"formattedTitle": "rome-minishred-snowboard-boots---little-kids'-",
		"brand": "rome",
		"description": "From the bunny hills to the black diamonds, the Rome Minishred Snowboard Boots are designed to keep your kiddo on the hill longer. A simple single-dial BOA and comfy linerless construction means you'll hear less complaining when it's time to strap in. Plus stacked foodbeds mean they can be adjusted as your kiddo grows. Go from mini-shredder to mega-shredder thanks to the Rome Minishred Snowboard Boots.",
		"image": "1648851397648.jpg",
		"price": "139.95",
		"sized": ["S", "M", "L"],
		"stock": 219
	},
	{
		"title": "Burton Mini Grom Snowboard Boots - Little Kids' 2022",
		"formattedTitle": "burton-mini-grom-snowboard-boots---little-kids'-",
		"brand": "burton",
		"description": "Lil' rippers need boots too! The Burton Mini Grom Snowboard Boots have got parents covered, thanks to the incredibly easy to put on and take off hook and loop straps, a liner-less warm and fuzzy slip-on design and the removable Room-to-Grow™ footbed for a full shoe size gain when they grow over the summer. Available all the way down to size 7C for the smallest of shredders.",
		"image": "1648851399841.jpg",
		"price": "79.95",
		"sized": ["S", "M", "L"],
		"stock": 119
	},
	{
		"title": "Burton Zipline Boa Snowboard Boots - Big Kids' 2022",
		"formattedTitle": "burton-zipline-boa-snowboard-boots---big-kids'-",
		"brand": "burton",
		"description": "Get your little ones on the hill this season, with the Burton Zipline Boa Snowboard Boots. Forgiving flex and an easy to use Boa® Coiler lacing system means your little shredder will be lacing his own boots up and learning faster than you can keep up with. Complete with heat moldable liners and superior cushioning system the Zipline Boa Boots ensure that they won't miss a beat as they acclimate to the slopes.",
		"image": "1648851402475.jpg",
		"price": "149.99",
		"sized": ["S", "M", "L"],
		"stock": 123
	},
	{
		"title": "Burton Concord Smalls Snowboard Boots - Kids' 2022",
		"formattedTitle": "burton-concord-smalls-snowboard-boots---kids'-",
		"brand": "burton",
		"description": "Built for shredders who still have grom-sized feet despite their pro-sized ambitions, the Burton Concord Smalls Snowboard Boots pack a ton of tech into a small package. With a heat moldable liner, a Wishbone cuff for extra power, and a DynoLITE outsole for premium cushioning, the Concord Smalls bring the high performing features of higher level grown up boots to the next generation of riders.",
		"image": "1648851405094.jpg",
		"price": "179.95",
		"sized": ["S", "M", "L"],
		"stock": 144
	},
	{
		"title": "Union Cadet Snowboard Boots - Big Kids' 2021",
		"formattedTitle": "union-cadet-snowboard-boots---big-kids'-",
		"brand": "union",
		"description": "Long known for producing some of the finest bindings in the business, Union have finally turned their attention to the boot game. Starting with the next generation of shredders makes perfect sense, and the Union Cadet Snowboard Boots are ideal for making those first steps towards a lifetime of fun on the slopes. They pack a soft, park friendly flex, with BOA lacing that can be easily operated by small mitts. Who said boot camp had to be difficult?",
		"image": "1648851408833.jpg",
		"price": "179.95",
		"sized": ["S", "M", "L"],
		"stock": 91
	},
	{
		"title": "K2 Kat Snowboard Boots - Girls' 2022",
		"formattedTitle": "k2-kat-snowboard-boots---girls'-",
		"brand": "k2",
		"description": "The K2 Kat Snowboard Boots are built to last, providing top-notch comfort and longevity in a kid's boot. The Comfort Fit liner is built for all day riding, and the sturdy rubber outsoles, EVA interiors, and Grows-A-Long shims enable the boot to last long enough to keep up with the growth spurts of your youngster.",
		"image": "1648851411957.jpg",
		"price": "135.96",
		"sized": ["S", "M", "L"],
		"stock": 34
	},
	{
		"title": "Vans Juvie Linerless Snowboard Boots - Kids' 2022",
		"formattedTitle": "vans-juvie-linerless-snowboard-boots---kids'-",
		"brand": "vans",
		"description": "The Vans Juvie Linerless Snowboard Boots feature a slimmed-down profile, super soft flex, and integrated liner design developed for street and park riders seeking the freedom of closer contact and an even better board feel. Featuring single-density V1 PopCush Footbeds for impact cushioning with an anti-fatigue coring design, Powercuff Straps for extra support, Instep Flex Zones for natural flex, these boots are ready to take your grom's riding to another level.",
		"image": "1648851413784.jpg",
		"price": "129.95",
		"sized": ["S", "M", "L"],
		"stock": 193
	},
	{
		"title": "Nidecker Micron Boa Snowboard Boots - Kids' 2022",
		"formattedTitle": "nidecker-micron-boa-snowboard-boots---kids'-",
		"brand": "nidecker",
		"description": "Let junior shred! The Nidecker Micron Boa Snowboard Boots are fully featured youth boots that look to put the competition to shame. With excellent grip from an all-rubber outsole and a warm, comfortable 3D-molded liner, there's no doubt your young shredder will ride with confidence this year.",
		"image": "1648851417084.jpg",
		"price": "159.95",
		"sized": ["S", "M", "L"],
		"stock": 46
	},
	{
		"title": "K2 Lil Kat Snowboard Boots - Little Girls' 2021",
		"formattedTitle": "k2-lil-kat-snowboard-boots---little-girls'-",
		"brand": "k2",
		"description": "The K2 Lil Kat Snowboard Boots help youngsters make the most out of their first time sideways sliding. They're crafted with a playful and soft flex and fitted with internal J-Bars for a secure and natural fit. With a grom-ready Kid's Boa fit system, these boots are easy enough for them to get on themselves.",
		"image": "1648851419237.jpg",
		"price": "119.95",
		"sized": ["S", "M", "L"],
		"stock": 1
	}
]
