[
	{
		"title": "Nidecker Micron Snowday Snowboard - Little Kids' 2022",
		"formattedTitle": "nidecker-micron-snowday-snowboard---little-kids'-",
		"brand": "nidecker",
		"description": "Get the hot chocolate ready, the Nidecker Micron Snowday Snowboard is the perfect addition to your weekend family time. With beveled footpads and a removable tow rope, pull your future shredder towards starting their love for the snow right.",
		"image": "1648852581668.jpg",
		"price": "101.96",
		"sized": ["148", "152"],
		"stock": 30
	},
	{
		"title": "Rossignol Jibfluence Snowboard - Kids' 2021",
		"formattedTitle": "rossignol-jibfluence-snowboard---kids'-",
		"brand": "rossignol",
		"description": "Based on the award-winning Jibsaw board, the Rossignol Jibfluence Snowboard brings the same high-octane freestyle energy to lighter riders. At the center of the Jibfluence concept is a multi-radius sidecut and 3S serrated edges, which give the board precision control on the hardpack. Pair that with a nice soft flex pattern for a playful, easygoing feel, and the result is a board that's fun and powerful for youngsters looking to get tricky.",
		"image": "1648852584074.jpg",
		"price": "199.99",
		"sized": ["138", "142", "168", "148"],
		"stock": 34
	},
	{
		"title": "Arbor Cheater Rocker Snowboard - Kids' 2023",
		"formattedTitle": "arbor-cheater-rocker-snowboard---kids'-",
		"brand": "arbor",
		"description": "Cheater cheater pumpkin eater! The Arbor Cheater Rocker Snowboard helps them skip the awkward phase and progress their riding with ease. This board has all the features of its adult companions, with System Rocker that's catch free and easy to control. It's all the Arbor performance you love in a package made for enthusiastic mini shredders.",
		"image": "1648852586001.jpg",
		"price": "299.95",
		"sized": ["150"],
		"stock": 166
	},
	{
		"title": "Nitro Miniganger Splitboard - Kids' 2022",
		"formattedTitle": "nitro-miniganger-splitboard---kids'-",
		"brand": "nitro",
		"description": "Going for a long walk in the backcountry? Get your mini-me in on the action with the Nitro Miniganger Splitboard. This sized down split delivers the same technology and construction as the adult version, perfect for young rippers in the business of earning their turns. It transitions quickly and seamlessly from tour to ride mode, and features Nitro's Cam-Out Camber and Power Core construction for buttery smooth riding all the way back to the trailhead.",
		"image": "1648852588408.jpg",
		"price": "265.96",
		"sized": ["162", "150", "168"],
		"stock": 163
	},
	{
		"title": "Never Summer Yutes Snowboard - Kids' 2022",
		"formattedTitle": "never-summer-yutes-snowboard---kids'-",
		"brand": "never",
		"description": "If you want to light a fire under the next generation of shredders, put them on the Never Summer Yutes Snowboard. Featuring the Original Rocker Camber profile and the same quality construction and materials as their adult boards, the Yutes provides smooth turns and easy, no slam progression for smaller riders. They'll be moving fast – all you have to do is keep up!",
		"image": "1648852590637.jpg",
		"price": "263.99",
		"sized": ["168", "142"],
		"stock": 176
	},
	{
		"title": "Nitro Ripper Snowboard - Kids' 2022",
		"formattedTitle": "nitro-ripper-snowboard---kids'-",
		"brand": "nitro",
		"description": "Snowboarding mastery doesn't happen by accident: it takes a positive mindset, a willingness to take risks, and great gear. Your grom has the first two covered, the Nitro Ripper Snowboard will take care of the rest. This is a legit full wood core board with Nitro's Flat-Out Rocker and Softride Flex for easy learning and turning. It's lively, durable, and comes with a classic twin tip shape, perfect for goofing around the park after a tough morning lesson.",
		"image": "1648852593032.jpg",
		"price": "164.96",
		"sized": ["138", "152", "148", "158"],
		"stock": 98
	},
	{
		"title": "Jones Mini Mind Expander Snowboard - Kids' 2022",
		"formattedTitle": "jones-mini-mind-expander-snowboard---kids'-",
		"brand": "jones",
		"description": "It won't take long to realize that the Jones Mini Mind Expander Snowboard ain't your average junior board. Built with the same features and attention to detail as the full size version, this directional shape is perfect for mini shredders already looking outside the box for creative lines to surf down the mountain. Designed by Chris Christenson and Jeremy Jones with surf rocker for epic float in pow and a short sidecut for snappy turns in tight terrain, it'll propel your grom to new heights on snow.",
		"image": "1648852595819.jpg",
		"price": "339.96",
		"sized": ["138", "142", "150", "162", "158"],
		"stock": 188
	},
	{
		"title": "Burton Chopper Snowboard - Kids' 2022",
		"formattedTitle": "burton-chopper-snowboard---kids'-",
		"brand": "burton",
		"description": "Set your kid up for success by getting them on the Burton Chopper Snowboard. With a range of sizes suited for bigger kids all the way down to the tiniest nuggets, the Chopper is designed to instill a love of snowboarding in kids of all ages. The Flat Top Easy Bevel design makes it hard to catch an edge, and the smooth contours and flex profile make the board fun and forgiving for little rippers to learn the ropes.",
		"image": "1648852599036.jpg",
		"price": "209.95",
		"sized": ["138", "142", "168", "152", "158", "146"],
		"stock": 173
	},
	{
		"title": "K2 Lil Kat Snowboard - Little Girls' 2022",
		"formattedTitle": "k2-lil-kat-snowboard---little-girls'-",
		"brand": "k2",
		"description": "The K2 Lil Kat Snowboard is just the ticket for young riders beginning their snowboarding careers. The Noodle Core construction and Catch-Free Rocker make the Lil Kat extremely forgiving, and a soft flex compliments the package perfectly to give your ripper a head start all over the mountain.",
		"image": "1648852601785.jpg",
		"price": "167.96",
		"sized": ["168", "148", "142", "150"],
		"stock": 33
	},
	{
		"title": "Burton Custom Smalls Snowboard - Boys' 2022",
		"formattedTitle": "burton-custom-smalls-snowboard---boys'-",
		"brand": "burton",
		"description": "The Burton Custom Smalls Snowboard takes the venerable Custom shape down a notch, sizing it for smaller bodies, but keeping the fun factor pegged. With its PurePop Camber profile and Twin Shape, the Custom Smalls gets down with style and snap regardless of which way you're riding it.",
		"image": "1648852604150.jpg",
		"price": "324.95",
		"sized": ["150", "158", "162", "152", "164", "146"],
		"stock": 4
	},
	{
		"title": "Burton Feelgood Smalls Snowboard - Girls' 2022",
		"formattedTitle": "burton-feelgood-smalls-snowboard---girls'-",
		"brand": "burton",
		"description": "The Burton Feelgood Smalls Snowboard is designed for kids who've already mastered the basics of snowboarding and are ready to take the next leap in the progression cycle. This board features a lively PurePop camber profile for more snap off the lip and more energy moving from edge to edge. Still a versatile twin tip shape with the same flex fore and aft, and perfect for young riders seeking to ride regular and switch with equal dexterity, the Feelgood Smalls is worthy of carrying the proven Feelgood name.",
		"image": "1648852605954.jpg",
		"price": "324.95",
		"sized": ["138", "142", "146"],
		"stock": 124
	},
	{
		"title": "CAPiTA Children Of The Gnar Snowboard - Kids' 2022",
		"formattedTitle": "capita-children-of-the-gnar-snowboard---kids'-",
		"brand": "capita",
		"description": "There comes a time when he will rip harder than you. Unfortunately, it's inevitable. The best thing you can do is get him there faster, and the CAPiTA Children Of The Gnar Snowboard is designed to do exactly that. With features like next-generation hybrid camber, this board can go anywhere and do anything a young freestyler puts his mind to.",
		"image": "1648852609152.jpg",
		"price": "297.46",
		"sized": ["164", "138", "162", "168"],
		"stock": 96
	},
	{
		"title": "Nitro Squash Snowboard - Kids' 2022",
		"formattedTitle": "nitro-squash-snowboard---kids'-",
		"brand": "nitro",
		"description": "Your job is to set them up for success in society. To teach them how to be a good person, a caring citizen, and a worthwhile adult. You're a good parent. You're doing everything right. It is now time for a Nitro Squash Snowboard to enter the curriculum. This is the same board the Nitro team uses to achieve their max speeds and all-round enjoyment, just a bit smaller. Your grom deserves it, snowboarding deserves it, the world at large demands it: get your ripper on this board and stand back. They (and you) will thank Nitro for this amazing learning tool. We can't wait to see what your shred spawn does with it!",
		"image": "1648852611911.jpg",
		"price": "322.46",
		"sized": ["150", "152", "148", "142", "168"],
		"stock": 156
	},
	{
		"title": "Nidecker Flake Snowboard - Girls' 2022",
		"formattedTitle": "nidecker-flake-snowboard---girls'-",
		"brand": "nidecker",
		"description": "The Nidecker Flake Snowboard is for the young rippers looking to take this world by storm. Standard CamRock makes this an all-terrain, any condition type of board, so nothing will stand in their way as they master the craft. The reliable N-5000 base is tough and wax-absorbent — easy maintenance for you, smooth ride for the young one, year after year.",
		"image": "1648852613936.jpg",
		"price": "259.95",
		"sized": ["150", "158", "168", "148", "138", "152"],
		"stock": 72
	},
	{
		"title": "K2 Vandal Snowboard - Boys' 2022",
		"formattedTitle": "k2-vandal-snowboard---boys'-",
		"brand": "k2",
		"description": "The K2 Vandal Snowboard is an ideal tool for youth progression, with its calculated twin shape and flat camber profile. Less body slams = more fun = kids who can't wait for the next day on the hill.",
		"image": "1648852616095.jpg",
		"price": "215.96",
		"sized": ["138"],
		"stock": 102
	},
	{
		"title": "Jones Solution Splitboard - Big Kids' 2022",
		"formattedTitle": "jones-solution-splitboard---big-kids'-",
		"brand": "jones",
		"description": "If you're going on a walk in the woods, it'd be a shame not to bring the fam along for the ride.The Jones Solution Splitboard is a youth size splitty with a full blown feature set that will have your brood joining forces to paint a masterpiece down your favorite backcountry line. It's got subtle 3D Base Contour 1.0 shaping, a tapered shape for extra float in pow, and inner edge traction tech for increased grip on the skin track. Don't leave 'em home, venture out together with the kid sized Jones Solution Splitboard!",
		"image": "1648852618274.jpg",
		"price": "450.46",
		"sized": ["162"],
		"stock": 228
	},
	{
		"title": "Nitro Squash Snowboard - Kids' 2021",
		"formattedTitle": "nitro-squash-snowboard---kids'-",
		"brand": "nitro",
		"description": "The adult-size Squash Snowboard is already one of Nitro's most sought after models, and this version lets pint-sized shredders get in on the act too. It's a do-anything deck for ripping groms who like to ride fast and tackle the entire mountain with the kind of style that puts the adults to shame. Trüe Camber ensures ample stability, pop, and responsiveness, while the tapered swallowtail shape and progressive sidecut make it seriously surfy when there's a little fresh to play with. Keep it in the family this season with the Nitro Squash Snowboard.",
		"image": "1648852620186.jpg",
		"price": "343.96",
		"sized": ["150", "152"],
		"stock": 128
	},
	{
		"title": "Nidecker Merc Snowboard - Kids' 2022",
		"formattedTitle": "nidecker-merc-snowboard---kids'-",
		"brand": "nidecker",
		"description": "Let them take ownership of the sport. The Nidecker Merc Snowboard is for young kids who don't need a proctor to chaperone their turns anymore. Bunny hills are done, time for this snowshoe hare to start hopping around the mountain. The low-maintenance base under a strong, responsive wood core provides perfect flex and comfortable landings to support growing bodies.",
		"image": "1648852622254.jpg",
		"price": "259.95",
		"sized": ["150", "162", "164"],
		"stock": 109
	},
	{
		"title": "Yes. Fun Inc. Snowboard - Kids' 2022",
		"formattedTitle": "yes.-fun-inc.-snowboard---kids'-",
		"brand": "yes.",
		"description": "If your lil' ripper has out-paced the green runs, then it's time to get them set up with the Yes. Fun Inc. Snowboard. This fully rockered shred sled and it's full Poplar core is lightweight, springy, and durable, perfect for groms who shred anything, anywhere.",
		"image": "1648852623947.jpg",
		"price": "212.46",
		"sized": ["142", "150", "158"],
		"stock": 17
	}
]
