[
	{
		"title": "Ride Psychocandy x Akomplice Snowboard 2022",
		"formattedTitle": "ride-psychocandy-x-akomplice-snowboard-",
		"brand": "ride",
		"description": "The Ride Psychocandy x Akomplice Snowboard is a rad collab that we're stoked to get behind. Proceeds from this board will go to helping indigenous people in Columbia to protect their land from deforestation and development, bringing attention to global health awareness. It helps that the board absolutely rips, too. Available in unisex sizing, the Psychocandy is a directional all-mountain tool that absolutely crushes in deep snow and challenging terrain while remaining versatile enough to slash around as you wait for the next storm to roll in.",
		"image": "1648852288587.jpg",
		"price": "519.99",
		"sized": ["142", "162", "168", "152"],
		"stock": 189
	},
	{
		"title": "Burton Custom Snowboard 2023",
		"formattedTitle": "burton-custom-snowboard-",
		"brand": "burton",
		"description": "The Burton Custom Snowboard is quintissential Burton. Pure, unadulterated, triple distilled Burton served up neat - extra chilled. This classic, do-everything shape has attained GOAT status over the years for its sustained brilliance as an all mountain ride. Laid up around a Super Fly™ II 700G core, with woven 45˚ Carbon Highlights in the glass and full Camber for added edge hold and pop, the Custom is all you ever wanted from a daily driver.",
		"image": "1648852290782.jpg",
		"price": "659.95",
		"sized": ["138", "148", "168", "152", "142"],
		"stock": 60
	},
	{
		"title": "GNU Airblaster Gremlin Collab Snowboard 2022",
		"formattedTitle": "gnu-airblaster-gremlin-collab-snowboard-",
		"brand": "gnu",
		"description": "If you're serious about fun, get the the GNU Airblaster Gremlin Collab Snowboard on your radar pronto. This deck is built for mountain mischief of the highest order, incorporating a nimble volume shifted design with a lightweight wood core and poppy C3 camber for bomber freeride performance. It'll hang on everything from sketchy ice wall straightlines to laid back hippy pow surf sessions, and it's a blast to whip around in the trees. This limited edition model lays the style on thick with an exclusive Airblaster collab topsheet. There were some additional instructions about feeding it before midnight, or after midnight - we don't exactly remember but we're sure you'll be fine.",
		"image": "1648852293053.jpg",
		"price": "559.99",
		"sized": ["150", "152"],
		"stock": 101
	},
	{
		"title": "GNU Head Space Worble Edition Snowboard 2022",
		"formattedTitle": "gnu-head-space-worble-edition-snowboard-",
		"brand": "gnu",
		"description": "If you're one of the folks who needs to think about their entire life before dropping in, consider getting the GNU Head Space Worble Edition Snowboard to quiet your mind. Featuring asymmetric construction, Magne-Traction edges, and signature C3 camber, this comp-level jib machine will boost your confidence and progression in the park and beyond. This model comes in hot with an exlusive Worble collab topsheet to rep the board sport love extra hard.",
		"image": "1648852295332.jpg",
		"price": "559.99",
		"sized": ["146", "158", "168", "152", "142"],
		"stock": 245
	},
	{
		"title": "Burton Family Tree Hometown Hero Snowboard 2023",
		"formattedTitle": "burton-family-tree-hometown-hero-snowboard-",
		"brand": "burton",
		"description": "If you're the guy whispering in hushed tones about top secret lines, talking in hand signals known only to you and your tightest crew, we have the board for you. The Burton Family Tree Hometown Hero Snowboard is the choice of superlocals, hidden stashers, and all-season slashers. Designed to blast through bunk and lay waste to chunk on its way to the holy land of deep funk, the Hometown Hero is an all-around ripper's ride. A moderately stiff flex and directional camber profile combine with a little taper and a lotta setback for a ride that lays the hammer through pow and crud alike. You're never going to achieve hero status by dinking around: get charging!",
		"image": "1648852297475.jpg",
		"price": "659.95",
		"sized": ["146", "142", "152", "164", "150"],
		"stock": 234
	},
	{
		"title": "Burton Process Snowboard 2023",
		"formattedTitle": "burton-process-snowboard-",
		"brand": "burton",
		"description": "You may have gotten your start in the park, but it pays to have a board that's capable of handling it all. The Burton Process Snowboard is a lightweight twin tuned up for kicker building, side-hit hunting all mountain freestylers. Its twin shape and flex combine with a poppy, energetic Super Fly II core for reliable handling in the park and beyond, along with Squeezebox core profiling designed to effectively transfer energy to the extremities for improved stability and snap. When you're ready to showcase your moves all over ther mountain, trust the Process to take care of business.",
		"image": "1648852299716.jpg",
		"price": "549.95",
		"sized": ["150", "152", "162", "138", "148"],
		"stock": 178
	},
	{
		"title": "Burton Name Dropper Snowboard 2022",
		"formattedTitle": "burton-name-dropper-snowboard-",
		"brand": "burton",
		"description": "You're uhhh, kind of a big deal. A big time hucker with the clips to prove it. That's why you need a board built for the park, by the park. The Burton Name Dropper Snowboard revolves around Burton's Off-Axis shapes, meaning everything from the edges to the core profile has been crafted with an open park stance for full symmetry and optimal freestyle performance. It's not who know but how you shred, after all.",
		"image": "1648852301935.jpg",
		"price": "499.95",
		"sized": ["150"],
		"stock": 106
	},
	{
		"title": "Burton Family Tree Hometown Hero Splitboard 2022",
		"formattedTitle": "burton-family-tree-hometown-hero-splitboard-",
		"brand": "burton",
		"description": "The backcountry holds a dirty little secret that Big Snowboard Inc™ doesn't want you to know. The truth is, it's not all rainbows and white rooms. In fact, it's kinda hard. For every pristine 2k of untouched pow, there's 10k of refrozen slop. For every panoramic, bluebird mountaintop, there are 10 blustery ridgelines that send you scrambling for the puffy buried deep in your pack. That's why it pays to have tool like the Burton Family Tree Hometown Hero Splitboard in your arsenal. It gives you the same the full-on charging, slashing, floating fun of the solid version, but in an upwardly mobile package that's ready for anything the backcountry throws at you. It won't make everything easy, but it'll turn those challenging days into something that looks a whole lot more like fun.",
		"image": "1648852304408.jpg",
		"price": "849.95",
		"sized": ["158"],
		"stock": 241
	},
	{
		"title": "Burton Process Flying V Snowboard 2022",
		"formattedTitle": "burton-process-flying-v-snowboard-",
		"brand": "burton",
		"description": "The Burton Process Flying V Snowboard has been in the Burton lineup for years, and though a rocker profile like the Flying V once was considered radical, it's a proven part of the formula for boards the pivot on a dime yet hold an edge when you lay them over. This twin shape rides with equal prowess either direction, handles the steep and deep as well as the terrain park, and it's all bound together with Burton's premium Super Fly™ 700G construction.",
		"image": "1648852306797.jpg",
		"price": "529.95",
		"sized": ["150", "138"],
		"stock": 143
	},
	{
		"title": "Season Pass Splitboard 2022",
		"formattedTitle": "season-pass-splitboard-",
		"brand": "season",
		"description": "If you thought Austin Smith was going to stop at the ropeline and let someone else plunder the deep stuff, you thought wrong. The Season Pass Splitboard is a one-way ticket to backcountry nirvana designed to make the most out of life on the skin track. Based on the all terrain Nexus snowboard, the Season Pass brings powder to the people with a versatile directional twin shape and sizing appropriate for both men and women, young and old. Throw in some pre-cut climbing skins and a durable layup engineered for longevity, and you've got the perfect platform to earn your turns season after season.",
		"image": "1648852309129.jpg",
		"price": "760.00",
		"sized": ["158"],
		"stock": 238
	},
	{
		"title": "Burton Instigator PurePop Camber Snowboard 2022",
		"formattedTitle": "burton-instigator-purepop-camber-snowboard-",
		"brand": "burton",
		"description": "The Burton Instigator PurePop Camber Snowboard is the same relaxed and forgiving ride you know and love, but with the added snap of a cambered mid-section. The soft overall flex means lots of fun in fresh snow and less chance of body slams when it's hard, all good things. Burton doesn't cut corners when it comes to intermediate boards, and the Instigator PurePop features the same Super Fly® 800G core and Frostbite Edges as many of the more advanced options so you can relax and concentrate on the riding.",
		"image": "1648852311263.jpg",
		"price": "419.95",
		"sized": ["148", "168"],
		"stock": 247
	},
	{
		"title": "Burton Cartographer Snowboard 2022",
		"formattedTitle": "burton-cartographer-snowboard-",
		"brand": "burton",
		"description": "Mapping out next season's pow lines during the summer might be in order, because when the Burton Cartographer Snowboard hits the stands you'll want to be ready to get after it without hesitation. This pow-friendly all mountain shape comes ready to shred with the bomber Super Fly® 800G core, powerful Triax™ glass laminates, and a slightly tapered shape for boosted performance when the going gets deep.",
		"image": "1648852313748.jpg",
		"price": "469.95",
		"sized": ["150", "146", "164"],
		"stock": 32
	},
	{
		"title": "Burton Skeleton Key Snowboard 2022",
		"formattedTitle": "burton-skeleton-key-snowboard-",
		"brand": "burton",
		"description": "Think of the Burton Skeleton Key Snowboard as a tool for unlocking all the powdery goodness winter has to offer without burdening yourself with a bulky pow-specific board day in and day out. Combining directional camber with tons of tip rocker and a \"key slot\" tail, the Skeleton Key floats like a marshmallow in hot cocoa but doesn't leave you gasping for control getting back to the lift on the groomers.",
		"image": "1648852316755.jpg",
		"price": "549.95",
		"sized": ["158", "164"],
		"stock": 55
	},
	{
		"title": "Burton Process Snowboard 2022",
		"formattedTitle": "burton-process-snowboard-",
		"brand": "burton",
		"description": "Trust the Process and you shall be rewarded. The Burton Process Snowboard has been a trusted member of the family for years. A tweak here, a small update there, but nonetheless it has remained one of the best twin quiver killers in the game. Frostbite Edges improve traction on hardpack, a versatile twin shape and flex offer reliable handling in the park, and a light weight build makes for a ride that's just as inviting on the last lap of the day as it is on the first.",
		"image": "1648852319275.jpg",
		"price": "529.95",
		"sized": ["148", "150", "158", "164", "162", "142"],
		"stock": 35
	},
	{
		"title": "Salomon Super 8 Splitboard 2022",
		"formattedTitle": "salomon-super-8-splitboard-",
		"brand": "salomon",
		"description": "Like powder? You're gonna love the Salomon Super 8 Splitboard. This backcountry explorer combines surfy Backseat Camber with a setback stance for the rider who likes a little extra sauce when the going gets deep, with Salomon's lightweight Ghost Green Core to keep the turns nimble and silky smooth. Throw in a set of industry-leading pre-cut skins from Pomoca, and you've got a one way ticket to the wilderness white room.",
		"image": "1648852341977.jpg",
		"price": "639.96",
		"sized": ["138", "148", "142", "152", "162"],
		"stock": 97
	},
	{
		"title": "K2 Raygun Snowboard 2022",
		"formattedTitle": "k2-raygun-snowboard-",
		"brand": "k2",
		"description": "Don't bring a light sabre to a blaster fight, choose the K2 Raygun Snowboard and be ready to battle. This light but solid classic is one of K2's biggest sellers because it delivers a ton of performance for the money. An all-Aspen core, ICG™ 10 Carbon Glass laminate construction, and a tough Extruded 2000 Base are all part of the package.",
		"image": "1648852344254.jpg",
		"price": "356.96",
		"sized": ["158", "152", "168", "138", "164", "150"],
		"stock": 249
	},
	{
		"title": "K2 Excavator Snowboard 2022",
		"formattedTitle": "k2-excavator-snowboard-",
		"brand": "k2",
		"description": "Backside to frontside, powder to corduroy, you're going to dig the new K2 Excavator Snowboard. This all new addition to the K2 freeride lineup is powerful but forgiving, just the ticket for all-conditions fun in, well, all conditions. Pre-cambered Carbon Power Forks in the tail of the board provide added snap for ollies and precision coming out of turns, and a new multi-radius sidecut aids in turn initiation. Dig deep if you need to to buy this board, it's all you really need for any day on the mountain.",
		"image": "1648852347305.jpg",
		"price": "467.46",
		"sized": ["146", "142", "158"],
		"stock": 214
	},
	{
		"title": "Jones Stratos Splitboard 2023",
		"formattedTitle": "jones-stratos-splitboard-",
		"brand": "jones",
		"description": "We love the Stratos, and we love the backcountry. Ergo, we love the Jones Stratos Splitboard. This all new split brings the same do anything, go anywhere energy of the solid to an altogether larger alpine canvas. It combines a directional shape with freestyle board feel for an insanely versatile hybrid shape that's just as comfortable arcing perfect carves as it is slashing pow turns and buttering off backcountry booters. Laid up with Jones' finest tech for optimal performance on the skin track and descent alike, this board will revolutionize your approach to touring.",
		"image": "1648852349895.jpg",
		"price": "949.95",
		"sized": ["150"],
		"stock": 213
	},
	{
		"title": "CAPiTA Spring Break Powder Twin Snowboard 2022",
		"formattedTitle": "capita-spring-break-powder-twin-snowboard-",
		"brand": "capita",
		"description": "Yeah, that's right: CAPiTA Spring Break Powder Twin Snowboard. Powder. Twin. It makes sense when you remember the surfy, playful, don't-take-yourself-so-seriously ethos of the Spring Break line. The Powder Twin keeps the extra wide waist, the tight, carvey turn radius, and gentle Surf Rocker profile of its directional cousins, but packages them together in a Twin shape that's perfect for playful freestyle powder riding. Grab your homies and get to work that backcountry booter you've been talking about for years, this is the board you've been waiting for.",
		"image": "1648852353122.jpg",
		"price": "450.46",
		"sized": ["164", "150", "142", "158", "152", "138"],
		"stock": 163
	},
	{
		"title": "Lib Tech Lost Quiver Killer C3 Snowboard 2022",
		"formattedTitle": "lib-tech-lost-quiver-killer-c3-snowboard-",
		"brand": "lib",
		"description": "You could dedicate all of your time and energy to fine tuning your board choice to the exact conditions of the day - and you have 12 of them so it's a damn near full time job - or you could pick up the Lib Tech Lost Quiver Killer C3 Snowboard and ride safe in the knowledge that you've got the perfect board for everything the resort could possibly throw at you. Seriously, this is the only one you need. It doesn't matter if you wake up to 18\" of powder or 18 days without so much as a whisper of snow, it'll seek and destroy and go back for seconds. Quivers are over - the Lib Tech Lost Quiver Killer C3 Snowboard is the future.",
		"image": "1648852355313.jpg",
		"price": "419.99",
		"sized": ["158", "164", "148", "168", "150"],
		"stock": 223
	},
	{
		"title": "Arbor Coda Rocker Splitboard 2022",
		"formattedTitle": "arbor-coda-rocker-splitboard-",
		"brand": "arbor",
		"description": "The Arbor Coda Rocker Splitboard brings the legendary versatility and performance of the Coda to the backcountry. Based on a design that's earned renown for its ability to handle varied conditions with ease, this split guarantees confidence in whatever you find beyond the resort boundaries. Arbor's System Rocker profile is easy to turn in challenging snow and excellent in soft snow, the lightweight construction ideal for flying up the skin track and down your favorite line.",
		"image": "1648852357718.jpg",
		"price": "662.99",
		"sized": ["146", "162"],
		"stock": 163
	},
	{
		"title": "GNU Essential Service Snowboard 2022",
		"formattedTitle": "gnu-essential-service-snowboard-",
		"brand": "gnu",
		"description": "One board that's not going out of style any time soon, in this economy or any other, is the GNU Essential Service Snowboard. A directional speed demon for freeriders seeking out secret stashes and sketchy steeps. The C2 Hybrid profile perfectly blends rocker and camber so you can rip everything from fresh powder to spicy chunder fields, while Magne-Traction steak knife edges allow you to slice your line like a medium-rare filet mignon no matter how firm the snow. A portion of the proceeds from this board goes to @theserviceboard to mentor kids and create awesome outdoor experiences, much like the ones you'll get from the GNU Essential Service Snowboard.",
		"image": "1648852359897.jpg",
		"price": "321.99",
		"sized": ["142", "138", "164", "162"],
		"stock": 70
	},
	{
		"title": "GNU GWO BTX Snowboard 2022",
		"formattedTitle": "gnu-gwo-btx-snowboard-",
		"brand": "gnu",
		"description": "Fun, easy to ride, and capable of greatness in tough conditions. Isn't that what we're all looking for in a snowboard? If you haven't found it yet, you've found it here, in the GNU GWO BTX Snowboard. This deck is built for resort greatness with Banana Rocker, Magne-Traction edges, and a poppy, long lasting eco-friendly construction. It's like a snowboarding greatest hits package, just for you.",
		"image": "1648852362837.jpg",
		"price": "279.99",
		"sized": ["164", "146", "168", "148", "142"],
		"stock": 22
	},
	{
		"title": "Lib Tech T.Rice Orca Snowboard 2022",
		"formattedTitle": "lib-tech-t.rice-orca-snowboard-",
		"brand": "lib",
		"description": "What's your idea of fun? Painting watercolors? Watching sportsball? Sitting on the couch giving the old thumbs a workout? They're all valid, of course, but if your idea of fun involves tossing yourself down mountains, snorkeling through bottomless snow, and breaching like a stoked out sea creature, boy do we have the tool for you. The Lib Tech T.Rice Orca Snowboard is king among all-terrain vehicles, and Travis Rice's go-to tool for slicing up the resort and sidecountry alike. It rails groomers, smashes pow, floats like a dream, and handles spicy tech zones with ease. It is quite simply one of the most capable all mountain boards in the biz. Sound like fun?",
		"image": "1648852365424.jpg",
		"price": "454.99",
		"sized": ["164", "162", "150", "142"],
		"stock": 218
	},
	{
		"title": "Ride Twinpig Snowboard 2022",
		"formattedTitle": "ride-twinpig-snowboard-",
		"brand": "ride",
		"description": "It's hard to argue with a pig that goes forward and backward with equal alacrity. The Ride Twinpig Snowboard is the twin version of Ride's proven Warpig, and we're not about to pick a bone with it. This board found tremendous acceptance among big mountain freestyle adherents when it debuted, and this year's upgraded Slim Walls™ sidewall construction is only going to boost performance further with improved energy transfer, lighter weight, and better damping underfoot.",
		"image": "1648852368050.jpg",
		"price": "449.96",
		"sized": ["158"],
		"stock": 65
	},
	{
		"title": "Ride Warpig Snowboard 2022",
		"formattedTitle": "ride-warpig-snowboard-",
		"brand": "ride",
		"description": "One of the hottest freeride boards of the last decade continues to wallow in its success, but it hasn't grown complacent. With a new Slim Walls™ construction, the Ride Warpig Snowboard gets stronger AND lighter, setting the stage for yet another epic winter. This board was designed to slaughter big mountain lines like a boss, but has found a surprising amount of success in freestyle venues as well. For the all-mountain warrior who takes the challenge of speed and air personally, there isn't a better choice than the Warpig.",
		"image": "1648852370083.jpg",
		"price": "423.96",
		"sized": ["152", "138", "168", "142", "148", "164"],
		"stock": 218
	},
	{
		"title": "Ride Superpig Snowboard 2022",
		"formattedTitle": "ride-superpig-snowboard-",
		"brand": "ride",
		"description": "Add some stiffness, camber, and space age tech to the proven Warpig design, and BOOM! you've got the Ride Superpig Snowboard. Upgraded with the lighter and edgier Carbon Slim Walls® construction for even quicker response and more powerful carves, this one is ready for warp speed riding all over the mountain. When pigs fly, we'll all be riding this, but for now you've got the edge because you saw it here first.",
		"image": "1648852373399.jpg",
		"price": "471.96",
		"sized": ["138", "162"],
		"stock": 177
	},
	{
		"title": "Jones Frontier Splitboard 2022",
		"formattedTitle": "jones-frontier-splitboard-",
		"brand": "jones",
		"description": "The Jones Frontier is a snowboarders' snowboard. The old-school, do-everything freeride shape is directional but not one dimensional, sturdy but not stiff, and feels as comfortable as your favorite pair of sneakers. So taking that same natural feel to a backcountry setup that you're going to need to do everything just makes sense. The Jones Frontier Splitboard is the perfect one stop shop for all your backcountry needs. Combining floaty directional rocker with a freestyle-inspired tail and a playful flex, this board rails, hucks, and stomps in all types of terrain, while Traction Tech 2.0 edges ensure grip and stability when things are firm, whether arcing turns on the descent or side-hilling up an icy skin track. Float through the soft stuff, harvest the corn and hit every natural feature on the way down; the Jones Frontier Splitboard is the wing man you've been waiting for.",
		"image": "1648852375784.jpg",
		"price": "637.46",
		"sized": ["158"],
		"stock": 242
	},
	{
		"title": "Salomon Sleepwalker Snowboard 2022",
		"formattedTitle": "salomon-sleepwalker-snowboard-",
		"brand": "salomon",
		"description": "No, don't dose up on Ambien and wander out half-conscious in the middle of the night - the sleepwalking we're talking about is on the Salomon Sleepwalker Snowboard, a precision tool for fully-conscious shredding in the park and pipe. With its forgiving flex, true twin shaping and Freestyle Edge Bevel, the Sleepwalker is made for spinning, buttering and airing to your heart's content - just make sure your eyes are open so you can stick the landings.",
		"image": "1648852377747.jpg",
		"price": "279.96",
		"sized": ["150", "146", "162"],
		"stock": 246
	},
	{
		"title": "Salomon Sight Snowboard 2022",
		"formattedTitle": "salomon-sight-snowboard-",
		"brand": "salomon",
		"description": "The Salomon Sight Snowboard provides the vision and clarity you need for top level freeriding. This versatile directional twin works across a wide range of conditions from pow to corduroy, with a tough Aspen core and forgiving Quadratic sidecut that makes each turn better than the last.",
		"image": "1648852380288.jpg",
		"price": "297.46",
		"sized": ["164", "138", "168"],
		"stock": 162
	},
	{
		"title": "Salomon Huck Knife Pro Snowboard 2022",
		"formattedTitle": "salomon-huck-knife-pro-snowboard-",
		"brand": "salomon",
		"description": "The familiar blunt-nosed shape of the regular Huck Knife pokes through, but the Salomon Huck Knife Pro Snowboard features more \"Huck\", more guts, and more power. A stiffer flex and the addition of Gunslinger Sidewalls make the Huck Pro both poppier and damper at speed, so you can throw your hardest with confidence. The regular details that make the Huck Knife a freestyle favorite are all still there - what are you waiting for?",
		"image": "1648852383329.jpg",
		"price": "439.96",
		"sized": ["150"],
		"stock": 38
	},
	{
		"title": "Salomon Craft Snowboard 2022",
		"formattedTitle": "salomon-craft-snowboard-",
		"brand": "salomon",
		"description": "The Salomon Craft Snowboard is your confirmed ticket to freeride happiness, from pow days to railing groomers to launching big hits in the park. This deck can easily stake a claim as Salomon's most capable all rounder, a former winner of Transworld's \"Bang for the Buck\" award, and a perennial best-seller every season. Hone your craft with one of the most versatile boards in the game.",
		"image": "1648852386716.jpg",
		"price": "339.96",
		"sized": ["142", "152", "162", "158", "150"],
		"stock": 52
	},
	{
		"title": "CAPiTA Outerspace Living Snowboard 2022",
		"formattedTitle": "capita-outerspace-living-snowboard-",
		"brand": "capita",
		"description": "The CAPiTA Outerspace Living Snowboard blends all-terrain camber with a true twin freestyle shape for the most cosmically crispy ride this side of Pluto. While living in Outerspace is still a pipe dream (plus there's no snow so fuggedaboutit), this deck was crafted with a send-it-to-the-moon mentality that's easy to get on board with. If you plan on crushing pow in the morning followed by park laps in the afternoon, the CAPiTA Outerspace Living Snowboard should be your vehicle of choice.",
		"image": "1648852389389.jpg",
		"price": "404.96",
		"sized": ["158", "150", "164", "168", "146", "152"],
		"stock": 238
	},
	{
		"title": "Salomon Huck Knife Snowboard 2022",
		"formattedTitle": "salomon-huck-knife-snowboard-",
		"brand": "salomon",
		"description": "LIke running with scissors, riding with the Salomon Huck Knife Snowboard has its risks. We don't think you'll stab yourself, but be forewarned: The thrill of sticking a new trick on a regular basis on the Huck Knife can be addicting. This board is one Salomon's biggest sellers, and for good reason - it excels in the park and rewards expertise but doesn't punish the rider working their way up the learning curve. Built with Quad Camber for pop and energy without the sometimes taxing demands of full camber, and with a medium stone structured sintered base for speed without suction, the Huck Knife is the multi-tool you seek.",
		"image": "1648852391726.jpg",
		"price": "359.96",
		"sized": ["162", "146"],
		"stock": 230
	},
	{
		"title": "Salomon Assassin Snowboard 2022",
		"formattedTitle": "salomon-assassin-snowboard-",
		"brand": "salomon",
		"description": "The Salomon Assassin Snowboard is designed as Salomon's do-it-all killer, and it delivers like the UPS dude. A versatile tapered directional profile set up with a freestyle-oriented stance and rocker profile make this the best of many different worlds, soaring to new heights in the park while ripping big mountain lines with confidence.",
		"image": "1648852394206.jpg",
		"price": "399.96",
		"sized": ["148", "150", "152"],
		"stock": 159
	},
	{
		"title": "Salomon Pulse Snowboard 2022",
		"formattedTitle": "salomon-pulse-snowboard-",
		"brand": "salomon",
		"description": "The Salomon Pulse Snowboard is a versatile, easy-to-love all-mountain ride that doesn't penalize you for little mistakes. With a softer flex and Bite Free Edges, it helps make the most of every day on the mountain - perfect for expanding your range of abilities and moving up the learning curve with confidence.",
		"image": "1648852396902.jpg",
		"price": "269.99",
		"sized": ["138", "164", "158"],
		"stock": 64
	},
	{
		"title": "Salomon Dancehaul Snowboard 2022",
		"formattedTitle": "salomon-dancehaul-snowboard-",
		"brand": "salomon",
		"description": "The Salomon Dancehaul Snowboard is a master of all snow: a fast, carvey freestyle board that will amaze you in any conditions. With its distinctive shape and extra width, the Dancehaul serves up the goods in fresh but also rips in the park - a combination you'll appreciate over the course of a long winter. Salomon has the details dialed with Rock Out Camber, Ghost Basalt Stringers for dampening, and a powerful Aspen SLCT core.",
		"image": "1648852399382.jpg",
		"price": "359.96",
		"sized": ["158", "138", "142", "146", "162"],
		"stock": 235
	},
	{
		"title": "K2 Afterblack Snowboard 2022",
		"formattedTitle": "k2-afterblack-snowboard-",
		"brand": "k2",
		"description": "The K2 Afterblack Snowboard is an all-mountain freestyle board designed for skilled riders who appreciate balanced performance and energy, and know how to put it to good use. With K2's BAP core, Carbon DarkWeb™ for pop and power, and a fast Sintered 4000 Base that glides like lightening, the Afterblack is the tool of choice for taking your park maneuvers on tour all over the mountain.",
		"image": "1648852401137.jpg",
		"price": "390.96",
		"sized": ["164"],
		"stock": 13
	},
	{
		"title": "Salomon Speedway Splitboard 2022",
		"formattedTitle": "salomon-speedway-splitboard-",
		"brand": "salomon",
		"description": "The Salomon Speedway Splitboard longs for the open skintrack and beyond. When you're tired of fighting the crowd for fresh lines at the resort, the Speedway is the highway for you. Built with speed, power, and deep snow in mind, the Speedway Split features Backseat Camber, a snappy Quadratic Core, and comes skin track ready with pre-cut, best-in-the-business Pomoca skins.",
		"image": "1648852403605.jpg",
		"price": "719.96",
		"sized": ["150", "164"],
		"stock": 105
	},
	{
		"title": "Burton Custom Flying V Snowboard 2022",
		"formattedTitle": "burton-custom-flying-v-snowboard-",
		"brand": "burton",
		"description": "When Burton says this is \"their most trusted board\", it's saying a lot. And they're not wrong. The Burton Custom Flying V Snowboard is a classic, do-everything shape that has attained legendary status over the years for its sustained brilliance as an all mountain ride. Laid up around a Super Fly™ II 700G core, with woven in 45˚ Carbon Highlights in the glass, this version comes with Burton's Flying V rocker profile for a surfier, more playful ride. The Custom does a little of everything, and does it all well.",
		"image": "1648852406215.jpg",
		"price": "629.95",
		"sized": ["148", "146", "138", "152", "168", "150"],
		"stock": 190
	}
]
