[
	{
		"title": "K2 Aspect Snowboard Boots 2022",
		"formattedTitle": "k2-aspect-snowboard-boots-",
		"brand": "k2",
		"description": "A burly boot with its eyes set on the backcountry, the K2 Aspect Snowboard Boots are built with big mountain durability in mind. They come with a heavy duty Vibram® Mountaineer outsole built for tromping over glacial talus, traditional lacing, and liners designed with a grippy bottom so you can chill in them while snow camping. When your idea of fun entails days or weeks away from the trailhead, much less the lifts, the Aspects belong on your feet.",
		"image": "1648851073348.jpg",
		"price": "399.96",
		"sized": ["S", "M", "L"],
		"stock": 175
	},
	{
		"title": "Ride Orion Snowboard Boots 2022",
		"formattedTitle": "ride-orion-snowboard-boots-",
		"brand": "ride",
		"description": "For riders who are just starting out and determined to shoot for the stars, look no further than the Ride Orion Snowboard Boots. Ride's In2grated™ construction pairs with a plush Intuition™ liner for fantastic out of the box comfort, while the internal J Bars offer tons of support for a locked in, confidence inspiring fit.",
		"image": "1648851075763.jpg",
		"price": "152.96",
		"sized": ["S", "M", "L"],
		"stock": 183
	},
	{
		"title": "DC Judge Boa Snowboard Boots 2022",
		"formattedTitle": "dc-judge-boa-snowboard-boots-",
		"brand": "dc",
		"description": "Judge, jury, executioner. This is the boot that sets the tempo. The go-to boot for DC's stacked roster of team riders, the Judge Boa Snowboard Boots provides that impeccable balance of responsiveness and smooth flex that progressive riders are drawn to - enough power to react quickly on steep faces, but with the give and stability for pop and controlled style. Take control of your setup and put the hammer down - the DC Judge Boa Snowboard Boots are the boots you need to take your riding to the stratosphere.",
		"image": "1648851078650.jpg",
		"price": "247.46",
		"sized": ["S", "M", "L"],
		"stock": 5
	},
	{
		"title": "DC Mutiny Snowboard Boots 2022",
		"formattedTitle": "dc-mutiny-snowboard-boots-",
		"brand": "dc",
		"description": "Re-designed this season, the freestyle-favorite DC Mutiny Snowboard Boots double down on their \"skate shoe made for snowboarding\" accolades. A favorite of park purists, the traditional lacing is ultra-customizable and ensures total heel control. Couple that with a grippy, cushioned UniLite outsole that takes the harshness out of huge landings and you have a boot that sets the standard for freestyle performance.",
		"image": "1648851081584.jpg",
		"price": "139.99",
		"sized": ["S", "M", "L"],
		"stock": 46
	},
	{
		"title": "Burton Ion Snowboard Boots 2021",
		"formattedTitle": "burton-ion-snowboard-boots-",
		"brand": "burton",
		"description": "Crank up the voltage and conduct your descent down the most volatile lines with the Burton Ion Snowboard Boots. These powerhouses pack an aggressive flex that makes for incredibly responsive riding, while the heat-moldable Life Liners and Tuff Cuffs keep your heels and ankles locked in at lightning speeds. Fortunately, good looks and high-performance don't come at the cost of comfort. Total Comfort construction ensures an instantly broken-in feel from day one, so you can step in and charge without dilly-dallying. If you ride with the tenacity of a raging bull and the precision of Bob Ross's paintbrush, then the Burton Ion Snowboard Boots should be in your wheelhouse.",
		"image": "1648851084364.jpg",
		"price": "539.95",
		"sized": ["S", "M", "L"],
		"stock": 164
	},
	{
		"title": "DC Control Boa Snowboard Boots 2022",
		"formattedTitle": "dc-control-boa-snowboard-boots-",
		"brand": "dc",
		"description": "Perhaps the most versatile boot in the DC lineup, the DC Control Boa Snowboard Boots are the ultimate top-to-bottom performer. Their medium flex has just enough support to sustain high speed lines and pow, with the give and tweakbility you need for side hits and the terrain park. They're ease-of-use is off the charts too - a dual Boa closure and skate-style outsole make them the boot of choice for riders shredding the full mountain landscape.",
		"image": "1648851086830.jpg",
		"price": "188.96",
		"sized": ["S", "M", "L"],
		"stock": 46
	},
	{
		"title": "K2 Maysis Snowboard Boots 2021",
		"formattedTitle": "k2-maysis-snowboard-boots-",
		"brand": "k2",
		"description": "The K2 Maysis Snowboard Boots are the best-selling boots in the world for a reason. They've got a super smooth flex that's just on the al dente side of medium, backed up by a double reel Boa system. The Intuition Control liner is super comfy and has a precision fit, and the whole boot is made with K2's top of the line Endo 2.0 construction. It's like an All-Star team of boot components. Each piece has been hand selected for quality and mass appeal, and integrated with perfection into a true masterpiece of bootsmanship.",
		"image": "1648851090200.jpg",
		"price": "280.46",
		"sized": ["S", "M", "L"],
		"stock": 182
	},
	{
		"title": "thirtytwo TM-Two Double Boa Wide Merrill Snowboard Boots 2022",
		"formattedTitle": "thirtytwo-tm-two-double-boa-wide-merrill-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "And you thought the regular thirtytwo boots were wide and comfy? It wasn't enough for Bode Merrill, and he asked for an even wider last on his pro model. The result is the thirtytwo TM-Two Double Boa Wide Merrill Snowboard Boots, which add another 18mm of width in the forefoot for true Sasquatch foot relief. This is a stout boot with a \"7\" flex and dual Boa® Fit System closures, and deserves a close look if your feet are seriously wide.",
		"image": "1648851092690.jpg",
		"price": "335.71",
		"sized": ["S", "M", "L"],
		"stock": 180
	},
	{
		"title": "thirtytwo STW Double Boa Snowboard Boots 2021",
		"formattedTitle": "thirtytwo-stw-double-boa-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "Full customization meets ultimate comfort in the thirtytwo STW Double Boa Snowboard Boots. The dual zone precision fit keeps you locked into the comfort liner, footbed, and harness, giving your feet cold-weather serenity inside your boots while you experience the ever-changing mountain terrain. Find who you are as a snowboarder in the thirtytwo STW Double Boa Snowboard Boots. You'll get more out of a season pass if you have gear that supports your urge to ride from first chair to last.",
		"image": "1648851095206.jpg",
		"price": "224.99",
		"sized": ["S", "M", "L"],
		"stock": 13
	},
	{
		"title": "thirtytwo TM-Two Double Boa Snowboard Boots 2022",
		"formattedTitle": "thirtytwo-tm-two-double-boa-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "A day in the thirtytwo TM-Two Double Boa Snowboard Boots is a day in paradise. Spend the morning riding in a foot of pow and the PM throwing down in the park. Dial up the double boa for a good fit in a flash and head out with your board under your arm. It's that simple.",
		"image": "1648851097375.jpg",
		"price": "384.95",
		"sized": ["S", "M", "L"],
		"stock": 110
	},
	{
		"title": "thirtytwo Shifty Snowboard Boots 2021",
		"formattedTitle": "thirtytwo-shifty-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "Whether you're a beginner excited to progress in your riding or a seasoned vet in need of a forgiving boot for the park, the thirtytwo Shifty Snowboard Boots will suit your fancy. Comfy Tongue, Comfort Liner, and an Evolution foam outsole make the Shifty an easy choice for all-day riding comfort.",
		"image": "1648851100028.jpg",
		"price": "144.99",
		"sized": ["S", "M", "L"],
		"stock": 35
	},
	{
		"title": "thirtytwo Light JP Snowboard Boots 2021",
		"formattedTitle": "thirtytwo-light-jp-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "Built for and tested by JP Walker, the thirtytwo Light JP Snowboard Boots are incredibly comfortable and super flexible, allowing you the feeling of freedom that everyone's in search of when they hit the slopes. Plush liners with included footbeds help soften the harshness of occasionally choppy resort terrain so you ride no matter the conditions. Whether you're tapping rails all day or throwing everything you've got into backcountry pow stashes, you and your feet will be happy in the thirtytwo Light JP Snowboard Boots.",
		"image": "1648851102525.jpg",
		"price": "159.96",
		"sized": ["S", "M", "L"],
		"stock": 104
	},
	{
		"title": "DC Scout Boa Snowboard Boots 2022",
		"formattedTitle": "dc-scout-boa-snowboard-boots-",
		"brand": "dc",
		"description": "Love the idea of Boa lacing, but don't want to shell out big for the fanciest boots? The DC Scout Boa Snowboard Boots are the answer. DC pairs Boa H4 coiler external lacing with their simple and comfortable Response Liner and cushy UniLite outsole. All the things you really need in a snowboard boot can be found in the Scout Boa: A great fit, easy lacing, and a super comfortable, custom-fitting liner.",
		"image": "1648851104975.jpg",
		"price": "142.97",
		"sized": ["S", "M", "L"],
		"stock": 197
	},
	{
		"title": "Burton Ruler Step On Snowboard Boots 2022",
		"formattedTitle": "burton-ruler-step-on-snowboard-boots-",
		"brand": "burton",
		"description": "The Burton Ruler Step On Snowboard Boots are the kings of the hill when it comes to comfort and ease of use. They feature an Imprint 2 heat moldable liner to get the fit the just right, and a Sequence Boa system to keep you locked and loaded. The medium flex is comfy and freestyle-ready, and best of all, the Rulers are part of Burton's Step On system, which means they're made to be paired with strapless and simple Step On bindings for impossibly easy on-the-fly use. Welcome to the future, my dudes.",
		"image": "1648851108359.jpg",
		"price": "324.95",
		"sized": ["S", "M", "L"],
		"stock": 40
	},
	{
		"title": "Burton Ion Snowboard Boots 2018 - Used",
		"formattedTitle": "burton-ion-snowboard-boots----used",
		"brand": "burton",
		"description": "The Burton Ion Snowboard Boots are snowboarding's super shoes -- that's just science. Their stiff flex keeps you in complete control and ready for precision response while the heat-moldable liner and Tuff Cuff ensure your heel and ankle stay locked in at high speeds. Further enhanced by an industry-leading impact absorbing outsole and an ultra-low profile, it's clear that opting for the fully charged Burton Ion Snowboard Boots will help you embrace the science of shredology.",
		"image": "1648851111416.jpg",
		"price": "308.77",
		"sized": ["S", "M", "L"],
		"stock": 120
	},
	{
		"title": "Nidecker Ranger Snowboard Boots 2022",
		"formattedTitle": "nidecker-ranger-snowboard-boots-",
		"brand": "nidecker",
		"description": "If you're just getting started on your snowboard journey, then having a softer, forgiving, and surfy feeling boot will help you get the ball rolling and spark that initial love for the sport. The Nidecker Ranger Snowboard Boots are lightweight, comfortable, and offer a manageable flex that's great for learning. The single Boa® H4 dial makes adjusting and hoping in/out of the Rangers a breeze, even with a heavy winter mitt on. Comfort, durability, a strong-gripping sole, and a gracious price point make the Ranger the perfect boot to get for your first season on the mountain.",
		"image": "1648851113917.jpg",
		"price": "189.95",
		"sized": ["S", "M", "L"],
		"stock": 183
	},
	{
		"title": "Burton Ion Step On Snowboard Boots 2022",
		"formattedTitle": "burton-ion-step-on-snowboard-boots-",
		"brand": "burton",
		"description": "It makes sense that one of the most responsive boots on the planet would have a Step On option: what's the point of instantaneous inputs and maximum response if it's all going to be lost in the slop of straps? The Burton Ion Step On Snowboard Boots eliminate the hassle of straps and let you have a real sole-ful connection with your board. Just step on and slide off. The Ion comes in a firm flex with extra heel retention from the Snugger Strap, so just because its super easy to use, don't think for a second that it's not a responsive, high performing all-mountain boot. This one's definitely worthy of the classic name Ion!",
		"image": "1648851116292.jpg",
		"price": "559.95",
		"sized": ["S", "M", "L"],
		"stock": 187
	},
	{
		"title": "thirtytwo TM-Two Double Boa Wide Snowboard Boots 2022",
		"formattedTitle": "thirtytwo-tm-two-double-boa-wide-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "And you thought the regular thirtytwo boots were wide and comfy? It wasn't enough for Bode Merrill, and he asked for an even wider build on his pro model. The result is the thirtytwo TM-Two Double Boa Wide Snowboard Boots, which add another 18mm of width in the forefoot for true Sasquatch foot relief. This is a stout boot with a \"7\" flex and dual Boa® Fit System closures. It deserves a close look if your feet are seriously wide.",
		"image": "1648851118490.jpg",
		"price": "384.95",
		"sized": ["S", "M", "L"],
		"stock": 38
	},
	{
		"title": "thirtytwo TM-Two Jones Snowboard Boots 2022",
		"formattedTitle": "thirtytwo-tm-two-jones-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "The thirtytwo TM-Two Jones Snowboard Boots are the classic TM-Two's with special mods for splitboarding fanatics. They feature a hybrid walk mode collar that loosens so you can elongate your stride while skinning, the same mountaineering-level Vibram® sole as the stiffer MTB, and the same superb fit and comfort as the regular TM-Two. This boot is a no-brainer for big mountain riders who also dabble in splitboarding but want one pair of boots for both setups.",
		"image": "1648851121455.jpg",
		"price": "348.46",
		"sized": ["S", "M", "L"],
		"stock": 231
	},
	{
		"title": "thirtytwo TM-Two Snowboard Boots 2022",
		"formattedTitle": "thirtytwo-tm-two-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "The thirtytwo TM-Two Snowboard Boots are the most versatile boots in the thirtytwo lineup, and that's saying something. With excellent customizable heel hold, a heat moldable liner, and traditional lacing to help you find the right fit, these are classics for riders who like to play hard all day long.",
		"image": "1648851123627.jpg",
		"price": 0,
		"sized": ["S", "M", "L"],
		"stock": 0
	},
	{
		"title": "Burton Photon Step On Snowboard Boots 2022",
		"formattedTitle": "burton-photon-step-on-snowboard-boots-",
		"brand": "burton",
		"description": "We're still waiting on those hoverboards they promised us in the 80's, but the future has come to snowboarding and it goes by the name Burton Photon Step On Snowboard Boots. With a firm, responsive flex, the Photons cater to aggressive riders who like to stay in full control of their line, no matter where they point it. An Imprint™ 3 liner featuring Ultralon heat-moldable foam ensures these boots remain comfortable, warm and perfectly contoured to your feet, season after season. Burton Photons are synonymous with precision and control - these Step Ons are no different, they just add convenience to the mix!",
		"image": "1648851125648.jpg",
		"price": "439.95",
		"sized": ["S", "M", "L"],
		"stock": 178
	},
	{
		"title": "K2 Thraxis Snowboard Boots 2022",
		"formattedTitle": "k2-thraxis-snowboard-boots-",
		"brand": "k2",
		"description": "The K2 Thraxis Snowboard Boots are designed for big lines and bigger ambitions. The most aggressive of K2's freeride boots combines a very stiff flex with all the top shelf features you expect, like Intuition® SpaceHeater™ liners and Boa® Conda closures for a quick and supportive fit every time out. The Thraxis gives as good as it gets, and remains the standard for power riding both in and out of bounds.",
		"image": "1648851129095.jpg",
		"price": "407.96",
		"sized": ["S", "M", "L"],
		"stock": 100
	},
	{
		"title": "Therm-ic Set Heat Flat + C-Pack 1300 B Boot Heaters",
		"formattedTitle": "therm-ic-set-heat-flat-+-c-pack--b-boot-heaters",
		"brand": "therm",
		"description": "Love to ride but struggle with cold feet? The Therm-ic Set Heat Flat + C-Pack 1300 B Boot Heaters are here to 86 that problem. These heated insoles can easily be trimmed to fit any ski/snowboard boot and offer immediate warmth for up to 13 hours. Keep your boots in the sow but your toes in the sand!",
		"image": "1648851131797.jpg",
		"price": "349.95",
		"sized": ["S", "M", "L"],
		"stock": 213
	},
	{
		"title": "Therm-ic Set Heat Flat + C-Pack 1300 Boot Heaters",
		"formattedTitle": "therm-ic-set-heat-flat-+-c-pack--boot-heaters",
		"brand": "therm",
		"description": "Love to ride but struggle with cold feet? The Therm-ic Set Heat Flat + C-Pack 1300 Boot Heaters are here to 86 that problem. These heaters can be retro-fitted to any insole and offer immediate warmth for up to 13 hours. Keep your boots in the sow but your toes in the sand!",
		"image": "1648851134239.jpg",
		"price": "299.95",
		"sized": ["S", "M", "L"],
		"stock": 120
	},
	{
		"title": "Burton SLX Snowboard Boots 2022",
		"formattedTitle": "burton-slx-snowboard-boots-",
		"brand": "burton",
		"description": "The Burton SLX Snowboard Boots combine Burton's top tech and best materials in a sleek speed-lace design that's arguably the most versatile model on the shelf. Everything about the SLX reeks of performance and comfort, from the top-end LIFE+ Liner and Level 3 EVA footbed to the Firm Flex Tongue and Welded Backstay. When snowboarding means the world to you, the SLX is the boot you seek.",
		"image": "1648851136349.jpg",
		"price": "639.95",
		"sized": ["S", "M", "L"],
		"stock": 51
	},
	{
		"title": "thirtytwo Light JP Snowboard Boots 2022",
		"formattedTitle": "thirtytwo-light-jp-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Light JP Snowboard Boots are designed and built for team rider JP Walker. JP is a man that knows that lightness on the ground means more time spent flying above it. This smooth-articulating \"4\" flex boot was conceived with jumps and style in mind, with a traditional lacing system and no heavy bells and whistles to detract from its performance. Get the Light and light it up this season.",
		"image": "1648851139220.jpg",
		"price": "195.46",
		"sized": ["S", "M", "L"],
		"stock": 66
	},
	{
		"title": "Vans Standard XF Snow MTE Pow Surfing Boots 2022",
		"formattedTitle": "vans-standard-xf-snow-mte-pow-surfing-boots-",
		"brand": "vans",
		"description": "When there's a meter of fresh in his driveway, Wolle Nyvelt pulls on the Vans Standard XF Snow MTE Snowboard Boots. When he can finally get his car out, he's ready to go powsurfing - the MTE grippy sole with its inverted waffle pattern is ready to do its thing, the velcro powerstrap gets the tension just right, and the snowboard-inspired V2 Popcush footbed is oh-so comfy when riding a bindingless setup in pow. If powsurfing is your thing, you won't want anything else.",
		"image": "1648851142470.jpg",
		"price": "220.00",
		"sized": ["S", "M", "L"],
		"stock": 108
	},
	{
		"title": "thirtytwo STW Boa Snowboard Boots 2021",
		"formattedTitle": "thirtytwo-stw-boa-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "Ready to rip right out of the box, the thirtytwo STW Boa Snowboard Boots are built for ease and comfort. A soft flex, heat-moldable liners, and evolution foam outsoles define these boots while the Boa Fit System ties it all together. Whether you're a weekends-only guy or a hundred-day ripper, the thirtytwo STW Boa Snowboard Boots will keep your feet satisfied and your ride supported. Snowboarding is a lot more fun when your own two feet are happy.",
		"image": "1648851146130.jpg",
		"price": "179.96",
		"sized": ["S", "M", "L"],
		"stock": 153
	},
	{
		"title": "thirtytwo Lashed Double Boa Snowboard Boots 2021",
		"formattedTitle": "thirtytwo-lashed-double-boa-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Lashed Double Boa Snowboard Boots are best-sellers for a reason. Proven durability, renowned comfort, and professional performance. The Double Boa System, heel hold kit, and heat-moldable liners will lock you in to the feeling of freedom. Just ask pro rider Chris Bradshaw. Cinch into the thirtytwo Lashed Double Boa Snowboard Boots for high support, a smooth ride, and the versatility to dig deeper into your possibilities on a snowboard.",
		"image": "1648851148851.jpg",
		"price": "274.99",
		"sized": ["S", "M", "L"],
		"stock": 213
	},
	{
		"title": "thirtytwo TM-Three XD Grenier Snowboard Boots 2022",
		"formattedTitle": "thirtytwo-tm-three-xd-grenier-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "Built to take a beating and keep your feet warm and dry in the process, the thirtytwo TM-Three Grenier Snowboard Boots are the pinnacle of thirtytwo's progression in the combination freeride/freestyle arena. They feature EXO Armor protection in key areas where the binding meets the boot, the top-tier Elite Liner with super durable injection molded foam components, and a taller Elite harness for extra support. When you push your gear hard and expect it to show some fighting spirit, this is the boot for you.",
		"image": "1648851152376.jpg",
		"price": "469.95",
		"sized": ["S", "M", "L"],
		"stock": 238
	},
	{
		"title": "Vans Hi Standard OG Snowboard Boots 2022 - Used",
		"formattedTitle": "vans-hi-standard-og-snowboard-boots----used",
		"brand": "vans",
		"description": "The standard-bearer for classic style and modern performance, the Vans Hi-Standard OG Snowboard Boots continues to be one of the best-selling boots on the market. Keeping the comfort and familiarity of your favorite Vans, the Hi-Standard OG offers a traditional lace-up closure and key features like an Instep Lace Lockout and Internal Web Harness. With a V1 Waffle Lug Outsoles and an iconic Vans side stripe, the timelessness of the OG speaks for itself.",
		"image": "1648851156166.jpg",
		"price": "179.99",
		"sized": ["S", "M", "L"],
		"stock": 89
	},
	{
		"title": "K2 Maysis Clicker X HB Snowboard Boots 2021",
		"formattedTitle": "k2-maysis-clicker-x-hb-snowboard-boots-",
		"brand": "k2",
		"description": "Take K2's most popular boot, toss it in a cauldron with the latest evolution of their acclaimed step-in technology, and what do you get? The K2 Maysis Clicker X HB Snowboard Boots, a smooth flexing foot stomper that you can click and rip, easy as pie. It's got all the features you need to shred hard - Boa® Lacing, heat moldable Intuition™ Control Foam 3D Liners, premium Endo™ 2.0 construction - along with the security and unbeatable convenience of the Clicker X HB binding. Enjoy.",
		"image": "1648851159836.jpg",
		"price": "283.46",
		"sized": ["S", "M", "L"],
		"stock": 250
	},
	{
		"title": "thirtytwo Lashed Bradshaw Snowboard Boots 2022",
		"formattedTitle": "thirtytwo-lashed-bradshaw-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Lashed Snowboard Boots slay park and pow alike - and have for years. This proven classic is still the one to beat when you're shopping for an all-rounder to ride any type of conditions, and the traditional lace version is still the choice of many experienced riders. The thirtytwo Lashed Bradshaw Snowboard Boots feature a special black-grey-orange colorway that's super sick, and primed for Halloween.",
		"image": "1648851162750.jpg",
		"price": "269.95",
		"sized": ["S", "M", "L"],
		"stock": 137
	},
	{
		"title": "DC Control Boa Step On Snowboard Boots 2022",
		"formattedTitle": "dc-control-boa-step-on-snowboard-boots-",
		"brand": "dc",
		"description": "What do you get when you pair DC's legendary out-of-the-box comfort with the unrivaled convenience of Step On® technology? The DC Control Boa Step On Snowboard Boots, and a whole new standard for everyone else to catch up to. Updated with DC's latest Response II Liner and an improved Dual Zone BOA® Fit System, these puppies have the performance and fit you need to squeeze the juice out of every turn.",
		"image": "1648851165537.jpg",
		"price": "329.99",
		"sized": ["S", "M", "L"],
		"stock": 230
	},
	{
		"title": "Ride Insano Snowboard Boots 2022",
		"formattedTitle": "ride-insano-snowboard-boots-",
		"brand": "ride",
		"description": "It's hardly crazy to want a burly boot you can totally trust when your riding style is full-charge, full-time. The Ride Insano Snowboard Boots are as burly as they get. This stout boot features a fiber-reinforced tongue for a flex that cranks all the way up, a new Boa® H4 Focus closure system, and a grippier Michelin® Traverse Outsole for hitting your favorite bootpack.",
		"image": "1648851167600.jpg",
		"price": "386.96",
		"sized": ["S", "M", "L"],
		"stock": 30
	},
	{
		"title": "thirtytwo Jones MTB Snowboard Boots 2022",
		"formattedTitle": "thirtytwo-jones-mtb-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Jones MTB Snowboard Boots are as unique as Mr. Jones himself. These are splitboarding-specific boots designed to access the most inhospitable terrain on the planet, climb and ride the burliest mountain you can find there, and return safely. The one-of-a-kind Walk Mode Collar is held in place by a Boa® TX3 lace system for the ride down, but hinges freely for skinning and climbing. A full-length gaiter protects the entire front of the boot, because wet feet = misery. A next-level Vibram® sole gives you the confidence you need when you absolutely cannot slip and fall. And so on. The MTB is just what Jeremy ordered, and just what you need when the going gets insanely tough.",
		"image": "1648851170018.jpg",
		"price": "560.96",
		"sized": ["S", "M", "L"],
		"stock": 32
	},
	{
		"title": "Burton Photon Step On Wide Snowboard Boots 2022",
		"formattedTitle": "burton-photon-step-on-wide-snowboard-boots-",
		"brand": "burton",
		"description": "We're still waiting on those hoverboards they promised us in the 80's, but the future has come to snowboarding and it goes by the name Burton Photon Step On Snowboard Boots. With a firm, responsive flex, the Photons cater to aggressive riders who like to stay in full control of their line, no matter where they point it. An Imprint™ 3 liner featuring Ultralon heat-moldable foam ensures these boots remain comfortable, warm and perfectly contoured to your feet, season after season. Burton Photons are synonymous with precision and control - these Step Ons are no different, they just add convenience to the mix!",
		"image": "1648851173486.jpg",
		"price": "439.95",
		"sized": ["S", "M", "L"],
		"stock": 167
	},
	{
		"title": "DC Phase Snowboard Boots 2022",
		"formattedTitle": "dc-phase-snowboard-boots-",
		"brand": "dc",
		"description": "Whether you're new to snowboarding or an accomplished rider searching for the best bang for your buck, the DC Phase Snowboard Boots are a great choice. Not too soft so they last well beyond beginner-hood, the Phase boots feature traditional lacing for maximum fit customization, UniLite rubber in the outsole for impact absorption and grip, along with a comfortable multi-layer memory foam liner that can be heat-molded for a dialed-in fit.",
		"image": "1648851176397.jpg",
		"price": "109.99",
		"sized": ["S", "M", "L"],
		"stock": 107
	},
	{
		"title": "Burton Ruler Wide Snowboard Boots 2021",
		"formattedTitle": "burton-ruler-wide-snowboard-boots-",
		"brand": "burton",
		"description": "Put an end to pain and conquer the mountain with the extra forefoot room of the Burton Ruler Wide Snowboard Boots. A medium flex that finds the balance of progressive riding and forgiving feel for all day comfort and all-mountain versatility. Customizable fit with heat moldable liners and unmatched out-of-the-box comfort, will make sure that riding all day is a breeze. Say goodbye to the days of spending time manually lacing boots and painful pressure points with the Burton Ruler Wide Snowboard Boots.",
		"image": "1648851179026.jpg",
		"price": "274.95",
		"sized": ["S", "M", "L"],
		"stock": 191
	},
	{
		"title": "DC Judge Boa Step On Snowboard Boots 2022",
		"formattedTitle": "dc-judge-boa-step-on-snowboard-boots-",
		"brand": "dc",
		"description": "Judge, jury, executioner. This is the boot that sets the tempo. The go-to boot for DC's stacked roster of team riders, the Judge Boa Step On Snowboard Boots provides that impeccable balance of responsiveness and smooth flex that progressive riders are drawn to - enough power to react quickly on steep faces, but with the give and stability for pop and controlled style. Take control of your setup and put the hammer down - the DC Judge Boa Step On Snowboard Boots are the boots you need to take your riding to the stratosphere.",
		"image": "1648851181768.jpg",
		"price": "419.95",
		"sized": ["S", "M", "L"],
		"stock": 176
	}
]
