[
	{
		"title": "Ride Psychocandy x Akomplice Snowboard 2022",
		"formattedTitle": "ride-psychocandy-x-akomplice-snowboard-",
		"brand": "ride",
		"description": "The Ride Psychocandy x Akomplice Snowboard is a rad collab that we're stoked to get behind. Proceeds from this board will go to helping indigenous people in Columbia to protect their land from deforestation and development, bringing attention to global health awareness. It helps that the board absolutely rips, too. Available in unisex sizing, the Psychocandy is a directional all-mountain tool that absolutely crushes in deep snow and challenging terrain while remaining versatile enough to slash around as you wait for the next storm to roll in.",
		"image": "1648852428670.jpg",
		"price": "519.99",
		"sized": ["150", "146", "168"],
		"stock": 169
	},
	{
		"title": "Burton Feelgood Flying V Snowboard - Women's 2023",
		"formattedTitle": "burton-feelgood-flying-v-snowboard---women's-",
		"brand": "burton",
		"description": "The name is a good start, and it only gets better from there. The Burton Feelgood Flying V Snowboard is a modern day icon for all mountain riders. Built with Burton's softer, more playful Flying V rocker profile and an energetic Super Fly II™ 700G Core, this board combines all terrain muscle with an effortless, intuitive feel that almost disappears under your feet. Smooth, capable, and fun to ride in all conditions, the Burton Feelgood Flying V Snowboard is worthy of a spot in any quiver.",
		"image": "1648852430592.jpg",
		"price": "609.95",
		"sized": ["148", "158", "150", "152"],
		"stock": 2
	},
	{
		"title": "Burton Yeasayer Snowboard - Women's 2023",
		"formattedTitle": "burton-yeasayer-snowboard---women's-",
		"brand": "burton",
		"description": "Say yes to fresh snow. Say yes to frosty mornings, early wake up calls, and full throated carpool karaoke singalongs on the way to the way to go shred your heart out. The Burton Yeasayer Snowboard encompasses that positive, down-for-anything attitude in a mellow all-mountain board that's up for anything. The Yeasayer isn't some crazy, demanding deck that requires full throttle charging every time you step on it - this version comes with Burton's easygoing Flat Top™ rocker profile for catch-free fun, and a soft, forgiving flex that allows your riding to take center stage. Anywhere you ask it to go, and anything you ask it to do, the answer is always a cheery \"Heck yeah!\"",
		"image": "1648852433486.jpg",
		"price": "499.95",
		"sized": ["148", "138", "162", "142"],
		"stock": 110
	},
	{
		"title": "Burton Feelgood Snowboard - Women's 2023",
		"formattedTitle": "burton-feelgood-snowboard---women's-",
		"brand": "burton",
		"description": "The name is a good start, and it only gets better from there. The Burton Feelgood Snowboard is a modern day icon for all mountain riders. With spring loaded traditional camber and Burton's energetic Super Fly II™ 700G Core, this board combines all terrain muscle with an effortless, intuitive feel that almost disappears under your feet. Smooth, capable, and fun to ride in all conditions, the Burton Feelgood Snowboard is worthy of a spot in any quiver.",
		"image": "1648852435578.jpg",
		"price": "609.95",
		"sized": ["152", "162", "148", "150", "158", "146"],
		"stock": 36
	},
	{
		"title": "Burton Family Tree Hometown Hero Snowboard 2023",
		"formattedTitle": "burton-family-tree-hometown-hero-snowboard-",
		"brand": "burton",
		"description": "If you're the guy whispering in hushed tones about top secret lines, talking in hand signals known only to you and your tightest crew, we have the board for you. The Burton Family Tree Hometown Hero Snowboard is the choice of superlocals, hidden stashers, and all-season slashers. Designed to blast through bunk and lay waste to chunk on its way to the holy land of deep funk, the Hometown Hero is an all-around ripper's ride. A moderately stiff flex and directional camber profile combine with a little taper and a lotta setback for a ride that lays the hammer through pow and crud alike. You're never going to achieve hero status by dinking around: get charging!",
		"image": "1648852437580.jpg",
		"price": "659.95",
		"sized": ["158", "150", "146"],
		"stock": 33
	},
	{
		"title": "Roxy Raina LTD Snowboard - Women's 2022",
		"formattedTitle": "roxy-raina-ltd-snowboard---women's-",
		"brand": "roxy",
		"description": "For riders steadily building on the fundamentals and conquering the resort, look to the Roxy Raina LTD Snowboard to keep you cruising. This medium to soft flexing board features top shelf features like C2 Contour Technology and Magne-Traction® edges, but comes in a beginner friendly package that rides easily in any snow conditions. Now featured in true evo style thanks to this exclusive topsheet!",
		"image": "1648852440621.jpg",
		"price": "269.99",
		"sized": ["158", "148", "142"],
		"stock": 163
	},
	{
		"title": "Arbor Poparazzi Rocker LTD Snowboard - Women's 2022",
		"formattedTitle": "arbor-poparazzi-rocker-ltd-snowboard---women's-",
		"brand": "arbor",
		"description": "The Arbor Poparazzi Rocker LTD Snowboard is all about fun. It's the most well-rounded women's-specific shape in the Arbor lineup, with a design that aims at riding it all. It has a smooth, soft flex and twin shape for freestyle performance, a solid construction for durability, and reliable edge hold for consistent riding on the groomers and steeps. Arbor's System Rocker profile makes this board super easy to turn and flowy to ride, especially in deeper snow, so this is a great choice for intermediate riders looking for a progression friendly board they won't grow out of. This LTD version features a beautiful ash power ply topsheet and is only available from evo.",
		"image": "1648852444208.jpg",
		"price": "382.49",
		"sized": ["146", "168", "162", "138", "142", "152"],
		"stock": 219
	},
	{
		"title": "Burton Yeasayer Flying V Snowboard - Women's 2023",
		"formattedTitle": "burton-yeasayer-flying-v-snowboard---women's-",
		"brand": "burton",
		"description": "Say yes to fresh snow. Say yes to frosty mornings, early wake up calls, and full throated carpool karaoke singalongs on the way to the way to go shred your heart out. The Burton Yeasayer Flying V Snowboard encompasses that positive, down-for-anything attitude in a mellow all-mountain board that's up for anything. The Yeasayer isn't some crazy, demanding deck that requires full throttle charging every time you step on it - this version comes with Burton's playful Flying V rocker profile for catch-free fun, and an easygoing flex that allows your riding to take center stage. Anywhere you ask it to go, and anything you ask it to do, the answer is always a cheery \"Heck yeah!\"",
		"image": "1648852446985.jpg",
		"price": "499.95",
		"sized": ["148", "158", "138", "150", "162"],
		"stock": 15
	},
	{
		"title": "Burton Family Tree Hometown Hero Splitboard 2022",
		"formattedTitle": "burton-family-tree-hometown-hero-splitboard-",
		"brand": "burton",
		"description": "The backcountry holds a dirty little secret that Big Snowboard Inc™ doesn't want you to know. The truth is, it's not all rainbows and white rooms. In fact, it's kinda hard. For every pristine 2k of untouched pow, there's 10k of refrozen slop. For every panoramic, bluebird mountaintop, there are 10 blustery ridgelines that send you scrambling for the puffy buried deep in your pack. That's why it pays to have tool like the Burton Family Tree Hometown Hero Splitboard in your arsenal. It gives you the same the full-on charging, slashing, floating fun of the solid version, but in an upwardly mobile package that's ready for anything the backcountry throws at you. It won't make everything easy, but it'll turn those challenging days into something that looks a whole lot more like fun.",
		"image": "1648852449334.jpg",
		"price": "849.95",
		"sized": ["162", "142", "146", "148", "158", "138"],
		"stock": 147
	},
	{
		"title": "Season Pass Splitboard 2022",
		"formattedTitle": "season-pass-splitboard-",
		"brand": "season",
		"description": "If you thought Austin Smith was going to stop at the ropeline and let someone else plunder the deep stuff, you thought wrong. The Season Pass Splitboard is a one-way ticket to backcountry nirvana designed to make the most out of life on the skin track. Based on the all terrain Nexus snowboard, the Season Pass brings powder to the people with a versatile directional twin shape and sizing appropriate for both men and women, young and old. Throw in some pre-cut climbing skins and a durable layup engineered for longevity, and you've got the perfect platform to earn your turns season after season.",
		"image": "1648852451175.jpg",
		"price": "760.00",
		"sized": ["168", "162", "152", "138", "142", "146"],
		"stock": 152
	},
	{
		"title": "Salomon Bellevue Splitboard - Women's 2022",
		"formattedTitle": "salomon-bellevue-splitboard---women's-",
		"brand": "salomon",
		"description": "The Salomon Bellevue Splitboard is engineered for the adventurous rider seeking a light but capable setup for journeys into the wilderness white room. This split combines surfy Backseat Camber with a setback stance for a little extra sauce when the going gets deep, while Salomon's lightweight Ghost Green Core keeps things nimble on the skin track and silky smooth on the way back down. Throw in a set of industry-leading pre-cut skins from Pomoca, and you've got a one way ticket to backcountry nirvana.",
		"image": "1648852454295.jpg",
		"price": "639.96",
		"sized": ["162", "142", "164"],
		"stock": 62
	},
	{
		"title": "K2 First Lite Snowboard - Women's 2022",
		"formattedTitle": "k2-first-lite-snowboard---women's-",
		"brand": "k2",
		"description": "Get on the K2 First Lite Snowboard for a ride that will actively help your progression from first-time snowboarder to experienced deckhand. With its forgiving Twin Rocker profile and Catch-Free™ Tune, the First Lite makes turning easy and lessens the possibility of \"hooking\" - something that paralyzes many beginner riders. The First Lite is built with a full Aspen core, Biax Glass laminates, and a durable Extruded 2000 Base designed to last for many seasons of use.",
		"image": "1648852456932.jpg",
		"price": "322.96",
		"sized": ["142", "150", "164", "158"],
		"stock": 121
	},
	{
		"title": "K2 Dreamsicle Snowboard - Women's 2022",
		"formattedTitle": "k2-dreamsicle-snowboard---women's-",
		"brand": "k2",
		"description": "Like the inspired combination of orange sherbet and vanilla ice cream, the K2 Dreamsicle Snowboard is a sweet ride with just enough edge to make things memorable. Perfect as a first board after a season of rentals, or for the relaxed rider looking to explore the mountain with minimum fuss, the Dreamsicle is built with a women's specific Rhythm™ Core and a supple flex for easy cruising.",
		"image": "1648852459719.jpg",
		"price": "356.96",
		"sized": ["150", "138", "158"],
		"stock": 183
	},
	{
		"title": "CAPiTA Spring Break Powder Twin Snowboard 2022",
		"formattedTitle": "capita-spring-break-powder-twin-snowboard-",
		"brand": "capita",
		"description": "Yeah, that's right: CAPiTA Spring Break Powder Twin Snowboard. Powder. Twin. It makes sense when you remember the surfy, playful, don't-take-yourself-so-seriously ethos of the Spring Break line. The Powder Twin keeps the extra wide waist, the tight, carvey turn radius, and gentle Surf Rocker profile of its directional cousins, but packages them together in a Twin shape that's perfect for playful freestyle powder riding. Grab your homies and get to work that backcountry booter you've been talking about for years, this is the board you've been waiting for.",
		"image": "1648852462307.jpg",
		"price": "450.46",
		"sized": ["162"],
		"stock": 217
	},
	{
		"title": "Roxy Dawn Snowboard - Women's 2022",
		"formattedTitle": "roxy-dawn-snowboard---women's-",
		"brand": "roxy",
		"description": "The Roxy Dawn Snowboard is a super friendly board paired with the right technology for comfortable progression. Its twin geometry, Easy-Rise rocker profile, and softer flex make the Dawn ideal for the rider who may be a bit intimated by what the resort has to offer, but is ready to conquer their fears and start taking names.",
		"image": "1648852465115.jpg",
		"price": "249.99",
		"sized": ["146", "158"],
		"stock": 172
	},
	{
		"title": "Roxy Breeze Snowboard - Women's 2022",
		"formattedTitle": "roxy-breeze-snowboard---women's-",
		"brand": "roxy",
		"description": "Shred the entire mountain with ease on the Roxy Breeze Snowboard. The Breeze is designed with a setback stance and a snappy medium flex, along with a C2 rocker profile to keep you surfing through powder and leaving clean trenches in the groomed. It's time to start making a name for yourself and leading the pack with the Roxy Breeze Snowboard.",
		"image": "1648852468315.jpg",
		"price": "299.99",
		"sized": ["148", "138", "142", "162", "152"],
		"stock": 198
	},
	{
		"title": "Lib Tech T.Rice Orca Snowboard 2022",
		"formattedTitle": "lib-tech-t.rice-orca-snowboard-",
		"brand": "lib",
		"description": "What's your idea of fun? Painting watercolors? Watching sportsball? Sitting on the couch giving the old thumbs a workout? They're all valid, of course, but if your idea of fun involves tossing yourself down mountains, snorkeling through bottomless snow, and breaching like a stoked out sea creature, boy do we have the tool for you. The Lib Tech T.Rice Orca Snowboard is king among all-terrain vehicles, and Travis Rice's go-to tool for slicing up the resort and sidecountry alike. It rails groomers, smashes pow, floats like a dream, and handles spicy tech zones with ease. It is quite simply one of the most capable all mountain boards in the biz. Sound like fun?",
		"image": "1648852470829.jpg",
		"price": "454.99",
		"sized": ["138", "142", "168", "162", "146"],
		"stock": 227
	},
	{
		"title": "Ride Twinpig Snowboard 2022",
		"formattedTitle": "ride-twinpig-snowboard-",
		"brand": "ride",
		"description": "It's hard to argue with a pig that goes forward and backward with equal alacrity. The Ride Twinpig Snowboard is the twin version of Ride's proven Warpig, and we're not about to pick a bone with it. This board found tremendous acceptance among big mountain freestyle adherents when it debuted, and this year's upgraded Slim Walls™ sidewall construction is only going to boost performance further with improved energy transfer, lighter weight, and better damping underfoot.",
		"image": "1648852473423.jpg",
		"price": "449.96",
		"sized": ["152", "146", "162"],
		"stock": 191
	},
	{
		"title": "Ride Warpig Snowboard 2022",
		"formattedTitle": "ride-warpig-snowboard-",
		"brand": "ride",
		"description": "One of the hottest freeride boards of the last decade continues to wallow in its success, but it hasn't grown complacent. With a new Slim Walls™ construction, the Ride Warpig Snowboard gets stronger AND lighter, setting the stage for yet another epic winter. This board was designed to slaughter big mountain lines like a boss, but has found a surprising amount of success in freestyle venues as well. For the all-mountain warrior who takes the challenge of speed and air personally, there isn't a better choice than the Warpig.",
		"image": "1648852476782.jpg",
		"price": "423.96",
		"sized": ["150", "138"],
		"stock": 86
	},
	{
		"title": "Ride Superpig Snowboard 2022",
		"formattedTitle": "ride-superpig-snowboard-",
		"brand": "ride",
		"description": "Add some stiffness, camber, and space age tech to the proven Warpig design, and BOOM! you've got the Ride Superpig Snowboard. Upgraded with the lighter and edgier Carbon Slim Walls® construction for even quicker response and more powerful carves, this one is ready for warp speed riding all over the mountain. When pigs fly, we'll all be riding this, but for now you've got the edge because you saw it here first.",
		"image": "1648852479387.jpg",
		"price": "471.96",
		"sized": ["138", "168"],
		"stock": 234
	},
	{
		"title": "Jones Dream Catcher Splitboard - Women's 2022",
		"formattedTitle": "jones-dream-catcher-splitboard---women's-",
		"brand": "jones",
		"description": "In a world of increasing specialization, it's nice to get a simple one-step solution every now and then. If you're looking for a good time in the backcountry, get on the Jones Dream Catcher Splitboard. It's as easy as that. This directional freeride board is an all-mountain stoke factory, transforming any snow type into pure unadulterated fun. It floats powder, dances through trees, handles business in the steeps, and does it all with a natural intuitive feel. Whether it's your first splitboard or your fiftieth, point-and-shoot ridability in varied conditions is an invaluable asset for heading out into untamed territory where you never know what the day might hold.",
		"image": "1648852482911.jpg",
		"price": "637.46",
		"sized": ["142", "158", "168"],
		"stock": 30
	},
	{
		"title": "Salomon Lotus Snowboard - Women's 2022",
		"formattedTitle": "salomon-lotus-snowboard---women's-",
		"brand": "salomon",
		"description": "Like a friend who waits for you to get up and clean off your goggles on a powder day, the Salomon Lotus Snowboard has that rare combination of trusty performance and easygoing likeability you need to take your riding to the next level. A directional twin with a 10mm setback for stability at speed and float in the deep stuff, the Lotus features a classic single radius sidecut and a forgiving Flat Out Camber profile.",
		"image": "1648852486631.jpg",
		"price": "269.96",
		"sized": ["162"],
		"stock": 242
	},
	{
		"title": "Salomon Wonder Snowboard - Women's 2022",
		"formattedTitle": "salomon-wonder-snowboard---women's-",
		"brand": "salomon",
		"description": "No matter how you slice it, the Salomon Wonder Snowboard is, well, the best thing for all-mountain snowboarding since Wonder Bread. rock Out Camber puts the camber under your feet to maximize edge contact, and Salomon's Quadratic Sidecut combines ease of turning with power when you need it. Powder, park or groomers - get after it with the Salomon Wonder and leave your doubts behind.",
		"image": "1648852489805.jpg",
		"price": "319.96",
		"sized": ["152"],
		"stock": 48
	},
	{
		"title": "Ride Heartbreaker Snowboard - Women's 2022",
		"formattedTitle": "ride-heartbreaker-snowboard---women's-",
		"brand": "ride",
		"description": "The Ride Heartbreaker Snowboard is never going to break YOUR heart, especially if your passion is for lighting up the slopes with your finest freestyle moves. This versatile board is at home on the groomed but loves the park and pipe, where the twin rocker design and light core really shine. Move beyond that stale relationship and go with snowboarding - it won't let you down.",
		"image": "1648852492855.jpg",
		"price": "322.96",
		"sized": ["168", "146", "142", "158", "162"],
		"stock": 4
	},
	{
		"title": "Jones Dream Catcher Snowboard - Women's 2022",
		"formattedTitle": "jones-dream-catcher-snowboard---women's-",
		"brand": "jones",
		"description": "In a world of increasing specialization, it's nice to get a simple one-step solution every now and then. If you're looking for a good time on the mountain, get on the Jones Dream Catcher Snowboard and point it downhill. It's as easy as that. This directional freeride board is an all-mountain stoke factory, transforming any snow type into pure unadulterated fun. It crushes park, floats powder, handles business in the steeps, and does it all with a natural intuitive feel.",
		"image": "1648852495312.jpg",
		"price": "407.96",
		"sized": ["158", "146", "152", "148"],
		"stock": 121
	},
	{
		"title": "Sims The Day - Ocean Snowboard 2021",
		"formattedTitle": "sims-the-day---ocean-snowboard-",
		"brand": "sims",
		"description": "Take it to the park, take it to the streets, take it to every natural kicker, backcountry booter, and side hit slalom on the mountain. The Sims The Day - Ocean Snowboard is down to clown. Built with their double hybrid M POP Camber profile, this freestyle ripper layers on limitless pop and butterability, with an energetic full wood core and I-Carbon Lite stringer for added strength. Rally the squad and fire up the GoPro, today is The Day and anything is possible.",
		"image": "1648852497987.jpg",
		"price": "239.99",
		"sized": ["152", "142", "146", "150", "162", "158"],
		"stock": 29
	},
	{
		"title": "Arbor Veda Splitboard - Women's 2022",
		"formattedTitle": "arbor-veda-splitboard---women's-",
		"brand": "arbor",
		"description": "The Arbor Veda Splitboard is the board that Marie-France Roy uses to explore the wild terrain of her British Columbia home. Its directional shape loves to be pushed down the fall line, and stays afloat even in the deepest powder, but it also has the precision and dependability to maneuver easily through tight trees and down exposed faces. The Arbor Veda Splitboard is an all-around tool for directional riders to take on everything from demanding backcountry terrain to low angle pow laps.",
		"image": "1648852501527.jpg",
		"price": "645.99",
		"sized": ["152", "168"],
		"stock": 99
	},
	{
		"title": "Rome Royal Snowboard - Women's 2021",
		"formattedTitle": "rome-royal-snowboard---women's-",
		"brand": "rome",
		"description": "Hopping on the Rome Royal Snowboard feels like the mountain rolled out the red carpet for you. It's like it knew you were coming to have a great time and made everything velvety smooth in anticipation. That's because of features like a stable Stomp Core, progression-friendly Contact Rocker with a catch-free feel, and a durable Impact Base that is made to handle full days of exploring your skills and discovering new routes down the resort terrain. On the Rome Royal Snowboard, you don't need to wear a crown to feel in command.",
		"image": "1648852505259.jpg",
		"price": "299.99",
		"sized": ["138", "152", "150", "164", "142", "168"],
		"stock": 108
	},
	{
		"title": "Salomon Pillow Talk Splitboard - Women's 2022",
		"formattedTitle": "salomon-pillow-talk-splitboard---women's-",
		"brand": "salomon",
		"description": "The Salomon Pillow Talk Splitboard is everything you need out of your splitty. It's a super lightweight directional shape with a centered stance and rockered tail, giving it extra versatility and a hint of freestyle feel. The wider design gives you plenty of float for whispering sweet nothings to pillow lines and pow stashes, while the pulled in tail and sturdy flex pattern give you power and reliability for when things get heated. As an added bonus, every board comes with a set of custom cut Pomoca skins, so that's just one less thing to worry about while you're getting your backcountry setup dialed.",
		"image": "1648852508392.jpg",
		"price": "639.96",
		"sized": ["138", "164", "146", "162", "148"],
		"stock": 37
	},
	{
		"title": "Jones Solution Splitboard - Women's 2022",
		"formattedTitle": "jones-solution-splitboard---women's-",
		"brand": "jones",
		"description": "The Jones Solution Splitboard won't solve all of life's problems, but it has the answer to every backcountry head-scratcher. Icy skin-tracks? The grippy Traction Tech 2.0 inner edges eat those for breakfast. Avy debris and variable chunder all the way back to the car? No problem, the powerful Ultra Split Core with Flax / Basalt reinforcement provides chatter-free performance and high-speed response when the snow is less than perfect. And when it is perfect? The Solution's tapered shape and directional rocker combine for effortless float and fluidity that'll have you skinning up for another lap, no matter how tired the legs are.",
		"image": "1648852511922.jpg",
		"price": "764.96",
		"sized": ["148", "150", "168", "146", "164", "162"],
		"stock": 113
	},
	{
		"title": "GNU GORP Splitboard 2022",
		"formattedTitle": "gnu-gorp-splitboard-",
		"brand": "gnu",
		"description": "Splitboarding is as lo-fi as it gets, putting one dang foot in front of the other to walk up a mountain, but it's still relatively new--that's really a trip if you think about it. It's almost like the future is the past that never happened, and we're wrapping around through a powder wormhole. The GNU GORP Splitboard is from that future. It has a directional shape with a deep appetite, ultralight construction, and a C3 camber profile that sticks like a gecko on the skintrack. Designed to rip the snow you're willing to walk all day for, this one's like finding out good ol' raisins and peanuts are superior to some aerosolized energy mousse gels. Beep borp, it's GORP.",
		"image": "1648852514836.jpg",
		"price": "629.99",
		"sized": ["146", "150"],
		"stock": 99
	},
	{
		"title": "Ride Splitpig Splitboard 2022",
		"formattedTitle": "ride-splitpig-splitboard-",
		"brand": "ride",
		"description": "This little piggy went to market, this little piggy went to school, this little piggy went into the high alpine and did something wayyy cool. With its signature short and wide profile, the acclaimed Ride Warpig always looked like it would make a killer split, so cutting that squeeler in half was a no brainer. The Ride Splitpig Splitboard borrows the same shape and flex, with a directional hybrid camber profile for grip on the climb and Performance™ Core construction for strength on the way down. It even includes pre-cut skins and pucks built to accommodate a variety of binding systems. The skin track won't know what hit it - this is the split you've been waiting for.",
		"image": "1648852518008.jpg",
		"price": "839.96",
		"sized": ["142", "164"],
		"stock": 127
	},
	{
		"title": "Rome Royal Snowboard - Women's 2022",
		"formattedTitle": "rome-royal-snowboard---women's-",
		"brand": "rome",
		"description": "Show Kate Middleton who's boss with the Rome Royal Snowboard. With a soft flex and true-true twin design, the Royal is great for beginners who are looking to build confidence and skills on the mountain. Contact rocker means there's a flat spot underfoot, which can help you initiate turns on the trail, and a snappy and predictable StompCore keeps the board nice and responsive as you learn. You'll be in LA running your Netflix empire in no time with the Rome Royal Snowboard.",
		"image": "1648852521145.jpg",
		"price": "311.96",
		"sized": ["152", "164", "146"],
		"stock": 148
	},
	{
		"title": "Sims Nub Snowboard 2022",
		"formattedTitle": "sims-nub-snowboard-",
		"brand": "sims",
		"description": "The top pick of some of Sims' most progressive riders, the Sims Nub Snowboard gets the nod for freeride trickery taken to its logical next step. With plenty of pop from its Traditional Camber shape and I-Carbon laminate, the Nub also uses Sims' fastest base and best Tri-Tex fiberglass layup. A strong contender for \"most freestyle fun you can have while not in the park\" honors.",
		"image": "1648852523611.jpg",
		"price": "499.99",
		"sized": ["142"],
		"stock": 68
	},
	{
		"title": "Lib Tech Dynamiss C3 Snowboard - Women's 2022",
		"formattedTitle": "lib-tech-dynamiss-c3-snowboard---women's-",
		"brand": "lib",
		"description": "You could have a whole quiver, or you could set and forget with the Lib Tech Dynamiss C3 Snowboard. This directional dreamer is just as comfortable ripping groomers as it is surfing pow or snaking through trees, and it laughs in the face of chop and chunder. The C3 camber offers tons of stability and precision for your rowdier endeavors, while the Original Power core has enough spring and pop to sling you around the mountain in style. For a dynamic all mountain ride, look no further than the Dynamiss C3 Snowboard.",
		"image": "1648852526865.jpg",
		"price": "374.99",
		"sized": ["146", "138"],
		"stock": 111
	},
	{
		"title": "Arbor Swoon Rocker Splitboard - Women's 2022",
		"formattedTitle": "arbor-swoon-rocker-splitboard---women's-",
		"brand": "arbor",
		"description": "The Arbor Swoon is exactly the type of board you want your split to be based on - fun, reliable, and well-rounded. The Arbor Swoon Rocker Splitboard is the more easy-going of the Swoon splitboard offerings, letting you smear, butter and turn on a dime across a wide range of backcountry conditions. It's lightweight on the skin track, maneuverable in spicy terrain, and most importantly, super playful in the deep stuff!",
		"image": "1648852529863.jpg",
		"price": "594.99",
		"sized": ["158", "168", "146"],
		"stock": 234
	},
	{
		"title": "Salomon Oh Yeah Snowboard - Women's 2022",
		"formattedTitle": "salomon-oh-yeah-snowboard---women's-",
		"brand": "salomon",
		"description": "Remember the first time you stomped that trick, and said, \"Oh YEAH\" on the spot? You'll be saying it more than ever with the Salomon Oh Yeah Snowboard strapped on your feet. This sick freestyle board was made for progression, with a forgiving flex and Freestyle Edge Bevels. You'll be feeling it from day one.",
		"image": "1648852532621.jpg",
		"price": "279.96",
		"sized": ["168", "146"],
		"stock": 93
	},
	{
		"title": "Jones Stratos x Elena Snowboard - Women's 2023",
		"formattedTitle": "jones-stratos-x-elena-snowboard---women's-",
		"brand": "jones",
		"description": "Driving to the mountain with an uncertain forecast? The Jones Stratos x Elena Snowboard is the easy answer. A directional rocker profile with just the right amount of camber underfoot provides pop, power, and grip on firm snow, while 3D Contour Base shaping makes for dreamy transitions to softer stuff. A tight sidecut and friendly flex give this board a playful feel so you can carve, drop, and bounce around the mountain to your heart's content. Laid up with a stunning limited edition topsheet, this Elena Hight approved model is the perfect companion to make memories in the mountains.",
		"image": "1648852534858.jpg",
		"price": "629.95",
		"sized": ["158"],
		"stock": 91
	},
	{
		"title": "GNU B-Nice BTX Snowboard - Women's 2022",
		"formattedTitle": "gnu-b-nice-btx-snowboard---women's-",
		"brand": "gnu",
		"description": "Shred nice lines, on nice days, with the nicest friends on the GNU B-Nice BTX Snowboard. Its soft flex, easygoing shape, and Original Banana contour allow for catch-free and predictable riding across the entire mountain. Even if conditions are sub-nice, there's no better resort BFF than the GNU B-Nice BTX Snowboard.",
		"image": "1648852537156.jpg",
		"price": "319.99",
		"sized": ["150", "138", "158"],
		"stock": 115
	},
	{
		"title": "Burton Rewind LTD Snowboard - Women's 2022",
		"formattedTitle": "burton-rewind-ltd-snowboard---women's-",
		"brand": "burton",
		"description": "A softer-flexing and more forgiving board that's not gutless at speed, the Burton Rewind LTD Snowboard is the result of decades of Burton's accumulated know-how. They start with a classic Super Fly® 800G core with Dualzone™ EGD™ for a solid foundation, then add a supple Squeezbox Low construction to get the softer women's flex. You've heard this all before, but experience really does count in snowboard manufacture and the Rewind LTD will take you back to 00:00 - the perfect place to launch your snowboarding career.",
		"image": "1648852539774.jpg",
		"price": "499.95",
		"sized": ["148", "138", "152", "162", "168"],
		"stock": 39
	}
]
