[
	{
		"title": "Nidecker Muon-W SE Snowboard Bindings - Women's 2022",
		"formattedTitle": "nidecker-muon-w-se-snowboard-bindings---women's-",
		"brand": "nidecker",
		"description": "The Nidecker Muon-W SE Snowboard Bindings are high-caliber bindings for the people. They provide a comfortable, easy ride for women who want to elevate their snowboarding skills. Comfort Fit ankle straps are as comfortable as their name implies and they'll give you plenty of support and control. The Hexo toe cap form-fits to your toe for ultimate power transfer, so you can lock down with the lightweight Proton ratchets and make precise turns. This SE version features evo exclusive colorways.",
		"image": "1648850540683.jpg",
		"price": "139.99",
		"sized": ["S", "M", "L"],
		"stock": 119
	},
	{
		"title": "Arbor Acacia Snowboard Bindings - Women's 2022",
		"formattedTitle": "arbor-acacia-snowboard-bindings---women's-",
		"brand": "arbor",
		"description": "Arbor Acacia Snowboard Bindings make for an easy entry to snowboarding, in both the general and specific sense. They're angled and shaped to cradle your boots comfortably, with asymmetrical highbacks and canted footbeds that place your knees in line with their natural stance. The straps are plush and easily adjustable, letting you get to the task at hand (shredding) instead of taking pain breaks every ten minutes.",
		"image": "1648850543798.jpg",
		"price": "148.74",
		"sized": ["S", "M", "L"],
		"stock": 90
	},
	{
		"title": "Nitro Rythm Snowboard Bindings - Women's 2022",
		"formattedTitle": "nitro-rythm-snowboard-bindings---women's-",
		"brand": "nitro",
		"description": "Snowboarding is all about having fun and pushing your boundaries, things that the Nitro Rythm Snowboard Bindings know all too well. These bindings are all about progression with a smile, after all. They're crafted with a smooth, forgiving flex and women's specific highbacks designed to work with your body, not against it. With a perfect fit ankle strap and a convertible toe strap, they'll remain comfortable, secure, and responsive no matter what type of boot you're rocking.",
		"image": "1648850546083.jpg",
		"price": "119.96",
		"sized": ["S", "M", "L"],
		"stock": 1
	},
	{
		"title": "Union Rosa Snowboard Bindings - Women's 2022",
		"formattedTitle": "union-rosa-snowboard-bindings---women's-",
		"brand": "union",
		"description": "Proving that entry level doesn't have to mean bottom of the barrel, the Union Rosa Snowboard Bindings bring top shelf technology to the people with an incredibly lightweight design inspired by one of Union's pro-level offerings. Not only that, they've been redesigned from the ground up, with an attention to detail that demonstrates Union's dedication to riders of every ability. If you're still getting the hang of things, or simply looking for a smooth, forgiving pair, the Union Rosa Snowboard Bindings are one of the best options out there.",
		"image": "1648850548828.jpg",
		"price": "144.46",
		"sized": ["S", "M", "L"],
		"stock": 250
	},
	{
		"title": "Arbor Sequoia LTD Snowboard Bindings - Women's 2022",
		"formattedTitle": "arbor-sequoia-ltd-snowboard-bindings---women's-",
		"brand": "arbor",
		"description": "Have you heard about these sequoias? They're the next big thing. And the previous big thing. And just like their namesake, the Arbor Sequoia Snowboard Bindings are larger than life. They define the genre of high performing mid-flexing binders that will help you feel comfortable and in control anywhere on the mountain. This LTD creme colorway is available exclusively from evo!",
		"image": "1648850551477.jpg",
		"price": "209.99",
		"sized": ["S", "M", "L"],
		"stock": 81
	},
	{
		"title": "Burton Citizen Snowboard Bindings - Women's 2022",
		"formattedTitle": "burton-citizen-snowboard-bindings---women's-",
		"brand": "burton",
		"description": "You've paid your dues on the bunny hill and it's time to hit the big leagues. The Burton Citizen Snowboard Bindings have what you need with a comfortable and forgiving ride that helps you progress from zero to shred in no time. Featuring MicroFLAD™ adjustable forward lean, the Re:Flex™ FullBED cushioning system and women's specific True Fit™ design, the Citizen has something for everyone.",
		"image": "1648850554330.jpg",
		"price": "169.95",
		"sized": ["S", "M", "L"],
		"stock": 56
	},
	{
		"title": "Burton Lexa Snowboard Bindings - Women's 2022",
		"formattedTitle": "burton-lexa-snowboard-bindings---women's-",
		"brand": "burton",
		"description": "The Burton Lexa Snowboard Bindings are built for the hard charger, the ripper who's out there for the good and the bad, whether it's waist deep or boilerplate. They're built with stiff nylon composite Re:Flex™ baseplates, cushy FullBED footbeds to soak up impacts, and extra-responsive ankle and toe straps to keep you locked in tight, no matter how rowdy your ride gets. Just like you, they have the guts to perform no matter what the conditions hold, so grab the Lexas and get after it.",
		"image": "1648850557320.jpg",
		"price": "274.95",
		"sized": ["S", "M", "L"],
		"stock": 94
	},
	{
		"title": "Burton Lexa X EST Snowboard Bindings - Women's 2022",
		"formattedTitle": "burton-lexa-x-est-snowboard-bindings---women's-",
		"brand": "burton",
		"description": "The Burton Lexa X EST Snowboard Bindings are top level all-mountain binders to get you charging hard on your Burton board. By using Burton's EST system, you get the closest boot to board contact of any binding. When paired with the responsive highback and featherweight construction of the Lexa X, your bindings and feet disappear as you become one with your snowboard, commanding it to rip ever faster down the hill powered by nothing but pure, distilled stoke.",
		"image": "1648850561026.jpg",
		"price": "314.95",
		"sized": ["S", "M", "L"],
		"stock": 13
	},
	{
		"title": "Flow Mayon Snowboard Bindings - Women's 2022",
		"formattedTitle": "flow-mayon-snowboard-bindings---women's-",
		"brand": "flow",
		"description": "Looking for an easy way to boost your riding experience? Check out the Flow Mayon Snowboard Bindings. They come with Flow's latest Fusion Exo-Frame PowerStraps for a supremely comfortable and responsive board connection, and 2.5º Canted BankBeds that put your feet and legs in the optimal position to reduce fatigue over the course of the day. Add it up with their legendary rear-entry design and Active Strap Technology, and the Flow Mayon Snowboard Bindings are sure to be a winner.",
		"image": "1648850563974.jpg",
		"price": "175.96",
		"sized": ["S", "M", "L"],
		"stock": 97
	},
	{
		"title": "Burton Lexa EST Snowboard Bindings - Women's 2022",
		"formattedTitle": "burton-lexa-est-snowboard-bindings---women's-",
		"brand": "burton",
		"description": "The Burton Lexa EST Snowboard Bindings are built for the hard charger, the ripper who's out there for the good and the bad, whether it's waist deep or boilerplate. They're built with stiff nylon composite Re:Flex™ baseplates, cushy FullBED footbeds to soak up impacts, and extra-responsive ankle and toe straps to keep you locked in tight, no matter how rowdy your ride gets. Just like you, they have the guts to perform no matter what the conditions hold, so grab the Lexas and get after it.",
		"image": "1648850566622.jpg",
		"price": "274.95",
		"sized": ["S", "M", "L"],
		"stock": 54
	},
	{
		"title": "Arbor Sequoia Snowboard Bindings - Women's 2022",
		"formattedTitle": "arbor-sequoia-snowboard-bindings---women's-",
		"brand": "arbor",
		"description": "Have you heard about these sequoias? They're the next big thing. And the previous big thing. And just like their namesake, the Arbor Sequoia Snowboard Bindings are larger than life. They define the genre of high performing mid-flexing binders that will help you feel comfortable and in control anywhere on the mountain.",
		"image": "1648850570201.jpg",
		"price": "178.49",
		"sized": ["S", "M", "L"],
		"stock": 37
	},
	{
		"title": "Flow Juno Fusion Snowboard Bindings - Women's 2022",
		"formattedTitle": "flow-juno-fusion-snowboard-bindings---women's-",
		"brand": "flow",
		"description": "The Flow Juno Snowboard Bindings deliver a lively ride suitable for rippers of any ability. Their soft flex is ideal for those learning the ropes, but more experienced riders will appreciate their forgiving personality in the park and beyond. Rockered AXIS-Series baseplates ensure balanced power transfer to your edges, and Reclining Highbacks make them a breeze to get in and out of without having to sit in the snow. If you're looking for a setup you can get along with right off the bat, look no further than the Flow Juno Snowboard Bindings.",
		"image": "1648850573009.jpg",
		"price": "169.95",
		"sized": ["S", "M", "L"],
		"stock": 162
	},
	{
		"title": "Burton Step On Snowboard Bindings - Women's 2022",
		"formattedTitle": "burton-step-on-snowboard-bindings---women's-",
		"brand": "burton",
		"description": "Pair these bindings with some Burton Step On Boots to experience the simplest, most straightforward setup on the mountain. With the Burton Step On Snowboard Bindings you can (surprise) just step right onto your bindings. They're crazy intuitive, and they give you a perfect connection to your board for easy all-mountain stylin'. No straps, all shred.",
		"image": "1648850576052.jpg",
		"price": "284.95",
		"sized": ["S", "M", "L"],
		"stock": 241
	},
	{
		"title": "Arbor Acacia Snowboard Bindings - Women's 2023",
		"formattedTitle": "arbor-acacia-snowboard-bindings---women's-",
		"brand": "arbor",
		"description": "The Arbor Acacia Snowboard Bindings are a progression friendly choice that hit the sweet spot of comfort, performance, and value. The single mold baseplate provides precise, responsive board feel and tons of durability, and the women's specific highbacks deliver the control you need to progress from greens to blues to blacks. The latest model features all new ergonomic, pre-curved ankle straps for improved comfort and control, getting you moving and shaking up the learning curve.",
		"image": "1648850579905.jpg",
		"price": "199.99",
		"sized": ["S", "M", "L"],
		"stock": 238
	},
	{
		"title": "Dakine Binding Hardware",
		"formattedTitle": "dakine-binding-hardware",
		"brand": "dakine",
		"description": "Whether you are replacing old screws or dialing in your snowboard repair kit, the Dakine Binding Hardware is here to save the day. Designed to industry standards, these screws and washers fit most snowboard bindings on the market and each screw comes pre-dressed with thread lock to keep them from working loose.",
		"image": "1648850582344.jpg",
		"price": "7.95",
		"sized": ["S", "M", "L"],
		"stock": 203
	},
	{
		"title": "Union Camber Disk Set 2022",
		"formattedTitle": "union-camber-disk-set-",
		"brand": "union",
		"description": "Sometimes disks like to go walkabout. But don't worry, the Union Camber Disk Set is here for you. Other possible uses for this disc set include: air hockey pucks, miniature frisbee golf discs, or small hors d'oeuvres plates at a snowboarding themed restaurant. You heard it here first.",
		"image": "1648850584881.jpg",
		"price": "14.95",
		"sized": ["S", "M", "L"],
		"stock": 141
	},
	{
		"title": "Union Aluminum Ankle Ratchet Set 2022",
		"formattedTitle": "union-aluminum-ankle-ratchet-set-",
		"brand": "union",
		"description": "You went huge off that booter and busted your ratchet, but fear not: the Union Aluminum Ankle Ratchet Set is here to save the day. Compatible with all Union bindings, this set will have you dropping in for a shot at redemption ASAP.",
		"image": "1648850587058.jpg",
		"price": "24.95",
		"sized": ["S", "M", "L"],
		"stock": 129
	},
	{
		"title": "Union Mini Disk Set 2022",
		"formattedTitle": "union-mini-disk-set-",
		"brand": "union",
		"description": "Are your favorite old bindings looking tired and worn out? Snag the Union Mini Disk Set for any compatible binding model and get back in the game.",
		"image": "1648850589300.jpg",
		"price": "14.95",
		"sized": ["S", "M", "L"],
		"stock": 60
	},
	{
		"title": "Flow Mayon Plus Fusion Snowboard Bindings - Women's 2022",
		"formattedTitle": "flow-mayon-plus-fusion-snowboard-bindings---women's-",
		"brand": "flow",
		"description": "You're at the top of the chair staring down at the fresh snow that fell the night before. Life is good. But then you realize time is of the essence, as more and more riders pour out from the lift. Luckily you have the Flow Mayon Plus Fusion Snowboard Bindings under your feet. These mid-flexing all-mountain bindings have Flow's signature easy in, easy out snowboarding experience. The Flow Mayon Plus Fusion bindings also comes with Active Strap Technology, a lightweight and durable main strap that has great power transfer and wont freeze in the cold and wet conditions.",
		"image": "1648850592799.jpg",
		"price": "191.96",
		"sized": ["S", "M", "L"],
		"stock": 144
	},
	{
		"title": "Salomon Rhythm Snowboard Bindings 2022",
		"formattedTitle": "salomon-rhythm-snowboard-bindings-",
		"brand": "salomon",
		"description": "If you value comfort above all else in a snowboard binding, the Rhythm was built just for you. Featuring cushy Full EVA footbeds, 3D Supreme ankle straps, and smooth flexing highbacks, the Salomon Rhythm Snowboard Bindings are ideal for beginner snowboarders getting into the swing of things, or mellow cruisers with a laid-back approach to the mountain.",
		"image": "1648850595170.jpg",
		"price": "127.46",
		"sized": ["S", "M", "L"],
		"stock": 70
	},
	{
		"title": "Bataleon Spirit Snowboard Bindings - Women's 2022",
		"formattedTitle": "bataleon-spirit-snowboard-bindings---women's-",
		"brand": "bataleon",
		"description": "The Bataleon Spirit Snowboard Bindings are Bataleon's choice to pair with the Spirit snowboard, the softest and easiest to master in their lineup. Easy-flexing, comfortable and light, the Spirit bindings are a great choice for your first setup.",
		"image": "1648850597965.jpg",
		"price": "152.96",
		"sized": ["S", "M", "L"],
		"stock": 61
	},
	{
		"title": "Burton Scribe Snowboard Bindings - Women's 2022",
		"formattedTitle": "burton-scribe-snowboard-bindings---women's-",
		"brand": "burton",
		"description": "Create your own legend with the Burton Scribe Snowboard Bindings, a sure way to make sure your efforts on the board are transcribed with unerring accuracy. The Scribes boast Re:Flex™ FullBED footbeds for a smooth ride and impact absorption, and Reactstrap™ straps with Smooth Glide™ buckles for the slickest operation in town.",
		"image": "1648850601308.jpg",
		"price": "219.95",
		"sized": ["S", "M", "L"],
		"stock": 118
	},
	{
		"title": "Burton Escapade Snowboard Bindings - Women's 2022",
		"formattedTitle": "burton-escapade-snowboard-bindings---women's-",
		"brand": "burton",
		"description": "Here we go ladies, the Burton Escapade Snowboard Bindings are here and ready to have your back through deep or shallow and everything in-between. Its smooth medium-firm flex and Zero-Lean Canted Highback provide a responsive flex that is tweakable yet firm. Locking your boots to the board is a Hammockstrap™ ankle strap and Suregrip Capstrap™ 2.0 designed for even hold and wide, comfortable coverage. The Burton Escapade Snowboard Bindings are a hard charging binding with a Women's Specific True Fit™ and fine adjustability you'll come to trust as they take you through thick and thin cold or heavy.",
		"image": "1648850604159.jpg",
		"price": "349.95",
		"sized": ["S", "M", "L"],
		"stock": 44
	},
	{
		"title": "Burton Lexa X Snowboard Bindings - Women's 2022",
		"formattedTitle": "burton-lexa-x-snowboard-bindings---women's-",
		"brand": "burton",
		"description": "The Burton Lexa X Snowboard Bindings bring the pro to the people, with a stiffer flex than the regular version and all new highbacks for improved precision, response, and power. They're built with stiff nylon composite Re:Flex™ baseplates, cushy FullBED footbeds to dampen vibration, and grippy Heel Hammock construction to keep your heels locked in tight, even when your supersonic straight line turns to chunder and chop. Any line, any conditions, any day, you can trust the Burton Lexa X Snowboard Bindings to handle it in style.",
		"image": "1648850608156.jpg",
		"price": "314.95",
		"sized": ["S", "M", "L"],
		"stock": 25
	},
	{
		"title": "K2 Cassette Snowboard Bindings - Women's 2022",
		"formattedTitle": "k2-cassette-snowboard-bindings---women's-",
		"brand": "k2",
		"description": "The K2 Cassette Snowboard Bindings are made to help flatten the learning curve and get you from falling leaf to leaving your friends in the dust in no time flat. The gentle, progressive flex of the bindings couples with a plush ankle strap and K2's women specific A-line chassis to keep you in the drivers seat and under control as you take your riding to new heights.",
		"image": "1648850611393.jpg",
		"price": "135.96",
		"sized": ["S", "M", "L"],
		"stock": 211
	},
	{
		"title": "Bent Metal Bolt Snowboard Bindings 2022",
		"formattedTitle": "bent-metal-bolt-snowboard-bindings-",
		"brand": "bent",
		"description": "Stomp your tricks and nail your turns with Bent Metal Bolt Snowboard Bindings. With a solid set of features and all-mountain flex, these are great for all but the most demanding riders. They're lightweight, comfortable, and very responsive. And, yeah, you'll be landing \"bolts\" every dang time!",
		"image": "1648850614991.jpg",
		"price": "119.99",
		"sized": ["S", "M", "L"],
		"stock": 206
	},
	{
		"title": "Bent Metal Metta Snowboard Bindings - Women's 2022",
		"formattedTitle": "bent-metal-metta-snowboard-bindings---women's-",
		"brand": "bent",
		"description": "When they're on your board, Bent Metal Metta Snowboard Bindings are good vibe enhancers, powder run dancers, prime goofy - and regular - stancers. They're forgiving enough for park tweaks and mellow pow peelers yet stiff enough for some confident maneuvers in higher risk environs. That's when they're mounted on your board, though. When they're off your board they'll just make you walk funny.",
		"image": "1648850617500.jpg",
		"price": "149.99",
		"sized": ["S", "M", "L"],
		"stock": 92
	},
	{
		"title": "GNU B-Real Snowboard Bindings - Women's 2022",
		"formattedTitle": "gnu-b-real-snowboard-bindings---women's-",
		"brand": "gnu",
		"description": "The versatility of the GNU B-Real Snowboard Bindings shines through no matter how or where you ride. A reclining highback ensures a super speedy entry so you can get up and riding quickly after dismounting from the lift, translating to at least 50 more untracked powder turns per season. And with automatically opening ankle straps for unmatched ease of use, your days will be that much more chill and frustration-free.",
		"image": "1648850620309.jpg",
		"price": "159.99",
		"sized": ["S", "M", "L"],
		"stock": 33
	},
	{
		"title": "Roxy Viva Snowboard Bindings - Women's 2022",
		"formattedTitle": "roxy-viva-snowboard-bindings---women's-",
		"brand": "roxy",
		"description": "Cruise the mountain with confidence in the Roxy Viva Snowboard Bindings. These all-mountain bindings pair perfectly with your favorite resort board for lasting comfort and balanced riding, with lightweight components and a forgiving flex to make you one happy shredder.",
		"image": "1648850622884.jpg",
		"price": "95.99",
		"sized": ["S", "M", "L"],
		"stock": 38
	},
	{
		"title": "Salomon Mirage Snowboard Bindings - Women's 2022",
		"formattedTitle": "salomon-mirage-snowboard-bindings---women's-",
		"brand": "salomon",
		"description": "The Salomon Mirage Snowboard Bindings are a medium-flexing park-oriented binding designed for comfort and response. The women-specific Mirage highback uses a flex line at the top to allow the binding to accommodate a larger and lower women's calf, keeping you comfortable and happy during long days on the hill.",
		"image": "1648850626371.jpg",
		"price": "199.96",
		"sized": ["S", "M", "L"],
		"stock": 75
	},
	{
		"title": "Salomon Spell Snowboard Bindings - Women's 2022",
		"formattedTitle": "salomon-spell-snowboard-bindings---women's-",
		"brand": "salomon",
		"description": "The Salomon Spell Snowboard Bindings are a great entry-level binding that hit well above their class. Built for smooth riding and comfort while strapped-in, the Spell bindings are a great choice for riding up (and down) that learning curve.",
		"image": "1648850628402.jpg",
		"price": "109.95",
		"sized": ["S", "M", "L"],
		"stock": 167
	},
	{
		"title": "Union Explorer Splitboard Bindings 2022",
		"formattedTitle": "union-explorer-splitboard-bindings-",
		"brand": "union",
		"description": "The Union Explorer Splitboard Bindings show Union's commitment to the adventure seekers out there, steadily improving on their designs every season. These latest split bindings are stronger, lighter, and still incredibly comfortable. While other splitters are complaining about harsh baseplates and input lag, you'll feel like you're in a set of normal bindings, popping and carving and, well, snowboarding! The hardware is top notch, the construction is Union-tough, and that ride feel...have we mentioned how these are splitboard bindings for snowboarders? These are a great option for the non-ice axe set.",
		"image": "1648850632092.jpg",
		"price": "319.96",
		"sized": ["S", "M", "L"],
		"stock": 52
	},
	{
		"title": "K2 Hue Snowboard Bindings - Women's 2022",
		"formattedTitle": "k2-hue-snowboard-bindings---women's-",
		"brand": "k2",
		"description": "OK, so the K2 Hue Snowboard Bindings only come in one hue - black. On the plus side they're designed with the fully customizable TriPod Chassis that optimizes power transmission and features K2's Lock Out Block for a super stable heelside feel. For women who ride hard and cherish the feel of a well-executed turn, the Hue is real.",
		"image": "1648850634940.jpg",
		"price": "223.96",
		"sized": ["S", "M", "L"],
		"stock": 240
	},
	{
		"title": "Bent Metal Forte Snowboard Bindings - Women's 2022",
		"formattedTitle": "bent-metal-forte-snowboard-bindings---women's-",
		"brand": "bent",
		"description": "When you focus, you can flourish. Bent Metal Forte Snowboard Bindings score high marks across all of snowboarding's many genres, with no glaring deficiencies. Park, pow, no-fall steeps, whatever you like. This do-it-all nature lets you find your forte, discover your niche, and lay claim to your métier. Heck, you could even find your fave, if you're keeping it domestic. The Forte has the right mix of comfort, stiffness, and feel to really charge off into that unknown with confidence.",
		"image": "1648850637957.jpg",
		"price": "202.99",
		"sized": ["S", "M", "L"],
		"stock": 38
	},
	{
		"title": "Union Explorer FC Splitboard Bindings 2022",
		"formattedTitle": "union-explorer-fc-splitboard-bindings-",
		"brand": "union",
		"description": "The Union Explorer FC Splitboard Bindings take the \"snowboarder's splitboard binding\" to higher heights with some fancy materials and futuristic engineering. Known for their ride quality and comfort, these puppies sport featherlight titanium bits and a forged carbon heelcup, making them lighter than their aluminum and steel-equipped stablemates. 70 grams may not seem like much, but lifting that extra weight over and over again adds up. These bindings help you save every last bit of energy for the ride down, which is what it's all about!",
		"image": "1648850641813.jpg",
		"price": "439.96",
		"sized": ["S", "M", "L"],
		"stock": 182
	},
	{
		"title": "K2 Cinch Tryst Snowboard Bindings - Women's 2022",
		"formattedTitle": "k2-cinch-tryst-snowboard-bindings---women's-",
		"brand": "k2",
		"description": "The Cinch technology in the K2 Cinch Tryst Snowboard Bindings allows you to use the binding in a traditional strap style, or as a rear entry binding for added speed at the top of the lift, while the adjustable TriPod Chassis provides a custom fit and premium power transfer. In addition to the added ease of use, the Tryst still provides the well-honed, responsive ride you'd expect from a top-of-the-line K2 binder.",
		"image": "1648850644216.jpg",
		"price": "215.96",
		"sized": ["S", "M", "L"],
		"stock": 193
	},
	{
		"title": "Spark R&D Arc Splitboard Bindings 2022",
		"formattedTitle": "spark-r&d-arc-splitboard-bindings-",
		"brand": "spark",
		"description": "Lightweight, durable, and simple to use out in the field, the Spark R&D Arc Splitboard Bindings hit all the right notes for bomber backcountry performance. Their proven Tesla T1 platform uses an integrated snap toe ramp to positively lock into touring brackets and over any splitboard pucks, making for speedy, straightforward transitions, even with gloves on. Aluminum baseplates are CNC machined with cutouts that minimize weight without compromising strength, and allow for convenient puck adjustment. In ride mode the Rip ‘N’ Flip Highbacks are medium flexing for a smooth, surfy feel, perfect for the rider headed for pow. Give yourself a head start on fresh tracks with the Spark R&D Arc Splitboard Bindings.",
		"image": "1648850646928.jpg",
		"price": "385.00",
		"sized": ["S", "M", "L"],
		"stock": 112
	},
	{
		"title": "Nidecker Kaon-W Snowboard Bindings - Women's 2022",
		"formattedTitle": "nidecker-kaon-w-snowboard-bindings---women's-",
		"brand": "nidecker",
		"description": "Nidecker Kaon-W Snowboard Bindings are ideal for skilled freeriders, precision carvers, and all-mountain alpha females. Lightweight, strong, and responsive, these bindings feature Asym Hadron Hibacks and glass-filled Axis.N1-Series baseplates and heelcups. ExoFrame ankle straps and Hexo toecaps give you seamless edge-to-edge energy transfer and secure foothold, so your board moves with you, and not the other way around.",
		"image": "1648850649448.jpg",
		"price": "159.96",
		"sized": ["S", "M", "L"],
		"stock": 207
	},
	{
		"title": "Spark R&D Arc Splitboard Bindings - Women's 2022",
		"formattedTitle": "spark-r&d-arc-splitboard-bindings---women's-",
		"brand": "spark",
		"description": "Lightweight, durable, and simple to use out in the field, the Spark R&D Arc Splitboard Bindings hit all the right notes for bomber backcountry performance. Their proven Tesla T1 platform uses an integrated snap toe ramp to positively lock into touring brackets and over any splitboard pucks, making for speedy, straightforward transitions, even with gloves on. Aluminum baseplates are CNC machined with cutouts that minimize weight without compromising strength, and allow for convenient puck adjustment. In ride mode the Rip ‘N’ Flip Highbacks are medium flexing for a smooth, surfy feel, perfect for the rider headed for pow. Give yourself a head start on fresh tracks with the Spark R&D Arc Splitboard Bindings.",
		"image": "1648850652148.jpg",
		"price": "385.00",
		"sized": ["S", "M", "L"],
		"stock": 219
	},
	{
		"title": "Flow Omni Fusion Snowboard Bindings - Women's 2022",
		"formattedTitle": "flow-omni-fusion-snowboard-bindings---women's-",
		"brand": "flow",
		"description": "The Flow Omni Fusion Snowboard Bindings are designed to make you feel omnipotent on snow, with rockered FUSE-Series baseplates and Carbon-infused highbacks for unrivaled support and power when you crank up the speed. Built with the latest iteration of the acclaimed Fusion PowerStrap, these premium binders cradle your boot comfortably and precisely, creating a direct connection between you and your board for better-than-ever response and control. More comfortable, easier to use, and zero compromise on performance - just another day for the Flow Omni Fusion Snowboard Bindings.",
		"image": "1648850655585.jpg",
		"price": "269.95",
		"sized": ["S", "M", "L"],
		"stock": 119
	}
]
