[
	{
		"title": "Jones Tweaker Snowboard 2023",
		"formattedTitle": "jones-tweaker-snowboard-",
		"brand": "jones",
		"description": "You didn't think Jones were only about stiff freeride boards and 4am wake up calls did you? The Jones Tweaker Snowboard is a freestyle focused true twin with limitless energy and a wicked sense of humor. The Tweaker’s unique double radius nose and tail profile maximises the running length of the blunted shape, while the V-Core profile hits the sweet spot between playful manueverability and stomping power. If your riding style involves tearing around the mountain hunting for kickers and side hits before lapping the park all afternoon, the Tweaker is the board for you.",
		"image": "1653393559919.jpg",
		"price": "529.95",
		"sized": ["162", "138"],
		"stock": 49,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "CAPiTA Indoor Survival Snowboard 2023",
		"formattedTitle": "capita-indoor-survival-snowboard-",
		"brand": "capita",
		"description": "Survive and thrive with the CAPiTA Indoor Survival Snowboard. Now available in larger sizes with dedicated 'Wide' models, the Indoor Survival is back, and it's better than ever. This technically packed directional twin is engineered to crush the park and dominate the entire mountain with a super-fast Quantum Drive base and the P2 Superlight Core™ with Titanal Centerline reinforcement for added stability and power. It's one of the most versatile, well rounded boards in the entire Capita lineup, perfect for riders sampling everything the resort has to offer.",
		"image": "1653393563351.jpg",
		"price": "549.95",
		"sized": ["164", "162", "150", "148", "142", "158"],
		"stock": 92,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Flat/Camber/Flat",
		"shape": "Directional Twin",
		"flex_rating": "Medium",
		"core": "Carbon, Wood"
	},
	{
		"title": "CAPiTA Super DOA Snowboard 2023",
		"formattedTitle": "capita-super-doa-snowboard-",
		"brand": "capita",
		"description": "Martian conspiracies. Alien abductions. Mysterious materials from the moon. The CAPiTA Super DOA Snowboard combines tried and true twin tip style with super-materials straight out of a sci-fi movie to make one of the most perfect snowboards of our timeline. Upgraded with a new 3D Thermopolymer SuperCore and Moonshot Omni-Tune performance stone grind for maximum speed in any direction, it's a nebulous swirl of natural and supernatural elements all baked into a freestyle vessel that'll pop, butter, and spin like the deep space craft it is. All you're missing is an unexplained monolith to slide.",
		"image": "1653393566820.jpg",
		"price": "749.95",
		"sized": ["164", "148", "138", "150", "142"],
		"stock": 52,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "True Twin",
		"flex_rating": "Stiff",
		"core": "Composite, Wood"
	},
	{
		"title": "CAPiTA Defenders of Awesome Snowboard 2023",
		"formattedTitle": "capita-defenders-of-awesome-snowboard-",
		"brand": "capita",
		"description": "When all's said and done, do you want to be remembered as someone who stood up for all that is righteous and rad, or someone who shrugged their shoulders and settled for \"good enough\"? If it's the former, then the CAPiTA Defenders of Awesome Snowboard is for you. This is a classic all mountain freestyle deck capable of turning the smallest pee-wee mogul into a sendable kicker. As for cat tracks, side hits, and tree stumps? They don't stand a chance. CAPiTA have opted for incremental change in the lastest model, keeping everything that makes this board special but laying it up with an new P2 Superlight Core that sheds a few grams without affecting performance. The result is a D.O.A. that's lighter, more nimble, and even easier to throw around. Awesome!",
		"image": "1653393570254.jpg",
		"price": "499.95",
		"sized": ["150", "164", "168", "162", "142", "148"],
		"stock": 67,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Aramid (Kevlar®), Carbon, Wood"
	},
	{
		"title": "Arbor Crosscut Rocker Snowboard 2023",
		"formattedTitle": "arbor-crosscut-rocker-snowboard-",
		"brand": "arbor",
		"description": "Rocker around! The Arbor Crosscut Rocker Snowboard inspires confidence everywhere from smooth in-bounds groomers to fluffy off-piste pow. Equipped with a directional shape, mild taper, and setback stance, cruising in style never looked so dreamy. Cut with carving in mind, the Crosscut's wide turning radius helps you look GOOD every time you turn. Bold, bright art and eco friendly materials round out the Arbor Crosscut Rocker Snowboard. This is one you won't want to miss.",
		"image": "1653393573332.jpg",
		"price": "549.95",
		"sized": ["148"],
		"stock": 126,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride, Powder",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Wood"
	},
	{
		"title": "CAPiTA Black Snowboard Of Death Snowboard 2023",
		"formattedTitle": "capita-black-snowboard-of-death-snowboard-",
		"brand": "capita",
		"description": "There's still life in the dog yet. The CAPiTA Black Snowboard Of Death Snowboard has been tearing around in pursuit of the goods for over 20 years, and there's no sign of it slowing down. The latest model had been reinforced with inlaid alloy skid plates and updated with an all new Thermopolymer Hover Core that hews to its do anything, go anywhere philosophy. This is still the progressive, directional board you know, and love, ready to thread the needle in technical terrain, demolish fields of untracked pow, and lay down spooky fast carves all season long.",
		"image": "1653393576761.jpg",
		"price": "699.95",
		"sized": ["148", "146", "138", "158", "162"],
		"stock": 87,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Carbon, Flax, Wood"
	},
	{
		"title": "CAPiTA Mega Mercury Snowboard 2023",
		"formattedTitle": "capita-mega-mercury-snowboard-",
		"brand": "capita",
		"description": "The CAPiTA Mega Mercury Snowboard takes the all-round versatility of the already popular Mercury and slathers it with extra sauce. Laid up with a super poppy core, this capable deck is amped up and slimmed down with Capita's Megacarbon™ Array and Megalite Skin™ for lightweight performance that allows you take flight in any situation. Add in a new warp speed Moonshot Omni-Tune™ and you've got a board destined to thrive in both natural and manmade environments alike. Get mega, stay mega!",
		"image": "1653393580454.jpg",
		"price": "799.95",
		"sized": ["138", "162", "158"],
		"stock": 168,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Carbon, Wood"
	},
	{
		"title": "K2 Afterblack Snowboard 2023",
		"formattedTitle": "k2-afterblack-snowboard-",
		"brand": "k2",
		"description": "The big blunted tips and slightly upturned profile of the K2 Afterblack Snowboard just begs to be buttered. This freestyle deck is just soft enough to bend into, but with enough stiffness and camber to get a ton of energy out of on the rebound. It's perfect for sliding rails, pressing boxes, and sending sidehits and booters with creativity and finesse.",
		"image": "1653393584040.jpg",
		"price": "459.95",
		"sized": ["138", "142", "146", "162", "168", "148"],
		"stock": 235,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Bamboo, Carbon, Wood"
	},
	{
		"title": "K2 Instrument Snowboard 2023",
		"formattedTitle": "k2-instrument-snowboard-",
		"brand": "k2",
		"description": "Size down so you can power up on the K2 Instrument Snowboard. If you're looking for fun and versatility, this directional, volume shifted shape is the full package. Featuring K2's new S1 core and Carbon Torque Forks, it provides lively rebound out of turns and smooth stability at speed. It's a great board for powder days, spring slush laps, snappy groomer turns, and ear-to-ear smiles.",
		"image": "1653393587289.jpg",
		"price": "529.95",
		"sized": ["150", "152", "146"],
		"stock": 216,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride, Powder",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Bamboo, Carbon, Wood"
	},
	{
		"title": "Ride Algorythm Snowboard 2023",
		"formattedTitle": "ride-algorythm-snowboard-",
		"brand": "ride",
		"description": "The Ride Algorythm Snowboard is a snowboarders' snowboard. Like the sport itself, from the parks it came and to the parks it shall return. But in between, it does a whole lot more. This directional twin is high performing yet approachable, blending the playful elegance of a freestyle jib stick with the casual competence of a sturdy all-mountain board. Utilizing a quadratic sidecut for easy and precise turning, plus a whole bunch of carbon fiber for dialed pop and response, the Algorythm is an easy choice for anytime styling on any terrain.",
		"image": "1653393590537.jpg",
		"price": "599.95",
		"sized": ["158", "150"],
		"stock": 78,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional Twin",
		"flex_rating": "Medium",
		"core": "Bamboo, Carbon, Wood"
	},
	{
		"title": "Ride Twinpig Snowboard 2023",
		"formattedTitle": "ride-twinpig-snowboard-",
		"brand": "ride",
		"description": "Do you like your ham with a side of sausage? Do you prefer your burritos with carnitas and chorizo? Basically what we're asking is: do you need double the bacon? Well you are in luck. The Ride Twinpig Snowboard is everything you love about the short, fat, directional Warpig, but in a twin shape. That means you get all the pork going forward, plus all the pork going backwards. This freestyle machine thrashes the mountain in both directions, and does extra damage in the park. Its wide shape and double blunted nose makes it spin easily, stomp hard, and break the boundaries of what you thought a freestyle board could be.",
		"image": "1653393594338.jpg",
		"price": "499.95",
		"sized": ["150", "146"],
		"stock": 131,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Asymmetrical, True Twin",
		"flex_rating": "Soft",
		"core": "Bamboo, Carbon, Wood"
	},
	{
		"title": "Ride Psychocandy Snowboard 2023",
		"formattedTitle": "ride-psychocandy-snowboard-",
		"brand": "ride",
		"description": "Based on the insanely popular Warpig model, the Ride Psychocandy Snowboard brings the same all-mountain, volume-shifted excellence to a narrower platform, with smaller sizes available for riders who can't find the right fit with the OG Pig. In addition to its inclusive size range, the Psychocandy also has a slightly more tapered tip and cutout tail, adding easy pivoting in powder and even more playful riding through slush and groomers. It's insanely fun in any conditions, and especially sweet on the feet of a jib-happy all mountain rider with a flair for speed.",
		"image": "1653393597762.jpg",
		"price": "519.95",
		"sized": ["168", "164"],
		"stock": 202,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Carbon, Wood"
	},
	{
		"title": "Ride Warpig Snowboard 2023",
		"formattedTitle": "ride-warpig-snowboard-",
		"brand": "ride",
		"description": "As one of the founding members of the short and fat movement in snowboard design, the Ride Warpig Snowboard remains one of the best in class. With a sturdy directional shape, a super wide platform, and a nimble dual-radius sidecut, the Warpig combines playful riding with dependable capability like few other boards can. With every update, it continues to astound riders with it's versatility. Take it to the steeps, the powder, the corduroy, and the slush. Dink around on mini freestyle features, or scare yourself on the hugest hits of your life. The Warpig is simply put, one of the best all-around board there is.",
		"image": "1653393601363.jpg",
		"price": "529.95",
		"sized": ["148"],
		"stock": 14,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Flat/Rocker",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Bamboo, Carbon, Wood"
	},
	{
		"title": "Ride Superpig Snowboard 2023",
		"formattedTitle": "ride-superpig-snowboard-",
		"brand": "ride",
		"description": "It's no secret now that short, fat boards are where it's at. For spring slush slashing, groomer goofing, and powder pilfering, these volume shifted shapes offer unbeatable fun. But the Ride Superpig Snowboard is more than just a good times mess-around board. Think of this as the little pig that built the brick house at the end of the story. Sure he's short and chubby, and probably super fun at parties, but he's also the one you can count on when the big bad wolf of winter is huffing and puffing feet of snow outside your door. He offers all of the nimble directional goodness of his less responsible siblings, but in a bomber shell that keeps things airtight when it's business time.",
		"image": "1653393606808.jpg",
		"price": "589.95",
		"sized": ["158", "138"],
		"stock": 209,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Bamboo, Carbon, Wood"
	},
	{
		"title": "Ride Zero Snowboard 2023",
		"formattedTitle": "ride-zero-snowboard-",
		"brand": "ride",
		"description": "A newer addition the Ride's freestyle lineup, the Ride Zero Snowboard is a scaled down version of the superpowered Benchwarmer board. This unisex board has an asymmetrical quadratic sidecut, meaning it has three different turn radii on each edge, for six different radii all together. The on-snow translation? It turns really good. It's formulated for easy turn initiation, seamless edge transfer, and dialed-in edge hold once it's where you want it to be. Paired with a park friendly twin shape and a medium flex, the Zero enables huge progression in the park and tons of fun across the whole mountain.",
		"image": "1653393610682.jpg",
		"price": "499.95",
		"sized": ["162", "138", "158"],
		"stock": 91,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Asymmetrical, True Twin",
		"flex_rating": "Medium",
		"core": "Bamboo, Carbon, Wood"
	},
	{
		"title": "Salomon Sleepwalker Snowboard 2023",
		"formattedTitle": "salomon-sleepwalker-snowboard-",
		"brand": "salomon",
		"description": "If you can ride every run at your resort in your sleep, it's time to bring the fun back to snowboarding with the Salomon Sleepwalker Snowboard. The Sleepwalker is made for the park and the streets, with a soft-medium flex and Rock Out Camber that pops off lips and grips onto boxes and rails. Royal Rubber Pads add an extra level of protection to your sidewalls, so you can protect your core and your edges as you jib your way down the hill.",
		"image": "1653393615809.jpg",
		"price": "379.95",
		"sized": ["148", "152", "142", "168"],
		"stock": 100,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "True Twin",
		"flex_rating": "Soft",
		"core": "Wood"
	},
	{
		"title": "Lib Tech BRD C3 Snowboard 2023",
		"formattedTitle": "lib-tech-brd-c3-snowboard-",
		"brand": "lib",
		"description": "In a bit of a backwards move for snowboard design, the Lib Tech BRD C3 Snowboard is a solid board based on a split. The BRD Split was so awesome that team riders like Austin Sweetin were taking it into the resort. Hence, the BRD solid was born. It's a directional powder ripper that handles the hardpack with just as much aplomb as the soft stuff. The fat nose, medium flex and setback stance keep you on top no matter what, and allow for flowy turns down any terrain. Pair that with with C3 camber for pop and precision, and it's no wonder why this BRD has such a big flock of fans.",
		"image": "1653393620272.jpg",
		"price": "629.99",
		"sized": ["146", "148", "142", "152", "162", "158"],
		"stock": 33,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride, Powder",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "Lib Tech Cold Brew C2 Snowboard 2023",
		"formattedTitle": "lib-tech-cold-brew-c2-snowboard-",
		"brand": "lib",
		"description": "Nothing wakes you up like a strong cup of cold brew coffee. Except maybe for the first turn of a long day of snowboarding with your friends. The Lib Tech Cold Brew C2 Snowboard is a perfect directional all-mountain tool meant to deliver that shot of stoke and adrenaline to get you going in the morning, and keep you up and at it all afternoon. It has a medium flex that makes it extremely versatile and easy to ride, as well as Magne-Traction edges and the stable but pivot C2 rocker profile. Take a sip, and let it rip.",
		"image": "1653393624981.jpg",
		"price": "529.99",
		"sized": ["152", "148", "164"],
		"stock": 35,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "Arbor Draft Camber Snowboard 2023",
		"formattedTitle": "arbor-draft-camber-snowboard-",
		"brand": "arbor",
		"description": "It's not just another park board. The Arbor Draft Camber Snowboard is a board that brings the park with it wherever it goes. The mid-soft flex, big blunted tips, and fendered camber profile make this thing exceptionally fun to throw around. Its tail was made for boosting side hits, the nose was made for bonking trees and boxes, and its base was made for sliding rails. Spin it, flip it, slash it, and butter it, the Draft is ready to roll.",
		"image": "1653393629784.jpg",
		"price": "449.95",
		"sized": ["152", "168", "164", "138", "142"],
		"stock": 20,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "Lib Tech T.Rice Pro HP C2 Snowboard 2023",
		"formattedTitle": "lib-tech-t.rice-pro-hp-c2-snowboard-",
		"brand": "lib",
		"description": "The Lib Tech T.Rice Pro HP C2 Snowboard is Travis Rice's everyday resort ripper. Designed to be ridden in the park and the rest of the mountain with equal ease, but to hold up to the most aggressive riding on the planet, the T.Rice Pro is a unique blend of hard-charging and playful. If you want one board you can reach for anytime you're riding lifts that will never leave you feeling over-encumbered or under-gunned, this is just the thing for you.",
		"image": "1653393634999.jpg",
		"price": "659.99",
		"sized": ["158", "138"],
		"stock": 248,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain, Freeride",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "True Twin",
		"flex_rating": "Stiff",
		"core": "Basalt, Wood"
	},
	{
		"title": "Salomon Huck Knife Snowboard 2023",
		"formattedTitle": "salomon-huck-knife-snowboard-",
		"brand": "salomon",
		"description": "Novice riders and expert park rats can all agree that the Salomon Huck Knife Snowboard is the ultimate board for freestyle riding. Quad Camber and Popster Booster excel at take-offs and landings and the EQ Rad sidecut creates the ideal mix of playfulness and control for riders who building up their skills. Whether you're getting the hang of toeside to heelside transitions or landing every trick in the book, the Huck Knife will reward expert riders while nurturing the skills of ambitious newbies.",
		"image": "1653393639149.jpg",
		"price": "479.95",
		"sized": ["150", "152", "168", "162", "142"],
		"stock": 248,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Carbon, Wood"
	},
	{
		"title": "Ride Kink Snowboard 2023",
		"formattedTitle": "ride-kink-snowboard-",
		"brand": "ride",
		"description": "The park is yours as soon as you strap into the Ride Kink Snowboard. For the most part, its a very traditional freestyle snowboard: a full camber profile, all wood core, symmetrical shape, and beefed up edges. But Ride gives it a little twist in the form of the quadratic sidecut, adding a bit of their signature flair to an exceptionally dependable park deck. It has a smooth flex, plenty of pop, solid edge hold, and intuitive handling for sending jump lines, pressing boxes, and locking onto rails.",
		"image": "1653393643624.jpg",
		"price": "429.95",
		"sized": ["152", "158", "138", "150"],
		"stock": 56,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber",
		"shape": "True Twin",
		"flex_rating": "Soft",
		"core": "Bamboo, Wood"
	},
	{
		"title": "Lib Tech T.Rice Orca Snowboard 2023",
		"formattedTitle": "lib-tech-t.rice-orca-snowboard-",
		"brand": "lib",
		"description": "Picture this: you're a great white shark prowling through the ocean. You've got like five rows of teeth, top and bottom. You're a living, swimming death machine. You're the king of these waters. You're swimming along one day, feeling like just about the baddest thing on the planet, when suddenly, something flashes by below you. You didn't quite catch what it was, just a black shadow. Alas, it was your doom. Teeth tear into you and all thoughts of being the apex predator vanish from your tiny fish brain. Nothing is safe. The entire ocean is just potential prey for the killer whale. Just as mountains are prey for the Lib Tech T.Rice Orca Snowboard. Grab yours: it's feeding time.",
		"image": "1653393647804.jpg",
		"price": "699.99",
		"sized": ["158", "150", "152", "162"],
		"stock": 190,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride, Powder",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Basalt, Wood"
	},
	{
		"title": "CAPiTA Mercury Snowboard 2023",
		"formattedTitle": "capita-mercury-snowboard-",
		"brand": "capita",
		"description": "Now in a smaller size so everyone can feel the joy of the ride, The CAPiTA Mercury Snowboard is the ultimate sidehit hunter, a resort board that refuses to be contained, constrained, or bored. It's happiest when it's accelerating through chunder like a freight train, stable and composed as it laughs in the face of \"tracked out.\" It's drawn to cat track hits and secret stashes, boosting higher and charging harder than is prudent in any situation, tearing into the resort like an out-of-state investor hopped up on cryptocurrency speculation.",
		"image": "1653393651260.jpg",
		"price": "599.95",
		"sized": ["164", "148", "138"],
		"stock": 177,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional Twin",
		"flex_rating": "Stiff",
		"core": "Bamboo, Wood"
	},
	{
		"title": "Sims The Day Snowboard 2022",
		"formattedTitle": "sims-the-day-snowboard-",
		"brand": "sims",
		"description": "The Sims The Day Snowboard is a soft flexing twin that's ideal for all manner of freestyle hi-jinks, from the park to the streets to your local hill. \"M\" Pop camber gives you a super surfy and forgiving feel, and the rocker between you bindings makes it easy to pivot on a dime. This is a great board for learning, progression, and fun, no matter your experience level.",
		"image": "1653393655032.jpg",
		"price": "267.33",
		"sized": ["138", "158", "162", "164", "152", "150"],
		"stock": 39,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Bamboo, Carbon, Wood"
	},
	{
		"title": "Sims STF Snowboard 2022",
		"formattedTitle": "sims-stf-snowboard-",
		"brand": "sims",
		"description": "The Sims STF Snowboard is an aggressive traditional camber board that blurs the line between all-mountain freestyle and big mountain freeride. It's stiff, charges at speed, and loves to soar through the air and rip down the fall line. Plus it's spring loaded, super easy to swing and pivot, and has a nearly symmetrical shape that's balanced and playful in the air. Ride it through powder, the park, and everywhere in between.",
		"image": "1653393658601.jpg",
		"price": "396.65",
		"sized": ["138", "158", "164", "142", "146", "152"],
		"stock": 62,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber",
		"shape": "Directional Twin",
		"flex_rating": "Stiff",
		"core": "Carbon, Wood"
	},
	{
		"title": "Ride Agenda Snowboard 2023",
		"formattedTitle": "ride-agenda-snowboard-",
		"brand": "ride",
		"description": "Simple, smooth, and multi-directional. The Ride Agenda Snowboard is an entry level twin shape with a soft flex, dependable feel, and easy riding characteristics that make it a winner for progression in the park on across the mountain. If you are looking for a board that will have you riding better in no time, and possibly have an eye on the freestyle features, this is the one for you.",
		"image": "1653393662434.jpg",
		"price": "419.95",
		"sized": ["142", "146"],
		"stock": 137,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Beginner-Intermediate",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "True Twin",
		"flex_rating": "Soft",
		"core": "Wood"
	},
	{
		"title": "Ride Manic Snowboard 2023",
		"formattedTitle": "ride-manic-snowboard-",
		"brand": "ride",
		"description": "Despite its name, the Ride Manic Snowboard is as steady as they come. This easy riding directional snowboard is the perfect all-mountain progression machine. It has a smooth flex that bends easily into any turn shape, provides plenty of edge hold thanks to its cambered midsection, and allows for catchless turn initiation thanks to the rockered tip. If you're looking for a board to help you thrive all over the resort, mastering groomers and stepping up to the steeps, the Manic is the magic you've been seeking.",
		"image": "1653393666202.jpg",
		"price": "429.95",
		"sized": ["142", "150", "164", "148"],
		"stock": 105,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Beginner-Intermediate",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional",
		"flex_rating": "Soft",
		"core": "Carbon, Wood"
	},
	{
		"title": "Lib Tech Jamie Lynn Short Wide C3 Snowboard 2023",
		"formattedTitle": "lib-tech-jamie-lynn-short-wide-c3-snowboard-",
		"brand": "lib",
		"description": "The Lib Tech Jamie Lynn Short Wide C3 Snowboard is Jamie's volume shift powder crusher. It's a short, wide, setback ripper that thrives on deep days. But it's still a Jamie Lynn board, so don't expect it to get too directional on you. This thing is crazy easy to spin around, has float for days, and is equally at home speed testing your favorite straightline spot or pivoting through trees and pillows.",
		"image": "1653393669742.jpg",
		"price": "659.99",
		"sized": ["142", "152", "138", "150"],
		"stock": 121,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride, Powder",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "Lib Tech Jamie Lynn C3 Snowboard 2023",
		"formattedTitle": "lib-tech-jamie-lynn-c3-snowboard-",
		"brand": "lib",
		"description": "Jamie Lynn's pro model snowboard is what you get when you take a simple, no-frills design and push it to the limit. The Lib Tech Jamie Lynn C3 Snowboard is a big directional gun that still maintains some subtle skate style park vibes. Unlike many Lib Tech boards, it features plenty of camber and no Magne-Traction. Paired with a stiffer flex, wide nose, and smooth taper in the nose and tail, this board has a predictable, old-school feel that rips hard and takes no prisoners.",
		"image": "1653393673044.jpg",
		"price": "659.99",
		"sized": ["146", "138"],
		"stock": 115,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain, Freeride",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Wood"
	},
	{
		"title": "CAPiTA Mega Split Splitboard 2023",
		"formattedTitle": "capita-mega-split-splitboard-",
		"brand": "capita",
		"description": "Get on that new new, the CAPiTA Mega Split Splitboard is mega light, mega strong, and mega ready for your big time adventures. Inspired by their signature Mercury shape, CAPiTA's latest offering is custom engineered to be featherlight without compromising downhill performance, so your day on the skin track can be just as enjoyable as the shred down. Crafted with a paulownia and poplar 3D Ascend 1 Split Core and a Megalite Skin™ Topsheet, this layup saves weight while retaining the poppiness and solid board feel you love.",
		"image": "1653393676807.jpg",
		"price": "1,499.95",
		"sized": ["138"],
		"stock": 0,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Splitboarding",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Carbon, Wood"
	},
	{
		"title": "K2 Raygun Snowboard 2023",
		"formattedTitle": "k2-raygun-snowboard-",
		"brand": "k2",
		"description": "The K2 Raygun Snowboard is a point-and-shoot all-mountain snowboard for the people. This smooth-flexing directional twin comes with a flat profile for super easy turns and plenty of float. It's very accessible for beginner riders to learn on, but backed with high quality construction and a versatile shape that also makes it perfect for intermediate riders that like to mix it up on a variety of terrain. Wherever your voyage takes you, don't forget to bring your Raygun.",
		"image": "1653393680617.jpg",
		"price": "429.95",
		"sized": ["152", "138", "158", "142", "150", "168"],
		"stock": 245,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Beginner-Intermediate",
		"rocker_type": "Rocker/Flat/Rocker",
		"shape": "Directional Twin",
		"flex_rating": "Medium",
		"core": "Carbon, Wood"
	},
	{
		"title": "CAPiTA Outerspace Living Snowboard 2023",
		"formattedTitle": "capita-outerspace-living-snowboard-",
		"brand": "capita",
		"description": "If your style is \"freeride, but make it fun\", then the CAPiTA Outerspace Living Snowboard is just for you. This all terrain directional twin combines a smidge of setback with a hybrid camber profile that crushes in powder, crud, and variable nonsense from the wrong side of Delta Quadrant. With an all new Certified Multizone Core that boosts strength in high impact areas, this is the ideal deep space vehicle for the would-be astronaut who wants to explore the outer limits.",
		"image": "1653393685743.jpg",
		"price": "449.95",
		"sized": ["164", "152", "158"],
		"stock": 148,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional Twin",
		"flex_rating": "Medium",
		"core": "Aramid (Kevlar®), Carbon, Wood"
	},
	{
		"title": "Lib Tech T.Rice Golden Orca Snowboard 2023",
		"formattedTitle": "lib-tech-t.rice-golden-orca-snowboard-",
		"brand": "lib",
		"description": "Smush two of the finest boards in a generation together and you're bound to make magic. The Lib Tech T.Rice Golden Orca Snowboard is a cross between the \"regular\" Orca and the ripping T.Rice Pro. It's a little more centered, with a new tail profile that makes it better riding switch. Just who's riding pow switch? Well, you are! Takeoffs, landings, pow pillow blastings - everything is possible on this dream machine. Travis Rice approved for taking on the Natural Selection course, the Golden Orca is a Super Mario powerup masquerading as a snowboard.",
		"image": "1653393689679.jpg",
		"price": "799.99",
		"sized": ["138"],
		"stock": 191,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Powder",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Wood"
	},
	{
		"title": "Ride Peace Seeker Snowboard 2023",
		"formattedTitle": "ride-peace-seeker-snowboard-",
		"brand": "ride",
		"description": "Every year we make our pilgrimage. From the low places fit for human habitation, we venture forth to isolated peaks crowned only by jagged rock and gusting snow. Ask each nomad what fuels their journey and you'll get different answers: adrenaline, excitement, comradery, fun. But in one way or another, we're all up there seeking solace. And when we drop down below the peaks, into the bounty that cold winter has whipped up for us, we find a place at the apex of each turn that is free from thought, resistant to distraction, and utterly complete within itself. In pursuit of this voyage to chase the special serenity than can only be found at high speeds and in deep powder, we give you the Ride Peace Seeker Snowboard.",
		"image": "1653393695122.jpg",
		"price": "599.95",
		"sized": ["150"],
		"stock": 230,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freeride, Powder",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Bamboo, Carbon, Wood"
	},
	{
		"title": "Lib Tech Rasman C2 Snowboard 2023",
		"formattedTitle": "lib-tech-rasman-c2-snowboard-",
		"brand": "lib",
		"description": "When powder choked mornings turn to kicker huntin', booter building afternoons, you need a board that can hang in the whole shebang. Lucky for you, the Lib Tech Rasman C2 Snowboard has been overhauled for improved all terrain destruction. The new directional shape has been tweaked with a slightly longer nose and just a smidge of taper for improved float. Don't worry though, this isn't some humorless hunk of 2x4 for the GORE-TEX underwear crowd, the Rasman is still a freestyle maverick capable of sending and stomping with a smile.",
		"image": "1653393698963.jpg",
		"price": "629.99",
		"sized": ["150", "146", "168", "142", "138"],
		"stock": 46,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional Twin",
		"flex_rating": "Medium",
		"core": "Basalt, Wood"
	},
	{
		"title": "K2 Geometric Snowboard 2023",
		"formattedTitle": "k2-geometric-snowboard-",
		"brand": "k2",
		"description": "The world is more than just jibs and kickers. There's also boxes, rails, half pipes, and side hits. Also friendship, community, love and all that stuff. But mostly boxes and rails. Unlock the whole world the moment you strap in to the K2 Geometric Snowboard. It's your key to discovering the joys of the terrain park. And who knows, maybe it'll help you find a bit more friendship and community along the way.",
		"image": "1653393703706.jpg",
		"price": "419.95",
		"sized": ["168", "138"],
		"stock": 102,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle",
		"ability_level": "Beginner-Intermediate",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "Burton Family Tree Hometown Hero Snowboard 2023",
		"formattedTitle": "burton-family-tree-hometown-hero-snowboard-",
		"brand": "burton",
		"description": "If you're the guy whispering in hushed tones about top secret lines, talking in hand signals known only to you and your tightest crew, we have the board for you. The Burton Family Tree Hometown Hero Snowboard is the choice of superlocals, hidden stashers, and all-season slashers. Designed to blast through bunk and lay waste to chunk on its way to the holy land of deep funk, the Hometown Hero is an all-around ripper's ride. A moderately stiff flex and directional camber profile combine with a little taper and a lotta setback for a ride that lays the hammer through pow and crud alike. You're never going to achieve hero status by dinking around: get charging!",
		"image": "1653393708355.jpg",
		"price": "659.95",
		"sized": ["158", "150"],
		"stock": 131,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freeride, Powder",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Carbon, Wood"
	},
	{
		"title": "Burton Custom Snowboard 2023",
		"formattedTitle": "burton-custom-snowboard-",
		"brand": "burton",
		"description": "The Burton Custom Snowboard is quintissential Burton. Pure, unadulterated, triple distilled Burton served up neat - extra chilled. This classic, do-everything shape has attained GOAT status over the years for its sustained brilliance as an all mountain ride. Laid up around a Super Fly™ II 700G core, with woven 45˚ Carbon Highlights in the glass and full Camber for added edge hold and pop, the Custom is all you ever wanted from a daily driver.",
		"image": "1653393711965.jpg",
		"price": "659.95",
		"sized": ["146", "148", "138"],
		"stock": 51,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber",
		"shape": "Directional Twin",
		"flex_rating": "Medium",
		"core": "Carbon, Wood"
	},
	{
		"title": "Burton Process Snowboard 2023",
		"formattedTitle": "burton-process-snowboard-",
		"brand": "burton",
		"description": "You may have gotten your start in the park, but it pays to have a board that's capable of handling it all. The Burton Process Snowboard is a lightweight twin tuned up for kicker building, side-hit hunting all mountain freestylers. Its twin shape and flex combine with a poppy, energetic Super Fly II core for reliable handling in the park and beyond, along with Squeezebox core profiling designed to effectively transfer energy to the extremities for improved stability and snap. When you're ready to showcase your moves all over ther mountain, trust the Process to take care of business.",
		"image": "1653393715416.jpg",
		"price": "549.95",
		"sized": ["168", "150"],
		"stock": 159,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional Twin",
		"flex_rating": "Soft",
		"core": "Wood"
	},
	{
		"title": "Arbor Landmark Camber Splitboard 2023",
		"formattedTitle": "arbor-landmark-camber-splitboard-",
		"brand": "arbor",
		"description": "The Arbor Landmark Camber Splitboard sets the standard for the splitboard makers everywhere: it's an easy-riding board that climbs wonderfully, smashing splitboard barriers before it even sees the snow. A \"value\" board that'll make even the most experienced splitboarders happy, it boasts a floaty yet powerful shape to tackle any conditions you face. The Knucklehead nose stays afloat in everything, from busy bowls of hot pow chowder to flutes of deep dry chalk. Get this board and take a hike!",
		"image": "1653393718894.jpg",
		"price": "699.95",
		"sized": ["158", "162"],
		"stock": 238,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Splitboarding",
		"ability_level": "Beginner-Intermediate",
		"rocker_type": "Camber",
		"shape": "Directional Twin",
		"flex_rating": "Stiff",
		"core": "Wood"
	},
	{
		"title": "Arbor Coda Camber Snowboard 2023",
		"formattedTitle": "arbor-coda-camber-snowboard-",
		"brand": "arbor",
		"description": "In music, a coda wraps up a song. Put a bow on it and lets you know \"we're done here.\" The Arbor Coda Camber Snowboard isn't the end of snowboarding design, but it's pretty dang perfect. This legendary big mountain twin is built from the ground up with sustainable materials and manufacturing processes: recycled steel edges, recycled ABS sidewalls, biodegradable wax, and most notably of all, the Rise Above Plastics topsheet Everything about the Coda is exquisitely crafted for performance, beauty, and sustainability, never sacrificing one for the sake of the other. And that balanced design carries over to the ride characteristics of the Arbor Coda Camber Snowboard. It's a twin shaped board that's a pure joy to ride in any conditions, but particularly shines when brought to play with big snow, big features, and big speed. The End.",
		"image": "1653393722389.jpg",
		"price": "599.95",
		"sized": ["162", "164", "138", "152", "142", "146"],
		"stock": 78,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber",
		"shape": "Directional Twin",
		"flex_rating": "Medium",
		"core": "Bamboo, Wood"
	},
	{
		"title": "Arbor Shiloh Camber Snowboard 2023",
		"formattedTitle": "arbor-shiloh-camber-snowboard-",
		"brand": "arbor",
		"description": "Fed on a steady diet of park features and side hits, a solid freestyle board grew tired of the same old lines down manicured slopes and developed a hunger for more satiating meals. The Arbor Shiloh Camber Snowboard is a big mountain twin, reinforced with bamboo and ready to devour the cliff drops and pow stashes at the grown-ups table. It's fast, stable, and smooth in natural terrain, but it hasn't forgotten its roots either. This full rockered shape is loaded with pop and well-balanced in the air, perfect for your all-mountain freestyle goals.",
		"image": "1653393725932.jpg",
		"price": "549.95",
		"sized": ["148"],
		"stock": 214,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber",
		"shape": "Directional Twin",
		"flex_rating": "Medium",
		"core": "Bamboo, Wood"
	},
	{
		"title": "Arbor Draft Rocker Snowboard 2023",
		"formattedTitle": "arbor-draft-rocker-snowboard-",
		"brand": "arbor",
		"description": "You've found it. That fresh winter rail, that street rider's holy grail. It's sitting beside the steps to your favorite childhood playground and you stand there, ready to jump from the rooftop of a public bathroom and grind down the chipped and faded paint on your new Arbor Draft Rocker Snowboard. Built for freestyle terrain, the Draft's soft flex and lively wood core make this fully rockered twin board a dream in the park. Don't be afraid to eat in front of the neighbor kids or throw your first switch trick. A durable sintered base, fully wrapped sidewalls, and a 3-year warranty provide all the tools you need to make the best out of any snow day, from the street to the sleet.",
		"image": "1653393729448.jpg",
		"price": "449.95",
		"sized": ["138", "168", "142"],
		"stock": 105,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "Arbor Westmark Camber Frank April Snowboard 2023",
		"formattedTitle": "arbor-westmark-camber-frank-april-snowboard-",
		"brand": "arbor",
		"description": "Steamy hot and fresh from the oven, the Arbor Westmark Camber Frank April Snowboard serves up melty freestyle goodness for the whole crew to enjoy. With a new flip tip that provides extra pop and power, This jib board has full rocker for easy skate-style tricks and park riding. It's super stable on rails and landings, pops nollies like a dream, and doesn't mind a fast ride down the runout, no chatter in sight.",
		"image": "1653393733025.jpg",
		"price": "549.95",
		"sized": ["146"],
		"stock": 50,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "Arbor Crosscut Camber Snowboard 2023",
		"formattedTitle": "arbor-crosscut-camber-snowboard-",
		"brand": "arbor",
		"description": "It's camber, baby! But not just any camber, the kind that carves thick lines into groomers and pulls you out of your head and onto the fresh, cold corduroy. The Arbor Crosscut Camber Snowboard knows where it does best, and that's laying down turns that'll make your hands brush the twinkling snowflakes that sit atop those decedent grooves. With plenty of width to float in the fluff and a larger side cut that holds up to high speed turns and technical lines, this affordable resort board is every multi-tasking speed aficionado's dream.",
		"image": "1653393737573.jpg",
		"price": "549.95",
		"sized": ["152", "148", "168", "150", "142", "138"],
		"stock": 244,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride, Powder",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Wood"
	},
	{
		"title": "Arbor Formula Camber Snowboard 2023",
		"formattedTitle": "arbor-formula-camber-snowboard-",
		"brand": "arbor",
		"description": "The best formulas are pretty simple. Peanut butter and jelly, pizza and beer, and there's probably even some non-food combos that are successful. The Arbor Formula Camber Snowboard utilizes one such recipe: an all mountain twin shape, a manageable flex, and a lively core. Pointy swallowtails and pure park boards are great, but take them out of their element and their shine dulls a bit. The Formula leverages decades of real life results and decides not to mess with what works. Pick your size and call it good: your board is going to rip today!",
		"image": "1653393743483.jpg",
		"price": "449.95",
		"sized": ["152", "138", "162", "168"],
		"stock": 157,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber",
		"shape": "Directional Twin",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "Arbor Westmark Rocker Frank April Snowboard 2023",
		"formattedTitle": "arbor-westmark-rocker-frank-april-snowboard-",
		"brand": "arbor",
		"description": "Riding the Arbor Westmark Rocker Frank April Snowboard feels like what would happen if you could take your skateboard down to your favorite point break and start tail sliding the lip of every wave that rolls through. With a redesigned tip and tail profile that provides an even more powerful and poppy ride, the full rocker profile gives it a super flowy feeling, easy turn initiation, and a bit of float when the snow starts falling. But first and foremost, this thing is all about freestyle. The sturdy medium flex pattern makes this a perfect board for all mountain jibbing and park progression, from the park to the street and beyond.",
		"image": "1653393747423.jpg",
		"price": "549.95",
		"sized": ["150", "146"],
		"stock": 100,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "Arbor Formula Rocker Snowboard 2023",
		"formattedTitle": "arbor-formula-rocker-snowboard-",
		"brand": "arbor",
		"description": "The best formulas are pretty simple. Peanut butter and jelly, pizza and beer, and there's probably even some non-food combos that are successful. The Arbor Formula Rocker Snowboard utilizes one such recipe: an all mountain twin shape, a manageable flex, and a lively core. Pointy swallowtails and pure park boards are great, but take them out of their element and their shine dulls a bit. The Formula leverages decades of real life results and decides not to mess with what works. Pick your size and call it good: your board is going to rip today!",
		"image": "1653393751969.jpg",
		"price": "449.95",
		"sized": ["138", "162", "164", "146"],
		"stock": 192,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker",
		"shape": "Directional Twin",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "Arbor Element Camber Snowboard 2023",
		"formattedTitle": "arbor-element-camber-snowboard-",
		"brand": "arbor",
		"description": "Find yourself in that famed sweet spot, comfortably in the pocket, fully in the groove: the Arbor Element Camber Snowboard is like a new friend that you must've known in a past life, instantly familiar. You can keep it casual or push it on this board, thanks to its well-rounded stats. It's surprising in its utility, this is a board that'll hold its own on any day the chairs are running. Periodic tabletops in the park and all-mountain freestyle synthesis are completely within the Element's realm.",
		"image": "1653393756891.jpg",
		"price": "499.95",
		"sized": ["168"],
		"stock": 90,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber",
		"shape": "Directional Twin",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "Arbor Clovis Camber Snowboard 2023",
		"formattedTitle": "arbor-clovis-camber-snowboard-",
		"brand": "arbor",
		"description": "Grab your toothpicks, its Mark Carter time. The Arbor Clovis Camber Snowboard is the Wyoming cowboy's trusty six-shooter, and oh boy does it pack a punch. Arbor bills this snowboard as a \"directional gun,\" and we'd have to agree. With an oversized nose, tapered tail, and bamboo and carbon reinforcements, the Clovis wants to be pointed off something big and land in something soft. It rips, pops, and slashes, and as long as you can hang on for the ride, you're in for one heck of a time.",
		"image": "1653393761000.jpg",
		"price": "599.95",
		"sized": ["158"],
		"stock": 17,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freeride, Powder",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Bamboo, Carbon, Wood"
	},
	{
		"title": "Arbor Bryan Iguchi Pro Camber Snowboard 2023",
		"formattedTitle": "arbor-bryan-iguchi-pro-camber-snowboard-",
		"brand": "arbor",
		"description": "Just because the Arbor Bryan Iguchi Pro Camber Snowboard is a big mountain masterpiece doesn't mean it's not also capable of crushing the mini-golf course. Developed as a daily driver for the legend himself, this directional board is at home in the steeps, deeps, and drops characteristic of the Teton range, but can also be ridden around easily at the end of a long day. It's a rideable powder board for those of us not as blessed to live in such a consistently snowy locale, and provides controllable power for charging through terrain - regardless of snow depth. It hammers down fall lines and stomps landings, yet remains forgiving and nimble in tight terrain or playful features. Mountain riders looking for a do it all ride: take a cue from the Guch",
		"image": "1653393764841.jpg",
		"price": "649.95",
		"sized": ["152", "146", "162"],
		"stock": 2,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride, Powder",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Bamboo, Wood"
	},
	{
		"title": "Arbor Shiloh Rocker Snowboard 2023",
		"formattedTitle": "arbor-shiloh-rocker-snowboard-",
		"brand": "arbor",
		"description": "Fed on a steady diet of park features and side hits, a solid freestyle board grew tired of the same old lines down manicured slopes and developed a hunger for more satiating meals. The Arbor Shiloh Rocker Snowboard is a big mountain twin, reinforced with bamboo and ready to devour the cliff drops and pow stashes at the grown-ups table. It's fast, stable, and smooth in natural terrain, but it hasn't forgotten its roots either. This full rockered shape is loaded with pop and well-balanced in the air, perfect for your all-mountain freestyle goals.",
		"image": "1653393769539.jpg",
		"price": "549.95",
		"sized": ["150", "138"],
		"stock": 227,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker",
		"shape": "Directional Twin",
		"flex_rating": "Medium",
		"core": "Bamboo, Wood"
	},
	{
		"title": "Jones Stratos Splitboard 2023",
		"formattedTitle": "jones-stratos-splitboard-",
		"brand": "jones",
		"description": "We love the Stratos, and we love the backcountry. Ergo, we love the Jones Stratos Splitboard. This all new split brings the same do anything, go anywhere energy of the solid to an altogether larger alpine canvas. It combines a directional shape with freestyle board feel for an insanely versatile hybrid shape that's just as comfortable arcing perfect carves as it is slashing pow turns and buttering off backcountry booters. Laid up with Jones' finest tech for optimal performance on the skin track and descent alike, this board will revolutionize your approach to touring.",
		"image": "1653393773751.jpg",
		"price": "949.95",
		"sized": ["142", "164", "138", "158", "150"],
		"stock": 21,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Splitboarding",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Basalt, Wood"
	},
	{
		"title": "GNU Airblaster Gremlin Collab Snowboard 2022",
		"formattedTitle": "gnu-airblaster-gremlin-collab-snowboard-",
		"brand": "gnu",
		"description": "If you're serious about fun, get the the GNU Airblaster Gremlin Collab Snowboard on your radar pronto. This deck is built for mountain mischief of the highest order, incorporating a nimble volume shifted design with a lightweight wood core and poppy C3 camber for bomber freeride performance. It'll hang on everything from sketchy ice wall straightlines to laid back hippy pow surf sessions, and it's a blast to whip around in the trees. This limited edition model lays the style on thick with an exclusive Airblaster collab topsheet. There were some additional instructions about feeding it before midnight, or after midnight - we don't exactly remember but we're sure you'll be fine.",
		"image": "1653393778620.jpg",
		"price": "559.99",
		"sized": ["138", "168", "164", "148"],
		"stock": 17,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freeride, Powder",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Wood"
	},
	{
		"title": "GNU Head Space Worble Edition Snowboard 2022",
		"formattedTitle": "gnu-head-space-worble-edition-snowboard-",
		"brand": "gnu",
		"description": "If you're one of the folks who needs to think about their entire life before dropping in, consider getting the GNU Head Space Worble Edition Snowboard to quiet your mind. Featuring asymmetric construction, Magne-Traction edges, and signature C3 camber, this comp-level jib machine will boost your confidence and progression in the park and beyond. This model comes in hot with an exlusive Worble collab topsheet to rep the board sport love extra hard.",
		"image": "1653393782199.jpg",
		"price": "559.99",
		"sized": ["150", "158", "168", "162"],
		"stock": 25,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Asymmetrical, True Twin",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "Ride Burnout Snowboard 2023",
		"formattedTitle": "ride-burnout-snowboard-",
		"brand": "ride",
		"description": "The Ride Burnout Snowboard is a mean machine that takes to the park or the streets with equal vigor. This board is all about dialed simplicity. A linear sidecut, true twin shape, medium flex, and tons of camber spell out all around excellence in freestyle performance. For this classic ripper, Ride has backed up the traditional design with oversized edges built to take a beating, a speedy sintered base, and an array of carbon fibers designed to increase pop and dampen harsh landings.",
		"image": "1653393786164.jpg",
		"price": "579.95",
		"sized": ["138", "142"],
		"stock": 61,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Bamboo, Wood"
	},
	{
		"title": "Arbor Coda Rocker Splitboard 2023",
		"formattedTitle": "arbor-coda-rocker-splitboard-",
		"brand": "arbor",
		"description": "The Arbor Coda Rocker Splitboard brings the legendary versatility and performance of the Coda to the backcountry. Based on a design that's earned renown for its ability to handle varied conditions with ease, this split guarantees confidence in whatever you find beyond the resort boundaries. Arbor's System Rocker profile is easy to turn in challenging snow and excellent in soft snow, the lightweight construction ideal for flying up the skin track and down your favorite line.",
		"image": "1653393789628.jpg",
		"price": "799.95",
		"sized": ["150", "146", "142"],
		"stock": 92,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Splitboarding",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker",
		"shape": "Directional Twin",
		"flex_rating": "Stiff",
		"core": "Carbon, Wood"
	},
	{
		"title": "Arbor Element Rocker Snowboard 2023",
		"formattedTitle": "arbor-element-rocker-snowboard-",
		"brand": "arbor",
		"description": "Find yourself in that sweet spot, comfortably in the pocket, fully in the groove: the Arbor Element Rocker Snowboard is like a new friend that you must've known in a past life, instantly at home everywhere. You can keep it casual or push it on this board, thanks to its well-rounded stats. It's surprising in its utility, this is a board that'll hold its own on any day the chairs are running. Periodic tabletops in the park and all-mountain freestyle synthesis are completely within the Element's realm.",
		"image": "1653393794400.jpg",
		"price": "499.95",
		"sized": ["142", "138", "150", "148", "152"],
		"stock": 104,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker",
		"shape": "Directional Twin",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "Burton Name Dropper Snowboard 2022",
		"formattedTitle": "burton-name-dropper-snowboard-",
		"brand": "burton",
		"description": "You're uhhh, kind of a big deal. A big time hucker with the clips to prove it. That's why you need a board built for the park, by the park. The Burton Name Dropper Snowboard revolves around Burton's Off-Axis shapes, meaning everything from the edges to the core profile has been crafted with an open park stance for full symmetry and optimal freestyle performance. It's not who know but how you shred, after all.",
		"image": "1653393798800.jpg",
		"price": "403.71",
		"sized": ["138", "142", "168", "162"],
		"stock": 224,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "True Twin",
		"flex_rating": "Soft",
		"core": "Wood"
	},
	{
		"title": "Arbor Annex Camber Snowboard 2023",
		"formattedTitle": "arbor-annex-camber-snowboard-",
		"brand": "arbor",
		"description": "The Arbor Annex Camber Snowboard will spark your synapses and have you blurting out superlatives. Rider-created graphics rule. Bryan Iguchi really loves quality snowboards and his inspiration serves the sport and its partners-in-shred quite well. And, oh dang, Carbon Vector Netting, responsive camber, and a premium Sintered Pus Base! All of these make the Arbor Annex Camber Snowboard a seriously rad board. Come out of the woodwork and explore a little. Or, better yet, explore a lot.",
		"image": "1653393803443.jpg",
		"price": "699.95",
		"sized": ["138", "152", "142", "158", "148"],
		"stock": 103,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride, Powder",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Bamboo, Wood"
	},
	{
		"title": "Arbor Coda Camber Splitboard 2023",
		"formattedTitle": "arbor-coda-camber-splitboard-",
		"brand": "arbor",
		"description": "The Arbor Coda Camber Splitboard brings the legendary versatility and performance of the Coda to the backcountry. Based on a design that's earned renown for its ability to handle varied conditions with ease, this split guarantees confidence in whatever you find beyond the resort boundaries. Arbor's System Camber profile provides grip and stability for firm snow and technical terrain, and the snappy, lightweight construction allows for a fun and playful ride when the conditions are ripe.",
		"image": "1653393807089.jpg",
		"price": "799.95",
		"sized": ["158", "142", "148", "152"],
		"stock": 65,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Splitboarding",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber",
		"shape": "Directional Twin",
		"flex_rating": "Stiff",
		"core": "Carbon, Wood"
	},
	{
		"title": "Arbor Satori Camber Snowboard 2023",
		"formattedTitle": "arbor-satori-camber-snowboard-",
		"brand": "arbor",
		"description": "The Arbor Satori Camber Snowboard is one of Bryan Iguchi's love children. Made in short lengths for pow lovers, its freestyle oriented and has a deep sidecut for frothy carves. Paired with a medium flex and a stable tail, the Satori Camber is a wonderful choice for anyone looking for a friendly and approachable deep day destroyer that's extra fun. Imagine sitting around a fire with your best friends sipping drinks and laughing; that's what the Satori evokes, and we bet Iguchi is extra proud.",
		"image": "1653393810306.jpg",
		"price": "649.95",
		"sized": ["146"],
		"stock": 188,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride, Powder",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Bamboo, Wood"
	},
	{
		"title": "Arbor Relapse Snowboard 2023",
		"formattedTitle": "arbor-relapse-snowboard-",
		"brand": "arbor",
		"description": "Made in collaboration with evo Ambassador Erik Leon, the Arbor Relapse Snowboard is a park board for the people. This is a pro-caliber deck built to handle Erik's blend of park, street, and freestyle riding, but true to the mission of his C.O.R.E. Initiative, it's also super accessible for a wide range of riders. The soft flex and durable construction that do so well in the park also make it an easy board to learn to ride on, and the relatively modest price tag offers unbeatable value.",
		"image": "1653393813671.jpg",
		"price": "449.95",
		"sized": ["152", "138", "142", "164"],
		"stock": 240,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "Nidecker Merc Snowboard 2023",
		"formattedTitle": "nidecker-merc-snowboard-",
		"brand": "nidecker",
		"description": "The Nidecker Merc Snowboard won't help you cruise the Autobahn at 150mph, but when it comes to all mountain progression it's all systems go. Combining a smooth-riding Master Core with an easygoing Standard CamRock profile for fluid turn initiation and a forgiving feel, this board instills confidence from day one - perfect for riders growing their skillset and sliding into ever more challenging terrain.",
		"image": "1653393818532.jpg",
		"price": "399.95",
		"sized": ["150"],
		"stock": 184,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional Twin",
		"flex_rating": "Medium",
		"core": "Aramid (Kevlar®), Carbon, Wood"
	},
	{
		"title": "Arbor Wasteland Camber Snowboard 2023",
		"formattedTitle": "arbor-wasteland-camber-snowboard-",
		"brand": "arbor",
		"description": "If you can pick your jaw back up off the snow, the Arbor Wasteland Camber Snowboard delivers a seriously fun ride in any terrain you can find. The 4-point System Camber provides composure at speed, confidence on the steeps, and fat stacks of grip and edge-hold for deep, fast carves on firm snow. Laid up with a stunning powerply inlay featuring Black Dyed Ash, Red Elm, and Palisander wood, this is an all timer for the slopes and mantlepiece alike.",
		"image": "1653393821888.jpg",
		"price": "699.95",
		"sized": ["148", "150", "152", "138", "168", "162"],
		"stock": 17,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber",
		"shape": "Directional Twin",
		"flex_rating": "Stiff",
		"core": "Carbon, Wood"
	},
	{
		"title": "Arbor Landmark Rocker Splitboard 2023",
		"formattedTitle": "arbor-landmark-rocker-splitboard-",
		"brand": "arbor",
		"description": "The Arbor Landmark Rocker Splitboard sets the standard for the splitboard makers everywhere: it's an easy-riding board that climbs wonderfully, smashing splitboard barriers before it even sees the snow. A \"value\" board that'll make even the most experienced splitboarders happy, it boasts a floaty yet powerful shape to tackle any conditions you face. The Knucklehead nose stays afloat in everything, from busy bowls of hot pow chowder to flutes of deep dry chalk. Get this board and take a hike!",
		"image": "1653393825276.jpg",
		"price": "699.95",
		"sized": ["138", "146", "150", "168"],
		"stock": 207,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Splitboarding",
		"ability_level": "Beginner-Intermediate",
		"rocker_type": "Rocker",
		"shape": "Directional Twin",
		"flex_rating": "Stiff",
		"core": "Wood"
	},
	{
		"title": "Arbor Coda Rocker Snowboard 2023",
		"formattedTitle": "arbor-coda-rocker-snowboard-",
		"brand": "arbor",
		"description": "In music, a coda wraps up a song. Put a bow on it and lets you know \"we're done here.\" The Arbor Coda Rocker Snowboard isn't the end of snowboarding design, but it's pretty dang perfect. This legendary big mountain twin is built from the ground up with sustainable materials and manufacturing processes: recycled steel edges, recycled ABS sidewalls, biodegradable wax, and most notably of all, the Rise Above Plastics topsheet Everything about the Coda is exquisitely crafted for performance, beauty, and sustainability, never sacrificing one for the sake of the other. And that balanced design carries over to the ride characteristics of the Arbor Coda Rocker Snowboard. It's a twin shaped board that's a pure joy to ride in any conditions, but particularly shines when brought to play with big snow, big features, and big speed. Available in Camber and Rockered Versions. The End.",
		"image": "1653393828881.jpg",
		"price": "599.95",
		"sized": ["152", "138", "162"],
		"stock": 152,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber",
		"shape": "Directional Twin",
		"flex_rating": "Medium",
		"core": "Bamboo, Wood"
	},
	{
		"title": "Jones Aviator 2.0 Snowboard 2022",
		"formattedTitle": "jones-aviator-2.0-snowboard-",
		"brand": "jones",
		"description": "The Jones Aviator 2.0 Snowboard is an all-mountain deck for the hard charging rider. It uses a space-age Koroyd core to provide burly flex and dampening with crazy low weight, and a full camber profile for unparalleled hard snow performance. With the snowboard industry trending more and more toward volume shifted, highly directional shapes, this throwback design with futuristic construction is a bit of an anomaly. But it's an anomaly you have to ride to believe. Incredible response, monster pop, and dialed precision are yours to command whenever you strap in.",
		"image": "1653393832594.jpg",
		"price": "599.95",
		"sized": ["138", "148", "142", "150", "162", "146"],
		"stock": 22,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber",
		"shape": "Directional Twin",
		"flex_rating": "Stiff",
		"core": "Bamboo, Cork, Koroyd®"
	},
	{
		"title": "Arbor Cosa Nostra Rocker Snowboard 2023",
		"formattedTitle": "arbor-cosa-nostra-rocker-snowboard-",
		"brand": "arbor",
		"description": "Smooth pow-pow riding with looks to kill for? You bet. The Arbor Cosa Nostra Snowboard and its beautiful woodsy aesthetic has a 2:1 nose to tail length for smooth freshie fun and for surfy turns like a hot knife through butter. Its riding position is shifted towards the rear for better weight distribution to keep the nose up when the snow is super soft, and its sintered base is super fast and slippery so you can to the goods without interruption. It can't always be a powder day, but when it is, the Arbor Cosa Nostra Snowboard is the one you want under your feet.",
		"image": "1653393836220.jpg",
		"price": "599.95",
		"sized": ["164", "138", "148", "158"],
		"stock": 235,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freeride, Powder",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Bamboo, Wood"
	},
	{
		"title": "Arbor Wasteland Rocker Snowboard 2023",
		"formattedTitle": "arbor-wasteland-rocker-snowboard-",
		"brand": "arbor",
		"description": "If you can pick your jaw back up off the snow, the Arbor Wasteland Rocker Snowboard delivers a seriously fun ride in any terrain you can find. The 4-point System Camber provides composure at speed, confidence on the steeps, and fat stacks of grip and edge-hold for deep, fast carves on firm snow. Laid up with a stunning powerply inlay featuring Black Dyed Ash, Red Elm, and Palisander wood, this is an all timer for the slopes and mantlepiece alike.",
		"image": "1653393839588.jpg",
		"price": "699.95",
		"sized": ["138"],
		"stock": 158,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber",
		"shape": "Directional Twin",
		"flex_rating": "Stiff",
		"core": "Carbon, Wood"
	},
	{
		"title": "Lib Tech Lost Retro Ripper C3 Snowboard 2023",
		"formattedTitle": "lib-tech-lost-retro-ripper-c3-snowboard-",
		"brand": "lib",
		"description": "Negative space is a powerful tool for artists and designers to harness. The same goes for snowboarders - slap a swallowtail on your board and you create magic exactly where the board ceases to exist. The Lib Tech Lost Retro Ripper C3 Snowboard is a case in point, a powder hungry carving enthusiast that defies easy labels. The huge, floaty nose and deep swallotail combine with a new elliptical deep sidecut to help you plunder pow, grafiti clean cord with big, filthy arcs, and surf until your legs turn to jelly. An instant classic.",
		"image": "1653393843786.jpg",
		"price": "699.99",
		"sized": ["168", "138", "148", "158"],
		"stock": 148,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freeride, Powder",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "Arbor Satori Camber Splitboard 2023",
		"formattedTitle": "arbor-satori-camber-splitboard-",
		"brand": "arbor",
		"description": "Tailored to pro rider Bryan Iguchi's humility mindset and gnarly uphill approach, the Arbor Satori Camber Splitboard has a deep sidecut for reactive grip climbing and fast edge to edge turning when you're groovin' downhill. Constructed with Arbor's signature System Camber Technology and Uprise Fenders, the Satori is solid, approachable, and made to make you feel alive. Get out on the skin track in any condition imaginable, the Arbor Satori Camber Splitboard is made to handle it all and make you feel amazing while doing it.",
		"image": "1653393847243.jpg",
		"price": "849.95",
		"sized": ["152", "148"],
		"stock": 103,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Splitboarding",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Bamboo, Wood"
	},
	{
		"title": "Nidecker Alpha Snowboard 2023",
		"formattedTitle": "nidecker-alpha-snowboard-",
		"brand": "nidecker",
		"description": "What if your snowboard could launch from the snow like a bird of prey? What if it could slice through deep pow like a dolphin moving through the waves? For Nidecker, the answer lies in Biomimicry: incorporating shapes found in the natural world, and strategies honed over millennia through natural selection. It could mean learning from the structure of a bird’s wing in flight and applying the same principles to optimize lift and float, or analyzing the morphology of a penguin's stomach for a more fluid edge to edge feel. If it sounds simultaneously groundbreaking and obvious - as if the answer was staring us in the face all along - that's because it is. The Nidecker Alpha Snowboard is the playful member of the new Instinct family, blending all mountain freestyle with a loose and surfy feel that allows you to take flight at any moment.",
		"image": "1653393851143.jpg",
		"price": "479.95",
		"sized": ["150", "152", "146", "138"],
		"stock": 76,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional Twin",
		"flex_rating": "Medium",
		"core": "Aramid (Kevlar®), Carbon, Wood"
	},
	{
		"title": "CAPiTA Spring Break Powder Racer Splitboard 2023",
		"formattedTitle": "capita-spring-break-powder-racer-splitboard-",
		"brand": "capita",
		"description": "The CAPiTA Spring Break Powder Racer Splitboard takes one of the finest pow boards in the game and hucks it through the bandsaw for some uphill action. It's got all the classic surfboard-inspired features of Corey Smith's Spring Break shapes: a big ol' nose, a wide waist, and a squash-tail to float through the fluff, combined with Capita's new Surf Camber profile. The result is a split that floats effortlessly in powder but won't let you down on firmer ground. Rounded out with Union Expedition skins and clip hardware, this is a grab and go package designed to go the distance.",
		"image": "1653393854869.jpg",
		"price": "999.95",
		"sized": ["158", "138", "162", "142"],
		"stock": 38,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Splitboarding",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Carbon, Flax, Wood"
	},
	{
		"title": "CAPiTA Spring Break Powder Glider Snowboard 2023",
		"formattedTitle": "capita-spring-break-powder-glider-snowboard-",
		"brand": "capita",
		"description": "If the words \"Ultralight Powder Displacement Snowcraft\" don't immediately get you hyped, you may want to check your pulse for signs of life. This surf-inspired series is designed for zero gravity float in the deepest pow known to humankind. That's 3 different shapes - each one laid up with top shelf tech that offers a slightly different route to your next Winter dopamine hit. The CAPiTA Spring Break Powder Glider Snowboard combines a girthy waist with a deep swallowtail and tapered tip for an agile ride that belies its length. When the going gets deep, this is the board you want under your feet.",
		"image": "1653393859150.jpg",
		"price": "899.95",
		"sized": ["158", "168"],
		"stock": 15,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Powder",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Flat/Rocker",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Carbon, Wood"
	},
	{
		"title": "CAPiTA Spring Break Diamond Tail Snowboard 2023",
		"formattedTitle": "capita-spring-break-diamond-tail-snowboard-",
		"brand": "capita",
		"description": "If the words \"Ultralight Powder Displacement Snowcraft\" don't immediately get you hyped, you may want to check your pulse for signs of life. This surf-inspired series is designed for zero gravity float in the deepest pow known to humankind. That's 3 different shapes - each one laid up with top shelf tech that offers a different route to your next Winter dopamine hit. The CAPiTA Spring Break Diamond Tail Snowboard comes directly from surfing hall of fame with a unique design that pairs the speed and drive of a square tail with the added maneuverability of a rounder tail shape. If you're looking for something to squeeze the juice out of your pow days, this is the one.",
		"image": "1653393863152.jpg",
		"price": "899.95",
		"sized": ["148", "142", "162", "138", "146", "158"],
		"stock": 41,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Powder",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Flat/Rocker",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Carbon, Wood"
	},
	{
		"title": "CAPiTA NEO Slasher Splitboard 2023",
		"formattedTitle": "capita-neo-slasher-splitboard-",
		"brand": "capita",
		"description": "For the human-powered maniac who earns their turns, a board like the CAPiTA NEO Slasher Splitboard is nothing less than a godsend. Simple, durable, and high performance without the price-tag to match, this lightweight split features a setback stance and a tapered directional shape for effortless turns in pow and chunder alike with an all new Ascend 2 Split Core engineered to deliver maximum energy and strength. Upgraded with Union clip hardware, this split remains a solid choice for backcountry riders of all stripes.",
		"image": "1653393867754.jpg",
		"price": "799.95",
		"sized": ["158"],
		"stock": 92,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Splitboarding",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Carbon, Flax, Wood"
	},
	{
		"title": "CAPiTA Spring Break Powder Pill Snowboard 2023",
		"formattedTitle": "capita-spring-break-powder-pill-snowboard-",
		"brand": "capita",
		"description": "If the words \"Ultralight Powder Displacement Snowcraft\" don't immediately get you hyped, you may want to check your pulse for signs of life. This surf-inspired series is designed for zero gravity float in the deepest pow known to humankind. That's 3 different shapes - each one laid up with top shelf tech that offers a different route to your next Winter dopamine hit. The CAPiTA Spring Break Powder Pill Snowboard features a rounded tail with a fun, effortlessly floaty personality. Pop it out on big open faces and throw up some white waves, this deck is ready to go.",
		"image": "1653393871322.jpg",
		"price": "899.95",
		"sized": ["162", "138", "142", "158"],
		"stock": 107,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Powder",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Flat/Rocker",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Carbon, Wood"
	},
	{
		"title": "CAPiTA Spring Break Slush Slasher 2.0 Snowboard 2023",
		"formattedTitle": "capita-spring-break-slush-slasher-2.0-snowboard-",
		"brand": "capita",
		"description": "The CAPiTA Spring Break Slush Slasher 2.0 Snowboard doesn't do \"serious\", and it doesn't think you should either. This playful little deck is the heart and soul of the entire Spring Break line, designed to be ridden with your tongue planted firmly in your cheek and a huge smile plastered across your face. The latest model has been redesigned from the ground up with a deeper, carvier sidecut and a new Surf Camber profile that improves freestyle versatility. Slap your bindings on, set phasers to DGAF, and go have some fun, dang it!",
		"image": "1653393875999.jpg",
		"price": "429.95",
		"sized": ["148"],
		"stock": 181,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Powder",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Flat/Rocker",
		"shape": "Directional",
		"flex_rating": "Soft",
		"core": "Wood"
	},
	{
		"title": "CAPiTA Spring Break Powder Twin Snowboard 2023",
		"formattedTitle": "capita-spring-break-powder-twin-snowboard-",
		"brand": "capita",
		"description": "If \"CAPiTA Spring Break Powder Twin Snowboard\" sounds like the answer to your prayers right off the bat, you should probably listen to your gut. This pow-hungry freestyler keeps the extra wide waist, the tight, carvey turn radius, and gentle Surf Camber profile of its Spring Break brethren, but packages them together in a Twin shape that's perfect for playful powder riding. The latest model comes with upgraded Carbon V-Tech Amplifiers for lightweight power and response. Build that backcountry booter and get to work on your backside three, the Powder Twin is ready to rumble.",
		"image": "1653393880863.jpg",
		"price": "549.95",
		"sized": ["138", "142", "164"],
		"stock": 48,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, Powder",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Basalt, Wood"
	},
	{
		"title": "CAPiTA Spring Break Powder Racer Snowboard 2023",
		"formattedTitle": "capita-spring-break-powder-racer-snowboard-",
		"brand": "capita",
		"description": "The CAPiTA Spring Break Powder Racer Snowboard is a bit of a misnomer, because this thing ain't no one trick pony. Sure, it's got all the classic surfboard-inspired features of Corey Smith's Spring Break shapes: a big ol' nose, a wide waist, and a squash-tail to float through the fluff. But the new model gets Capita's new Surf Camber profile, combining camber underfoot with heavy rocker at the tip and tail. The result is board that floats effortlessly in powder but also rails like a champ on groomers and hardpack. You'll be hard pressed to switch this one out, may as well leave the bindings on all season long!",
		"image": "1653393884625.jpg",
		"price": "599.95",
		"sized": ["164"],
		"stock": 81,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Powder",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Flat/Rocker",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Aramid (Kevlar®), Cork, Flax, Wood"
	},
	{
		"title": "Bataleon Evil Twin Snowboard 2023",
		"formattedTitle": "bataleon-evil-twin-snowboard-",
		"brand": "bataleon",
		"description": "Everyone has a doppleganger but none of us want to run into these bad luck harbingers. The Bataleon Evil Twin Snowboard is the one alter ego you'll be happy you found, thanks to 3BT™ uplifted sidebases and medium camber that will absolutely destroy competition in the park. The carbon Central Super Tube and lightweight core are snappy and lightweight for maximum air and the medium flex is versatile enough to bop around the rest of the mountain when you want to hit some natural features. It's the classic Bataleon board that just gets better with age.",
		"image": "1653393889045.jpg",
		"price": "559.95",
		"sized": ["138", "164", "168", "142", "162", "148"],
		"stock": 13,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Carbon, Wood"
	},
	{
		"title": "Arbor Bryan Iguchi Pro Camber Splitboard 2023",
		"formattedTitle": "arbor-bryan-iguchi-pro-camber-splitboard-",
		"brand": "arbor",
		"description": "There are few snowboarders whose names are as synonymous with backcountry riding as Bryan Iguchi. One of the OG legends of the big mountain scene, the Guch can often be found in his backyard of Grand Teton National Park looking for big lines far removed from chairlifts and crowds, and he does it all on the Arbor Bryan Iguchi Pro Camber Splitboard. This split is built to handle the most technical terrain around, and earns its trust on everything from mid winter powder laps to late season volcano missions. It's confidence inspiring, powerful, and fun, and simply one of the best backcountry setups you get hop onto, period.",
		"image": "1653393893732.jpg",
		"price": "849.95",
		"sized": ["148", "138"],
		"stock": 70,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Splitboarding",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Wood"
	},
	{
		"title": "CAPiTA Kazu Kokubo Pro Snowboard 2023",
		"formattedTitle": "capita-kazu-kokubo-pro-snowboard-",
		"brand": "capita",
		"description": "Only one person gets to be Kazu Kokubo, but everyone can get a board inspired by Kazu's legendary powder slashing, full-send, what-did-I-just-see style. Combining a compact chassis, a powder-hungry reverse camber nose, and a tapered tail, his signature board is a one way ticket to the white room - an altered state of mind in physical form. The new model has been updated with an ultra lightweight, bamboo powered Panda Hover Core Ultra backed up by Aplitex V-Tex stringers, meaning it has the chops to keep charging once the resort gets tracked out.",
		"image": "1653393898581.jpg",
		"price": "649.95",
		"sized": ["152", "146", "142"],
		"stock": 217,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freeride, Powder",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Bamboo, Carbon, Flax, Wood"
	},
	{
		"title": "CAPiTA The Outsiders Snowboard 2023",
		"formattedTitle": "capita-the-outsiders-snowboard-",
		"brand": "capita",
		"description": "The little voice inside your head telling you to pin it towards the lip of that monster jump without scrubbing your speed? It's the CAPiTA The Outsiders Snowboard. Engineered with traditional camber and a boatload of tech, this is a confidence inspiring board that's thirsty for high speed and huge stomps. It's got tons of pop, stability, and responsiveness, and comes updated with all-new Aramid Body Armor for improved vibration dampening and strength in high-pressure zones. Go big, go fast: listen to The Outsider!",
		"image": "1653393902203.jpg",
		"price": "579.95",
		"sized": ["152", "148", "150", "168", "146"],
		"stock": 54,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Flat/Camber/Flat",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Aramid (Kevlar®), Flax, Wood"
	},
	{
		"title": "CAPiTA Pathfinder Camber Snowboard 2023",
		"formattedTitle": "capita-pathfinder-camber-snowboard-",
		"brand": "capita",
		"description": "The CAPiTA Pathfinder Camber Snowboard is an all action, no frills option that strips snowboarding down to the bare bones: human + board + gravity = fun. Let loose on man-made and natural features alike with a throwback blunted shape that cuts swing weight for aerial maneuvers and slides on metal, concrete, or wood. This version features traditional camber for reliable edge control and a responsive, poppy feel.",
		"image": "1653393906797.jpg",
		"price": "429.95",
		"sized": ["152", "168", "158", "138", "150"],
		"stock": 173,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "CAPiTA Pathfinder Reverse Snowboard 2023",
		"formattedTitle": "capita-pathfinder-reverse-snowboard-",
		"brand": "capita",
		"description": "The CAPiTA Pathfinder Reverse Snowboard is an all action, no frills option that strips snowboarding down to the bare bones: human + board + gravity = fun. Let loose on man-made and natural features alike with a throwback blunted shape that cuts swing weight for aerial maneuvers and slides on metal, concrete, or wood. This version features reverse camber for a skate-like feel that floats like a butterfly and turns on a dime.",
		"image": "1653393910504.jpg",
		"price": "429.95",
		"sized": ["148", "168", "150", "142", "162"],
		"stock": 75,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "CAPiTA Navigator Snowboard 2023",
		"formattedTitle": "capita-navigator-snowboard-",
		"brand": "capita",
		"description": "Human being straps into mysterious alien craft and travels through a dazzling wormhole that bends time and space. No, it's not the plot of 1986 science fiction movie, Flight of the Navigator, it's a blow by blow account of your first run on the CAPiTA Navigator Snowboard. This powder hungry freerider combines a tapered directional shape and super set back stance for hoverboard-esque performance in deep snow. Newly updated with a poppy P2 Superlight Core and Powerdrive Base capable of achieving warp speeds, the Navigator is worthy of a spot in any quiver.",
		"image": "1653393915001.jpg",
		"price": "499.95",
		"sized": ["148", "138", "142", "152", "168", "164"],
		"stock": 190,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freeride, Powder",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Carbon, Wood"
	},
	{
		"title": "CAPiTA Ultrafear Snowboard 2023",
		"formattedTitle": "capita-ultrafear-snowboard-",
		"brand": "capita",
		"description": "Don't let the name put you off, the CAPiTA Ultrafear Snowboard is pretty dang friendly once you've been properly introduced. If anything, it's made to celebrate that little hit of fear that makes you feel alive and keeps you on your toes. Featuring a cork edge dampening system and Carbon Kevlar Body Armor, this tough, resiliant freestyle board can take a lickin' and keep on tickin'. Do your worst in the park and take it to the streets, the Ultrafear will keep the stoke flowing freely.",
		"image": "1653393919644.jpg",
		"price": "499.95",
		"sized": ["158", "162", "164"],
		"stock": 66,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Flat/Rocker",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Aramid (Kevlar®), Cork, Metal, Wood"
	},
	{
		"title": "CAPiTA Scott Stevens Pro Snowboard 2023",
		"formattedTitle": "capita-scott-stevens-pro-snowboard-",
		"brand": "capita",
		"description": "Your riding cannot be confined to mere mountains. Your riding is like physical bebop - it flows where the snow goes, and sometimes that means down the stairs and rails of your old middle school. If you need an instrument to match your own wild and creative energy, you'll want to make the CAPiTA Scott Stevens Pro Snowboard your saxophone. This board is all kinds of wacky and creative out of the box - beeps and bonks, squawks and squeels, traditional time signatures be damned! It uses innovative cork edge dampening and carbon fiber stringers for lightweight durability, and a poppy P2 Superlight Core that turns it into a maniac, jibby pogo stick of a snowboard. It's time to make some music together!",
		"image": "1653393923173.jpg",
		"price": "529.95",
		"sized": ["162", "146", "150", "142"],
		"stock": 150,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Flat/Rocker",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Aramid (Kevlar®), Carbon, Cork, Flax, Wood"
	},
	{
		"title": "Rossignol Circuit Snowboard 2022",
		"formattedTitle": "rossignol-circuit-snowboard-",
		"brand": "rossignol",
		"description": "Just learning the ropes? Check out the Rossignol Circuit Snowboard. It's made with Rossignol's Auto Turn rocker, for user-friendly float and no-catch edge control, so you can learn to turn with ease. A soft flex makes for forgiving landings, and a directional profile keeps you pointed downhill no matter what. Last but not least, the energetic full wood core acts like a rechargeable battery, providing you with the durability and performance you need to progress.",
		"image": "1653393927577.jpg",
		"price": "209.97",
		"sized": ["162", "168", "148", "146", "158", "164"],
		"stock": 228,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Beginner-Intermediate",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional Twin",
		"flex_rating": "Soft",
		"core": "Wood"
	},
	{
		"title": "Ride Benchwarmer Snowboard 2023",
		"formattedTitle": "ride-benchwarmer-snowboard-",
		"brand": "ride",
		"description": "Rumor has it, if Coach would have put the Ride Benchwarmer Snowboard in during the fourth quarter, the team would have won state for sure. I mean, quadratic sidecut AND a directional shape? What's an opposing park feature supposed to do against that kind of combo? Add in a stiff flex, beefy Cleave edges, double impact plates, and a carbon-backed camber profile, and this freestyle twin can just do things that others can't. It's incredibly maneuverable, mega poppy, and downright nasty stomping the big jump line.",
		"image": "1653393931218.jpg",
		"price": "529.95",
		"sized": ["148", "158"],
		"stock": 206,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Asymmetrical, True Twin",
		"flex_rating": "Stiff",
		"core": "Bamboo, Carbon, Wood"
	},
	{
		"title": "Salomon Assassin Snowboard 2022 - Used",
		"formattedTitle": "salomon-assassin-snowboard----used",
		"brand": "salomon",
		"description": "The Salomon Assassin Snowboard is designed as Salomon's do-it-all killer, and it delivers like the UPS dude. A versatile tapered directional profile set up with a freestyle-oriented stance and rocker profile make this the best of many different worlds, soaring to new heights in the park while ripping big mountain lines with confidence.",
		"image": "1653393935669.jpg",
		"price": "359.96",
		"sized": ["142", "152", "164", "168", "162"],
		"stock": 200,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional Twin",
		"flex_rating": "Stiff",
		"core": "Bamboo, Cork, Wood"
	},
	{
		"title": "Rossignol Templar Snowboard 2021 - Used",
		"formattedTitle": "rossignol-templar-snowboard----used",
		"brand": "rossignol",
		"description": "There are no secret handshakes or ancient blood oaths required to ride the Rossignol Templar Snowboard, just a simple dedication to making the best of every day on the mountain. That's because this go-anywhere deck is designed to kill it in any terrain, and any conditions. Featuring an all-mountain rocker profile, directional flex, and a vibration damping Aramid and Basalt layup, the Templar provides the response and control needed to blast through resort chop, while 5S serrated edges bite and grip where lesser boards wash out. Versatility is the name of the game - join the not-so-secret society of happy shredders on the Rossignol Templar Snowboard.",
		"image": "1653393940579.jpg",
		"price": "231.99",
		"sized": ["158", "162", "146", "150"],
		"stock": 216,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional Twin",
		"flex_rating": "Medium",
		"core": "Aramid (Kevlar®), Basalt, Wood"
	},
	{
		"title": "K2 Antidote Snowboard 2023",
		"formattedTitle": "k2-antidote-snowboard-",
		"brand": "k2",
		"description": "The K2 Antidote Snowboard is here to cure what ails you. It's stiff and slightly setback for hard charging, down-the-line ripping, but aside from that, you wouldn't be out of line to think this looks like a park board. It's full cambered and symmetrically shaped, making it snappy through turns and balanced in the air. Whether you're throwing freestyle tricks into the powder, playfully slaying big mountain lines, or just attacking the park and the rest of the mountain with equal intensity, the Antidote is the perfect new alternative to the tired choice between directional beefcakes and super soft park twins,.",
		"image": "1653393944143.jpg",
		"price": "599.95",
		"sized": ["146", "158", "138", "168", "162", "150"],
		"stock": 202,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber",
		"shape": "Directional Twin",
		"flex_rating": "Stiff",
		"core": "Bamboo, Carbon, Wood"
	},
	{
		"title": "K2 Excavator Snowboard 2023",
		"formattedTitle": "k2-excavator-snowboard-",
		"brand": "k2",
		"description": "The K2 Excavator Snowboard was built to dig trenches. Whether those trenches are in a foot of fluffy pow or a field of manicured pinstripes, the Excavator provides with ease. This stylish directional board has a fat nose, slight swallowtail, and smooth al dente flex pattern with just the right blend of camber underfoot and rocker up front. It's a left turn, right turn connoisseur, serving up an all you can eat buffet of corduroy licking, face shot gobbling fun.",
		"image": "1653393948852.jpg",
		"price": "549.95",
		"sized": ["164", "142", "146"],
		"stock": 244,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride, Powder",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Bamboo, Carbon, Wood"
	},
	{
		"title": "K2 Raygun Pop Snowboard 2023",
		"formattedTitle": "k2-raygun-pop-snowboard-",
		"brand": "k2",
		"description": "The K2 Raygun Pop Snowboard is a point-and-shoot all-mountain snowboard for the people. This smooth-flexing directional twin comes with a cambered shape for great edge hold and plenty of pop. It's accessible for beginner riders to learn on, but backed with high quality construction and a versatile shape that also makes it perfect for intermediate riders that like to mix it up on a variety of terrain. Wherever your voyage takes you, don't forget to bring your Raygun.",
		"image": "1653393953643.jpg",
		"price": "429.95",
		"sized": ["158", "148", "142", "162", "146"],
		"stock": 176,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Beginner-Intermediate",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional Twin",
		"flex_rating": "Medium",
		"core": "Carbon, Wood"
	},
	{
		"title": "K2 Niseko Pleasures Snowboard 2023",
		"formattedTitle": "k2-niseko-pleasures-snowboard-",
		"brand": "k2",
		"description": "Tales of Niseko's bottomless powder are whispered from ear to ear in ski towns across the world. Designed specifically for this legendary locale, the K2 Niseko Pleasures Snowboard is pure nirvana in deep snow. If you've got a foot or two of powder to spare, and a blank canvas to play with, this directional board is as good of a companion as you could ever ask for. Despite it being a powder-friendly shape, it still comes with a fair amount of camber between the feet, making it an excellent choice for freeriders seeking precision and power to go along with infinite float.",
		"image": "1653393958542.jpg",
		"price": "599.95",
		"sized": ["142", "164", "138", "168", "152"],
		"stock": 240,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freeride, Powder",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Bamboo, Carbon"
	},
	{
		"title": "K2 Special Effects Snowboard 2023",
		"formattedTitle": "k2-special-effects-snowboard-",
		"brand": "k2",
		"description": "With a crazy setback, super cut-in swallowtail, and mega-fat nose, the K2 Special Effects Snowboard is the board you reach for when it gets deep. This volume shifted surfboard lives to slash windlips and bounce through pillows. It's rockered and flat through the tail to keep you planing over everything, plus it's backed up with an extra springy bamboo core so you get tons of energy out of every bottomless turn.",
		"image": "1653393962329.jpg",
		"price": "599.95",
		"sized": ["150", "164", "142", "168", "138", "146"],
		"stock": 160,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freeride, Powder",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Flat",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Bamboo, Carbon"
	},
	{
		"title": "K2 Passport Snowboard 2023",
		"formattedTitle": "k2-passport-snowboard-",
		"brand": "k2",
		"description": "From the steeps and deeps to the groomed and zoomed, the K2 Passport Snowboard will take you there. On the cover, you get a dependable directional shape, designed for all-mountain freeride fun. And once you start flipping through the pages, you'll find that its backed with K2's top of the line A1 core, triaxial carbon glass, and a super fast sintered 4000 base. It's high end tech in a widely accessible package, ready to be filled with stamps from far flung locales at every snowy corner of the globe.",
		"image": "1653393965737.jpg",
		"price": "529.95",
		"sized": ["146"],
		"stock": 113,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Bamboo, Carbon, Wood"
	},
	{
		"title": "K2 Alchemist Snowboard 2023",
		"formattedTitle": "k2-alchemist-snowboard-",
		"brand": "k2",
		"description": "The K2 Alchemist Snowboard is your directional big gun for full throttle freeriding. It's stiff and cambered for tons of power and edge hold, but with a setback stance and upturned nose to stay on top when it gets deep. If your idea of a good time involves cliff drops, face shots, and no speed limits, the Alchemist is a solid candidate for the only board you'll ever need.",
		"image": "1653393969553.jpg",
		"price": "699.95",
		"sized": ["152", "138"],
		"stock": 151,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freeride",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Very Stiff",
		"core": "Bamboo, Carbon, Wood"
	},
	{
		"title": "K2 Manifest Snowboard 2023",
		"formattedTitle": "k2-manifest-snowboard-",
		"brand": "k2",
		"description": "Visualize, then execute. The K2 Manifest Snowboard will help you turn your dreams into reality. As long as your dreams involve sliding sideways down mountains, anyway. This high level directional twin is built to provide a familiar feel while being backed by the highest levels of tech on the market. It's slightly setback, slightly rockered at the nose and tail, and heavily cambered underfoot, giving you a well-rounded platform for any kind of riding you can dream up.",
		"image": "1653393974509.jpg",
		"price": "579.95",
		"sized": ["138", "164", "168"],
		"stock": 13,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional Twin",
		"flex_rating": "Medium",
		"core": "Bamboo, Carbon, Wood"
	},
	{
		"title": "Ride Smokescreen Snowboard 2023",
		"formattedTitle": "ride-smokescreen-snowboard-",
		"brand": "ride",
		"description": "The Ride Smokescreen Snowboard brings freeriding to the people. Featuring a tapered directional shape inspired by the biggest and rowdiest big mountain boards in their lineup, but accompanied by a slightly mellower flex and more approachable price point, this board sits right in the sweet spot for many riders. Despite it's accessibility, Ride hasn't skimped out where it counts. The Smokescreen features the same camber-heavy profile, sintered base, and carbon reinforcement you'd find on any of Ride's highest end freeride boards, making this a perfect option for competent riders looking to expand their game to the highest peaks.",
		"image": "1653393978860.jpg",
		"price": "479.95",
		"sized": ["138", "142", "150", "146", "164", "158"],
		"stock": 184,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Bamboo, Carbon, Wood"
	},
	{
		"title": "Ride Commissioner Snowboard 2023",
		"formattedTitle": "ride-commissioner-snowboard-",
		"brand": "ride",
		"description": "It's always a good feeling when you check the forecast and immediately reach for the big gun with no hesitation. The Ride Commissioner Snowboard is a stiff directional freeride stick designed to make decision making easy on the best mornings of the season. When the daily prognosis is powder, cliff drops, and lines you've been eyeing since you were a little kid, the Commissioner is a slam dunk. It's super damp, super chargey, and super stoked to get after it in the alpine.",
		"image": "1653393983706.jpg",
		"price": "799.95",
		"sized": ["138", "150", "164", "152"],
		"stock": 129,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freeride",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Carbon, Metal, Polyurethane (PU), Wood"
	},
	{
		"title": "K2 Party Platter Snowboard 2023",
		"formattedTitle": "k2-party-platter-snowboard-",
		"brand": "k2",
		"description": "As one of the originators of the volume shifted movement, the K2 Party Platter Snowboard is serving up the goods. This fat directional board is meant to be ridden short, so you can turn it on a dime and start the party anytime. Simply put, it's a whole lot of fun. You get all the float and stability of a bigger board with all the easy riding, quick turning abilities of a shorter one. Rally through trees, spin threes of kickers, the Party Platter is down to clown, anytime, anyplace.",
		"image": "1653393988419.jpg",
		"price": "499.95",
		"sized": ["152", "168", "164", "162", "148", "146"],
		"stock": 43,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Bamboo, Carbon, Wood"
	},
	{
		"title": "K2 Broadcast Snowboard 2023",
		"formattedTitle": "k2-broadcast-snowboard-",
		"brand": "k2",
		"description": "The K2 Broadcast Snowboard can do it all. It's built around the three D's: dependable, directional, and darn fun to ride. With the just the right blend of rocker and camber and a medium-stiff flex profile, this board is accessible and powerful for the all-mountain ripper who wants to ride it all.",
		"image": "1653393993841.jpg",
		"price": "479.95",
		"sized": ["150", "152"],
		"stock": 60,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Bamboo, Carbon, Wood"
	},
	{
		"title": "Ride Shadowban Snowboard 2023",
		"formattedTitle": "ride-shadowban-snowboard-",
		"brand": "ride",
		"description": "Continuing in their trend of making excellent unisex snowboards that are truly built for everyone, Ride introduces the all-new Ride Shadowban Snowboard this year. It's a smooth flexing directional twin with a ton of tech, a camber-dominant profile, a multi-radius sidecut, and sizes all the way from 147 to 164. This dark horse is the perfect board for any rider to grab any day of the season and know they're in for a fun-filled day on the mountain.",
		"image": "1653393998592.jpg",
		"price": "499.95",
		"sized": ["168", "152", "158", "150", "164", "142"],
		"stock": 144,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional Twin",
		"flex_rating": "Soft",
		"core": "Bamboo, Carbon, Wood"
	},
	{
		"title": "Ride Berzerker Snowboard 2023",
		"formattedTitle": "ride-berzerker-snowboard-",
		"brand": "ride",
		"description": "Cue the heavy metal soundtrack and get to bashing. The Ride Berzerker Snowboard is a hellbent speed machine meant for the most manic descents down any terrain. But the crazy thing about it is that it manages to enable these aggressive levels of riding without ever feeling stiff or one dimensional. It has a directional shape and a fairly stout flex, but feels poppy and lively bouncing from edge to edge and feature to feature, thanks to a tapered shape and quadratic sidecut. It's perfect for the rider who wants to play with the terrain, but just plays a bit harder than most.",
		"image": "1653394002198.jpg",
		"price": "549.95",
		"sized": ["152", "164", "142", "162", "148", "138"],
		"stock": 73,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Bamboo, Carbon, Wood"
	},
	{
		"title": "Ride MTNpig Snowboard 2023",
		"formattedTitle": "ride-mtnpig-snowboard-",
		"brand": "ride",
		"description": "This little piggy went to the groomer, this little piggy went to the park. But the Ride MTNpig Snowboard went to the powder, and slayed huge lines 'til dark. If your idea of hog heaven is romping around the biggest terrain your mountain has to offer and seeking out the deepest snow you can find, the King of Bacon is the only board for you. This big pig is the most teched out, directionally destructive member of Ride's infamous Warpig lineage. If you're not already impressed by the sick looking half-moon tail or laundry list of carbon reinforcements in this thing, just take it out there and go huck some ham off a cliffdrop, and you'll see what we mean.",
		"image": "1653394006824.jpg",
		"price": "649.95",
		"sized": ["162"],
		"stock": 189,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Bamboo, Carbon, Wood"
	},
	{
		"title": "Arbor A-Frame Camber Snowboard 2023",
		"formattedTitle": "arbor-a-frame-camber-snowboard-",
		"brand": "arbor",
		"description": "On edge. The Arbor A-Frame Camber Snowboard is restless, motivated, and devastatingly fast. This board is a corduroy roasting, big line toasting, all-mountain hold-on-for-dear-lifer. A snow dragster, the A-Frame has large radius sidecut for max stability at speed: this isn't a board for dinking around on marginal conditions. One tip for A-Frame tamers: keep your yes from drying out with extra pair of gigantic goggles to go over your normal goggles, because you're going to be approaching ludicrous speeds pretty much everywhere.",
		"image": "1653394010331.jpg",
		"price": "649.95",
		"sized": ["138", "150", "142"],
		"stock": 78,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride, Powder",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber",
		"shape": "Directional",
		"flex_rating": "Very Stiff",
		"core": "Carbon, Wood"
	},
	{
		"title": "Lib Tech Skunk Ape II C2X Snowboard 2023",
		"formattedTitle": "lib-tech-skunk-ape-ii-c2x-snowboard-",
		"brand": "lib",
		"description": "The Lib Tech Skunk Ape II C2X Snowboard is a big resort board for big resort guys. This board was once a small child, a park rat twin that liked to bounce around on rails and jumps. But then one day, it started growing. First it grew big around the middle. But not fat, more like those dudes that lift barrels and rocks and stuff in strongman competitions. Sturdy. Then it got tall. Lanky through the trunk and with a big long nose. Finally it got strong as hell, and hairy, and just a little bit malodorous. The Skunk Ape was born. Nowadays it can be seen swinging from trees throughout the ski area, leaving monstrous bomb holes underneath powdery cliffs, denting downrails in the terrain park, and leaving trenches the size of snowmobile tracks across the groomers.",
		"image": "1653394015189.jpg",
		"price": "659.99",
		"sized": ["164", "148", "162", "146"],
		"stock": 147,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Basalt, Wood"
	},
	{
		"title": "Lib Tech Lost Mayhem Rocket C3 Snowboard 2023",
		"formattedTitle": "lib-tech-lost-mayhem-rocket-c3-snowboard-",
		"brand": "lib",
		"description": "Made in collaboration with surfboard shaper Matt \"Mayhem\" Biolos, the Lib Tech Lost Mayhem Rocket C3 Snowboard is a directional big wave gun for the frozen waters. As you'd expect for a surf-style shape, this board is a blast on powder days, with a ton of surface area and a wide nose and setback stance for excellent planing and easy trenching. But it also has one of the stiffest flex patterns in the Lib Tech lineup and an aggressive camber profile, making it one stop shopping for all-mountain ripping and directional freeriding.",
		"image": "1653394018424.jpg",
		"price": "629.99",
		"sized": ["148"],
		"stock": 209,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freeride, Powder",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Very Stiff",
		"core": "Wood"
	},
	{
		"title": "Lib Tech Stump Ape C2X Snowboard 2023",
		"formattedTitle": "lib-tech-stump-ape-c2x-snowboard-",
		"brand": "lib",
		"description": "It's no secret that short, wide powder shapes are all the current hotness. But if you're a big dude, it's hard enough to find a board that fits you at regular length, let alone in a sized down version. Enter the Lib Tech Stump Ape C2X Snowboard, a volume shifted direction powder board for big guys. It's all the fun, surfy, carvy, floaty goodness you've been missing out on. Enjoy.",
		"image": "1653394022112.jpg",
		"price": "659.99",
		"sized": ["152", "142"],
		"stock": 18,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride, Powder",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Basalt, Wood"
	},
	{
		"title": "GNU GWO BTX Snowboard 2023",
		"formattedTitle": "gnu-gwo-btx-snowboard-",
		"brand": "gnu",
		"description": "The GNU GWO BTX Snowboard is built around the simple excellence of Banana Technology. This unique snowboard design places a small pocket of camber under each foot for power and edgehold, and one mild pocket of rocker in between them, creating a catch-free, easy pivoting feel at the apex of your turns. In addition to enabling loose, skate-inspired styles in the terrain park, Banana Tech also makes all-mountain progression a breeze. The GWO turn easily, holds speed well, and is just plain fun to ride.",
		"image": "1653394027639.jpg",
		"price": "459.99",
		"sized": ["158", "146", "148"],
		"stock": 173,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Beginner-Intermediate",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "Lib Tech Ejack Knife HP C3 Snowboard 2023",
		"formattedTitle": "lib-tech-ejack-knife-hp-c3-snowboard-",
		"brand": "lib",
		"description": "Eric Jackson's reckless style of throwing big tricks in spicy backcountry terrain requires a special board that's bulletproof, powerful, and still easily maneuverable. Meet the Lib Tech Ejack Knife HP C3 Snowboard. It's super strong for big time stomps, floats through powder, and carries a ton of speed across the hardpack. As an added bonus, the board features Ray Troll's legendary “Spawn Till You Die” piece on the top and bottom.",
		"image": "1653394031224.jpg",
		"price": "659.99",
		"sized": ["138", "152", "142"],
		"stock": 240,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Basalt, Wood"
	},
	{
		"title": "Lib Tech Dynamo C3 Snowboard 2023",
		"formattedTitle": "lib-tech-dynamo-c3-snowboard-",
		"brand": "lib",
		"description": "The Lib Tech Dynamo C3 Snowboard is a hand grenade ready to explode. This directional freeride firecracker combines the powerful C3 camber profile with a wide-nosed directional shape for ultimate power through any density of soft snow, as well as unlimited stompability off big cliffs and natural features. Despite the hard charging, directional nature of the design, it maintains the playful pivotability and freestyle feel that Lib Tech boards are known for. It's poppy, precise, and perfect for fall line freestyle antics and all around ferocious riding.",
		"image": "1653394035788.jpg",
		"price": "559.99",
		"sized": ["158", "146", "164", "152"],
		"stock": 170,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Wood"
	},
	{
		"title": "Lib Tech Split BRD Splitboard 2023",
		"formattedTitle": "lib-tech-split-brd-splitboard-",
		"brand": "lib",
		"description": "The Lib Tech Split BRD Splitboard is designed for fun on both sides of the skin track. The lightweight Paulownia core and Karakoram Ultra Clips help you fly up the hill and breeze through transitions, and then it's all about that sweet BRD shape for the way down. This directional board is fast and floaty, perfect for dreamy powder descents. Plus, it has a C3 camber profile for the perfect blend of edge hold on dicey conditions and playful pop when it's time to send that windlip or backcountry booter.",
		"image": "1653394041229.jpg",
		"price": "999.99",
		"sized": ["138", "152", "162", "164"],
		"stock": 249,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Splitboarding",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Wood"
	},
	{
		"title": "Salomon Craft Snowboard 2023",
		"formattedTitle": "salomon-craft-snowboard-",
		"brand": "salomon",
		"description": "The Salomon Craft Snowboard is a do-it-all board for newbies and expert riders alike. Rock Out Camber and a medium flex are versatile enough for the park or off-piste exploring and the Popster and Aspen Strong cores add a little something extra to your turns and jumps. Cork rails are shock absorbing and planet-friendly, and the price is right in the sweet spot of quality and a solid deal, so you can master your craft without breaking the bank.",
		"image": "1653394045926.jpg",
		"price": "429.95",
		"sized": ["146"],
		"stock": 116,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Cork, Wood"
	},
	{
		"title": "Salomon Huck Knife Pro Snowboard 2023",
		"formattedTitle": "salomon-huck-knife-pro-snowboard-",
		"brand": "salomon",
		"description": "The Salomon Huck Knife Pro Snowboard is the high-performance board you need for steezy park riding. Quad Camber is stable, snappy, and more forgiving than traditional camber boards and the Popster core provides the perfect medium flex underfoot. Ghost Carbon Beams and Damplifier Lite honeycombs in the tip and tail give the Huck Knife Pro huge pop and diminished swing weight for maximum control in the air.",
		"image": "1653394049514.jpg",
		"price": "599.95",
		"sized": ["142"],
		"stock": 218,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "True Twin",
		"flex_rating": "Very Stiff",
		"core": "Carbon, Cork, Wood"
	},
	{
		"title": "Salomon Assassin Snowboard 2023",
		"formattedTitle": "salomon-assassin-snowboard-",
		"brand": "salomon",
		"description": "The Salomon Assassin Snowboard is the type of board that can handle anything the mountain throws at you. A versatile freestyle board with a directional twin shape, the Assassin is a hybrid of Salomon's most progressive powder board and freestyle board constructions. Quadralizer sidecut is optimized for high-speed carving and the Popster Eco Booster core will give you the snap you need for maximum air. Right at home going mach 10 on groomers, but still maneuverable enough to pick your way through tight terrain, the Salomon Assassin Snowboard is the aggressive park rider's all-mountain GOAT.",
		"image": "1653394053823.jpg",
		"price": "549.95",
		"sized": ["148", "142", "162", "168", "146"],
		"stock": 77,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional Twin",
		"flex_rating": "Stiff",
		"core": "Bamboo, Carbon, Cork, Wood"
	},
	{
		"title": "Salomon Sight Snowboard 2023",
		"formattedTitle": "salomon-sight-snowboard-",
		"brand": "salomon",
		"description": "If you're looking to shred off-piste, the Salomon Sight will get you from the ridgelines on top to the groomers below. The Cross Profile Camber is made for stability while charging and the rocker at the tip and tail add a bit of float in the deep. The Quadratic sidecut and tapered shape enhance turn initiation and control on variable snowpack and the cork rails dampen chunder and do good for the Earth.",
		"image": "1653394058142.jpg",
		"price": "379.95",
		"sized": ["152", "148", "164", "158"],
		"stock": 65,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Beginner-Intermediate",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Cork, Wood"
	},
	{
		"title": "Salomon Dancehaul Snowboard 2023",
		"formattedTitle": "salomon-dancehaul-snowboard-",
		"brand": "salomon",
		"description": "The Salomon Dancehaul Snowboard is the disco ball of the mountain, and not just because it sparkles. The wide, tapered directional shape cruises through powder and the shorter length keeps things nimble and fun. Rock Out Camber and Popster Core with Ghost Basalt Stringers dampen chatter but bring out the snap where you want it for an epic but controlled ride. If you've been wondering what volume shift boards are all about, grab yourself a Dancehaul and party your way down the mountain.",
		"image": "1653394062222.jpg",
		"price": "479.95",
		"sized": ["164", "150", "162", "148"],
		"stock": 124,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride, Powder",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Basalt, Wood"
	},
	{
		"title": "Lib Tech Skate Banana BTX Snowboard 2023",
		"formattedTitle": "lib-tech-skate-banana-btx-snowboard-",
		"brand": "lib",
		"description": "The board that started it all. The Lib Tech Skate Banana BTX Snowboard was the originator of Lib Tech's signature Banana rocker technology. By placing cambered pockets under each foot with a rockered section in the middle, the Skate Banana lets you pop and pivot at will, enjoying all the benefits of both rocker and camber. With Magne-Traction enhanced edging on groomers and a park ready twin profile, this board is simple, intuitive, and ready to do it all in the resort.",
		"image": "1653394066246.jpg",
		"price": "559.99",
		"sized": ["152"],
		"stock": 70,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Beginner-Intermediate",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "True Twin",
		"flex_rating": "Soft",
		"core": "Wood"
	},
	{
		"title": "GNU Hyper C2X Snowboard 2023",
		"formattedTitle": "gnu-hyper-c2x-snowboard-",
		"brand": "gnu",
		"description": "The GNU Hyper C2X Snowboard is all about minimal design taken to maximum conclusions. It's a straightforward directional board with blank graphics that let your style do the talking. It's smooth and powerful, an excellent platform for taking your park skills to the big mountain. It stomps hard, carves well, and pivots surprisingly easily for a board of it's size. If you're looking for hyper-focused hyper-charging, this Blake Paul pro model is not a bad place to start.",
		"image": "1653394070058.jpg",
		"price": "599.99",
		"sized": ["158", "168", "150", "164", "138", "148"],
		"stock": 203,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Carbon, Wood"
	},
	{
		"title": "Lib Tech Magic BM C2 Snowboard 2023",
		"formattedTitle": "lib-tech-magic-bm-c2-snowboard-",
		"brand": "lib",
		"description": "Who said snowboarding had to be hard work? When things come together in the right way - human, wood, gravity, snow - it all becomes pretty dang dreamy and effortless. Take a ride on the Lib Tech Magic BM C2 Snowboard and you'll see. This directional freeride deck carves like a hot knife through butter, breezes through powder, and rips with all the confidence and performance you'd expect from the folks at Lib Tech. Basalt reinforcements keep the ride smooth and stable when things get choppy, and C2 camber works its all mountain magic for a board you can look to on any day of the season.",
		"image": "1653394074454.jpg",
		"price": "699.99",
		"sized": ["152"],
		"stock": 161,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Basalt, Wood"
	},
	{
		"title": "GNU Money C2E Snowboard 2023",
		"formattedTitle": "gnu-money-c2e-snowboard-",
		"brand": "gnu",
		"description": "The GNU Money C2E Snowboard is value packed and ready to smash a terrain park near you. This bomber twin is as poppy and nimble as they come, built for easy styling fun across the mountain. The Banana Tech hybrid rocker profile makes it super easy to smear and press on boxes and rails, and the bomber construction makes it durable enough to keep doing it for seasons to come.",
		"image": "1653394077829.jpg",
		"price": "449.99",
		"sized": ["146", "142", "168", "138", "162", "150"],
		"stock": 51,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "Lib Tech Terrain Wrecker C2X Snowboard 2023",
		"formattedTitle": "lib-tech-terrain-wrecker-c2x-snowboard-",
		"brand": "lib",
		"description": "Cue up the Miley Cyrus, because you're about to hit the mountain like a wrecking ball. The Lib Tech Terrain Wrecker C2X Snowboard is an all-mountain destroyer that's ready to hit the slopes. This directional twin is sturdy and stable charging down groomers and runouts, and lives to spin and tweak it's way through the air. It's a park board that it would be a shame to confine to just the park, with vibration dampening, speed-needing properties that are just waiting to be unleashed.",
		"image": "1653394082375.jpg",
		"price": "579.99",
		"sized": ["152", "138", "162", "142", "164", "146"],
		"stock": 118,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional Twin",
		"flex_rating": "Stiff",
		"core": "Wood"
	},
	{
		"title": "GNU Essential Service C2 Snowboard 2023",
		"formattedTitle": "gnu-essential-service-c2-snowboard-",
		"brand": "gnu",
		"description": "If you are a high level snowboarder and you can only have one board, there's a strong case to be made for the GNU Essential Service C2 Snowboard. This board is versatile, powerful, and intuitive. It's mean enough to stomp big landings and charge through sub-optimal snow conditions, and friendly enough to handle easily across groomers and mellower terrain. It floats well in the powder, rides loose and nimble in the park, and easily steps up or down to whatever level of aggression you're bringing to the day.",
		"image": "1653394085893.jpg",
		"price": "499.99",
		"sized": ["168", "150", "152", "148", "164"],
		"stock": 69,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional Twin",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "Lib Tech Box Knife C3 Snowboard 2023",
		"formattedTitle": "lib-tech-box-knife-c3-snowboard-",
		"brand": "lib",
		"description": "The Lib Tech Box Knife C3 Snowboard builds on the endlessly versatile freestyle shape of the Box Scratcher, but adds in powerful C3 Camber to the mix. The result is a powerful freestyle board with off-the-charts pop and edge hold, plus a playful, pilotable style that makes you want to jib everything in sight.",
		"image": "1653394089670.jpg",
		"price": "549.99",
		"sized": ["148", "152"],
		"stock": 15,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "GNU Gremlin C3 Snowboard 2023",
		"formattedTitle": "gnu-gremlin-c3-snowboard-",
		"brand": "gnu",
		"description": "The GNU Gremlin C3 Snowboard is one nasty little rascal. This dangerous trickster combines directional float with C3 Camber, making it a powerful demon of all-mountain mayhem. It weasels it's way through pow stashes, pilfers lift line cliff drops, and greedily gobbles up the kingpin lines of all the most coveted big mountain zones. If you're a lil' stinker who wants the most and wants it now, get on the Gremlin and go make some mischief, you dang scoundrel!",
		"image": "1653394092987.jpg",
		"price": "559.99",
		"sized": ["162"],
		"stock": 161,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Wood"
	},
	{
		"title": "GNU 4x4 C3 Snowboard 2023",
		"formattedTitle": "gnu-4x4-c3-snowboard-",
		"brand": "gnu",
		"description": "The GNU 4x4 C3 Snowboard is an all terrain vehicle that lives for the rough and tumble. Forest Bailey's big mountain board is built to handle be deepest days and burliest lines of the season. It has a stiff chassis and powerful C3 camber providing plenty of drive, accompanied by Mange-Traction edge serrations giving you serious grip on the hardpack. Despite it's directional design and aggressive DNA, this board is nimble and lively. It's easy to spin and balanced in the air, making it an excellent one-board quiver for creative chargers, or big day swap-out for freestyle focused riders.",
		"image": "1653394096769.jpg",
		"price": "579.99",
		"sized": ["168", "138"],
		"stock": 242,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Very Stiff",
		"core": "Wood"
	},
	{
		"title": "GNU Banked Country Splitboard 2023",
		"formattedTitle": "gnu-banked-country-splitboard-",
		"brand": "gnu",
		"description": "Lightweight, directional, poised. The GNU Banked Country Splitboard is based on the hardpack ripping, Banked Slalom winning resort shape, but refined to go places no banks have ever been formed. This board's smooth tapered geometry allows for unmatched float in untracked backcountry powder, and it's sturdy flex and progressive Magne-Traction edges allow for dialed performance on technical terrain. It gets you up so you can get down.",
		"image": "1653394101476.jpg",
		"price": "999.99",
		"sized": ["142", "164", "138", "158", "152"],
		"stock": 25,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Splitboarding",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Carbon, Wood"
	},
	{
		"title": "Lib Tech Jamie Lynn '96 Snowboard 2023",
		"formattedTitle": "lib-tech-jamie-lynn-'96-snowboard-",
		"brand": "lib",
		"description": "The 90's are back. Straight-legged jeans, middle parts, and most of all, traditional cambered, freestyle twin snowboards. With the evolution of Jamie Lynn's style from his 90's heyday, his pro model has taken on a much more directional, freeride shape over the past few years. But he's throwing it back with this one. The Lib Tech Jamie Lynn '96 Snowboard is an homage to the good old days with a full camber, smooth edged, symmetrical design that's guaranteed to throw down in the park.",
		"image": "1653394105951.jpg",
		"price": "659.99",
		"sized": ["142", "148", "168", "138", "162", "152"],
		"stock": 246,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "Lib Tech TRS C3 Snowboard 2023",
		"formattedTitle": "lib-tech-trs-c3-snowboard-",
		"brand": "lib",
		"description": "Are you a Total Ripper looking for your next freestyle steed? The Lib Tech TRS C3 Snowboard is what you need. This directional twin is built to trick it's way across the mountain, with Lib Tech's most aggressive camber profile and the explosive Horsepower layup giving you the boost you need to send it big. New for this year, it's been enhanced with bamboo sections under the feet for added precision and pop, making this all-mountain weapon that much more deadly.",
		"image": "1653394110874.jpg",
		"price": "659.99",
		"sized": ["168", "152", "150", "142", "162", "164"],
		"stock": 28,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional Twin",
		"flex_rating": "Stiff",
		"core": "Bamboo, Basalt, Wood"
	},
	{
		"title": "GNU Riders Choice Asym C2X Snowboard 2023",
		"formattedTitle": "gnu-riders-choice-asym-c2x-snowboard-",
		"brand": "gnu",
		"description": "The GNU Riders Choice Asym C2X Snowboard breaks out all the stops, incorporating all of the highest end materials and signature tech that GNU is known for. It uses an asymmetrical design for easy, powerful turns, Magne-Traction edges for insane grip, a hybrid C2x Banana profile for tons of pop and pivot, and finishes this off with Carbon Power bands for a little extra oomph. And of course, the board is Mervin Made, so it's all done by hand in the great state of Washington using the most eco-friendly methods possible. The end result is a premier all-mountain freestyle deck that handles anything with explosive style and unlimited fun.",
		"image": "1653394114989.jpg",
		"price": "659.99",
		"sized": ["138", "152", "148", "164", "142"],
		"stock": 66,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Asymmetrical, True Twin",
		"flex_rating": "Medium",
		"core": "Carbon, Wood"
	},
	{
		"title": "GNU Antigravity C3 Snowboard 2023",
		"formattedTitle": "gnu-antigravity-c3-snowboard-",
		"brand": "gnu",
		"description": "As a snowboarder, gravity is your best friend and your arch nemesis. It pulls you down the hill, giving you the speed you need to soar, even as you do your best to escape its clutches. The GNU Antigravity C3 Snowboard is your new favorite pair of dancing shoes, helping you cha-cha just a little smoother in your dance with kinetic energy. It's an easy riding directional board that floats above the powder, soars off of natural features, and keeps you speeding by on your feet when the slippery slopes of the mountain are trying to drag you down for a hug.",
		"image": "1653394119051.jpg",
		"price": "479.99",
		"sized": ["152", "164", "138"],
		"stock": 234,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "Lib Tech Box Scratcher BTX Snowboard 2023",
		"formattedTitle": "lib-tech-box-scratcher-btx-snowboard-",
		"brand": "lib",
		"description": "The Lib Tech Box Scratcher BTX Snowboard is a classic Lib Tech freestyle board. With an Original Banana rocker profile and OG Magne-Traction edges, this board balances easy buttering and pivotability with superpowered pop and edge hold. It's soft, easy to ride, and tons of fun to ride, no matter your skill level.",
		"image": "1653394123567.jpg",
		"price": "549.99",
		"sized": ["152", "164", "162", "150", "138", "142"],
		"stock": 175,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "GNU Riders Choice Asym C3 Snowboard 2023",
		"formattedTitle": "gnu-riders-choice-asym-c3-snowboard-",
		"brand": "gnu",
		"description": "The GNU Riders Choice Asym C3 Snowboard (or the RC C3 as it's affectionately called by its legions of fans) is a full-throttle freestyle ripping machine, incorporating all of the highest end materials that GNU has to offer. It uses an asymmetrical design for easy, powerful turns, Magne-Traction edges for insane grip, and Carbon Power bands for a little extra oomph. To top it all off, the board is built around the aggressively poppy C3 Camber contour for pro-level power transfer and an attacking soul when tricking off of natural features and slaying contest-worthy lines.",
		"image": "1653394127244.jpg",
		"price": "659.99",
		"sized": ["146", "142"],
		"stock": 119,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Asymmetrical, True Twin",
		"flex_rating": "Stiff",
		"core": "Carbon, Wood"
	},
	{
		"title": "GNU Banked Country C3 Snowboard 2023",
		"formattedTitle": "gnu-banked-country-c3-snowboard-",
		"brand": "gnu",
		"description": "When it comes down to it, the makings of a hard charging powder board and a straight up hardpack ripper are not all that different. Or, in the case of the GNU Banked Country C3 Snowboard, they're exactly the same. Designed by the father son collab of Temple and Cannon Cummins, the Banked Country is built to chase huge snow days as well as gold medals at Baker's Legendary Banked Slalom. The stiff directional shape, gripped edgehold, and big shovel-like nose bring smiles to the faces of OG's and up and coming groms alike, through the deep days of winter and the rippin' days of spring.",
		"image": "1653394130412.jpg",
		"price": "599.99",
		"sized": ["164"],
		"stock": 139,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride, Powder",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Very Stiff",
		"core": "Wood"
	},
	{
		"title": "Lib Tech Double Dip C2 Snowboard 2023",
		"formattedTitle": "lib-tech-double-dip-c2-snowboard-",
		"brand": "lib",
		"description": "According to the folks and Lib's ExperiMENTAL division, the Lib Tech Double Dip C2 Snowboard is \"directional in both directions.\" That might sound like a head scratcher, but once you take this thing into the powder, you'll understand. The short contact points on the board give it that floaty, long-nose feeling whether you're charging regular down the fall line, or riding out switch from a big natural hit. It's a freestyle twin made to ride where freestyle twins can't, giving park riders a freeride friendly powder tool that maintains it's ability to double dip on the fun and get back to the park in the afternoon once the steeps are tracked out.",
		"image": "1653394134180.jpg",
		"price": "629.99",
		"sized": ["148", "164", "152", "138"],
		"stock": 136,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain, Powder",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "Lib Tech MC Wayfinder II C2 Snowboard 2023",
		"formattedTitle": "lib-tech-mc-wayfinder-ii-c2-snowboard-",
		"brand": "lib",
		"description": "The Lib Tech MC Wayfinder II C2 Snowboard is a volume shifted pocket rocket meant to inspire new levels of creativity on the mountain. With an unsinkable nose, an un-toe-draggable waist, and a mega setback stance, the Wayfinder finds it's way on powder days with the best of them. Paired with it's stubby, easy to maneuver length and it's deep, hourglass sidecut, it also finds its way through tight trees and tight turn shapes with ridiculous ease. Simply put, it's one of the best good-times powder boards you'll ever find, and once it's tracked out, it's a blast to wiggle around on groomers and spring slush laps.",
		"image": "1653394137393.jpg",
		"price": "659.99",
		"sized": ["150", "152", "138"],
		"stock": 130,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride, Powder",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "GNU FB Head Space Asym C3 Snowboard 2023",
		"formattedTitle": "gnu-fb-head-space-asym-c3-snowboard-",
		"brand": "gnu",
		"description": "Get your head in the game with the GNU FB Head Space Asym C3 Snowboard. This mind expanding freestyle twin uses asymmetrical sidecuts to give you power in the heels and finesse in the toes. This lets you pump, surf, and pop with insane levels of energy, as well as making something as simple as carving a groomer into a unique delight. It's optimized for the street sessions, park laps, and side hit shenanigans that characterize Forest Bailey's approach to the sport, and will help you push yourself in any discipline.",
		"image": "1653394141146.jpg",
		"price": "559.99",
		"sized": ["162", "152", "148"],
		"stock": 191,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Asymmetrical",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "Lib Tech Lost Quiver Killer C3 Snowboard 2023",
		"formattedTitle": "lib-tech-lost-quiver-killer-c3-snowboard-",
		"brand": "lib",
		"description": "The Lib Tech Lost Quiver Killer C3 Snowboard does what it says it does. Maybe you're relatively early down your path of snowboarding addiction, far enough that you need a high level ride, but not yet to the point where you have accumulated seven different boards for every situation. Or maybe you're pretty far gone already, but you're moving in with your partner to a small shared space, and they've told you that having seventeen snowboards is ridiculous, and can you possibly pare it down to only one or two. Or maybe you just aren't sure what to bring on that week long trip you've got planned. Whether it's for love, convenience, storage space, or poverty, it's time to kill your quiver. Luckily for you, you can stick with this sweet stick and still be able to do it all on the mountain on just one board.",
		"image": "1653394145800.jpg",
		"price": "659.99",
		"sized": ["162", "164", "152", "168", "150", "138"],
		"stock": 81,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Wood"
	},
	{
		"title": "Lib Tech T.Rice Apex Orca Snowboard 2023",
		"formattedTitle": "lib-tech-t.rice-apex-orca-snowboard-",
		"brand": "lib",
		"description": "We all know about the black shadows of death, the terrors of the deep that are killer whales. Well the apex predator just got 50% more apexier. Think killer whales with freaking laser beams on their heads. Think orcas fighting great whites or giant squids or something, and their skin gets ripped off their face, revealing Terminator-style chrome and blinking red lights underneath. The Lib Tech T.Rice Apex Orca Snowboard is the pow-slaying all-mountain hunter we all know and love, laid up with a crazy light, concerningly bloodthirsty Apex Construction. It's a cyborg murder dolphin made of carbon fiber, PET bottles, and hot nasty speed.",
		"image": "1653394150218.jpg",
		"price": "1,199.99",
		"sized": ["142", "138", "162", "148", "168"],
		"stock": 0,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride, Powder",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Carbon, Foam, Wood"
	},
	{
		"title": "Salomon Pulse Snowboard 2023",
		"formattedTitle": "salomon-pulse-snowboard-",
		"brand": "salomon",
		"description": "The Salomon Pulse Snowboard is forgiving on your turns and your wallet. The soft flex and Flat Out Camber are perfect for beginners, encouraging progression while giving new boarders much-needed stability. Bite Free Edges help avoid painful biffs and the Directional Twin shape allows new riders to ride switch when they're learning to link turns. Don't let an advanced board inhibit your progress - start your snow sliding journey with a board that'll keep things fun and easy.",
		"image": "1653394154503.jpg",
		"price": "349.95",
		"sized": ["152", "146", "148", "150", "162"],
		"stock": 32,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Beginner-Intermediate",
		"rocker_type": "Flat/Camber/Flat",
		"shape": "Directional Twin",
		"flex_rating": "Soft",
		"core": "Wood"
	},
	{
		"title": "Salomon Assassin Pro Snowboard 2023",
		"formattedTitle": "salomon-assassin-pro-snowboard-",
		"brand": "salomon",
		"description": "If your usual route takes you from the park to the ridgelines and everywhere in between, the Salomon Assassin Pro Snowboard is the board you need for all-mountain snow sliding. Ghost Carbon Beams and the Ghost Green Core add mega pop to your jumps but are light enough to haul on hikes to sidecountry summits. Gunslinger carbon sidewalls absorb chatter and the stiff flex makes for a high-speed ride that can land cliffs and carve groomers all the way back to the lift.",
		"image": "1653394159348.jpg",
		"price": "599.95",
		"sized": ["138"],
		"stock": 194,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional Twin",
		"flex_rating": "Very Stiff",
		"core": "Bamboo, Carbon, Cork, Wood"
	},
	{
		"title": "Salomon Highpath Splitboard 2023",
		"formattedTitle": "salomon-highpath-splitboard-",
		"brand": "salomon",
		"description": "Whether you're getting deep in the backcountry for untracked lines or enjoying your time in nature, it all ties back to a healthy planet. The Salomon Highpath Splitboard features recycled and sustainable materials, including the base, topsheet, resins, and edges. Don't think it comes at a performance cost, either - the tapered directional shape and Rock Out Camber are stable and quick in variable terrain. The kit comes with Plum Hardware and pre-cut, cult-favorite Pomoca Skins too, so it's truly the ultimate package.",
		"image": "1653394162778.jpg",
		"price": "899.95",
		"sized": ["168"],
		"stock": 25,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Splitboarding",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "Season Kin Snowboard 2022 - Used",
		"formattedTitle": "season-kin-snowboard----used",
		"brand": "season",
		"description": "Spend a season in the park and you'll see why the rail sliders, box boopers, and jump line maniacs think of themselves as family. Day after day honing skills, hollering encouragement, and picking your homies up off the snow to have another crack at nailing that. one. friggin'. trick. It shifts your perception of what matters, of why we do the things we do. The Season Kin Snowboard is a directional twin shape for the whole freestyle fam - men, women, young, and old. It has symmetrical camber for added grip and energy, a playful, pressable flex, and durable construction engineered to stand up to everyday abuse in the park and beyond.",
		"image": "1653394167399.jpg",
		"price": "215.99",
		"sized": ["138", "168"],
		"stock": 50,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber",
		"shape": "Directional Twin",
		"flex_rating": "Soft",
		"core": "Wood"
	},
	{
		"title": "CAPiTA NEO Slasher Splitboard 2022",
		"formattedTitle": "capita-neo-slasher-splitboard-",
		"brand": "capita",
		"description": "Untapped zones and untracked lines are one step closer strapped into the CAPiTA NEO Slasher Splitboard. Whether you fancy long-haul slogs or the quick pre-work lap, this lightweight split delivers all the features of your favorite resort pow board with unlimited uphill capabilities. Featuring a setback stance and a tapered directional shape, it surfs fluff like no other and maintains an incredibly poppy and stable feel through any snow.",
		"image": "1653394172069.jpg",
		"price": "599.96",
		"sized": ["164", "168", "150", "148", "138"],
		"stock": 125,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Splitboarding",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Carbon, Flax, Wood"
	},
	{
		"title": "Sims Goon Gear x Bowl Squad Snowboard 2022",
		"formattedTitle": "sims-goon-gear-x-bowl-squad-snowboard-",
		"brand": "sims",
		"description": "The Sims Goon Gear x Bowl Squad Snowboard is a smooth and soft flexing ride with a forgiving personality, perfect for getting you from zero to sixty in no time flat. This lightweight true twin shape isn't only great as a beginner tool, but will likely stay in your quiver as you progress to learning tricks in the park and start to master airs. Laid up with an exclusive Goon Gear collab topsheet, this deck will have you dressed to impress.",
		"image": "1653394177216.jpg",
		"price": "357.00",
		"sized": ["162", "148"],
		"stock": 238,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Beginner-Intermediate",
		"rocker_type": "Camber",
		"shape": "True Twin",
		"flex_rating": "Soft",
		"core": "Bamboo, Carbon, Wood"
	},
	{
		"title": "Salomon Abstract Snowboard 2023",
		"formattedTitle": "salomon-abstract-snowboard-",
		"brand": "salomon",
		"description": "If traditional snowboards are limiting your creativity, the Salomon Abstract Snowboard is the versatile freestyle board that will let you best express your style. Rock Out Camber is stable underfoot and forgiving in the tip and tail for fast riding and easy buttering, and the Quadralizer sidecut provides dialed edge pressure for maneuverability and precision. Don't let snowboard manufacturers put you in a box — the Abstract is made for pushing boundaries from the resorts to the streets.",
		"image": "1653394181505.jpg",
		"price": "499.95",
		"sized": ["162"],
		"stock": 5,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Carbon, Wood"
	},
	{
		"title": "Nidecker Merc SE Snowboard - Blem 2022",
		"formattedTitle": "nidecker-merc-se-snowboard---blem-",
		"brand": "nidecker",
		"description": "Whether you are out exploring corners of the mountain, exposing yourself to unknown and new terrain on your progression grind, or you're the rider who goes wherever the wind takes you — laps through the park, ripping trees, finding powder when it's there, the Nidecker Merc SE Snowboard was made for you. Designed to be a one-and-done quiver killer, the Merc is a mid-flex all-mountain board ready to answer any call of duty. Without being a powerlifter, riders can load up the CamRock in the core and tail with relative ease and receive ample response for big pop in their ollies and smooth and powerful carving. Exclusive to evo, the Nidecker Merc SE Snowboard is the best value on snow! *Please Note: This is a factory blem board that may have slight cosmetic damage.*",
		"image": "1653394185178.jpg",
		"price": "246.49",
		"sized": ["142"],
		"stock": 184,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional Twin",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "Rossignol District Snowboard 2022",
		"formattedTitle": "rossignol-district-snowboard-",
		"brand": "rossignol",
		"description": "Take it from the baby park to the half pipe on the Rossignol District Snowboard, an easy to learn on freestyle board that offers jibby fun for the developing rider. Its softer flex is easy to move and forgiving when you fall, and an AmpTek Auto Turn Rocker profile makes turning a breeze. A wood core and twin freestyle flex add hard snow stability and a little pop when you're feeling funky on the side hits. Getting into a new sport can sometimes feel intimidating, but thanks to the Rossignol District Snowboard, your first season won't be scary.",
		"image": "1653394189371.jpg",
		"price": "297.46",
		"sized": ["162"],
		"stock": 87,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle",
		"ability_level": "Beginner-Intermediate",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "True Twin",
		"flex_rating": "Soft",
		"core": "Wood"
	},
	{
		"title": "Sims ATV Snowboard 2022",
		"formattedTitle": "sims-atv-snowboard-",
		"brand": "sims",
		"description": "Steeps, deeps, groomers and what not, attack the entire mountain with all-time vehemence on the Sims ATV Snowboard. This versatile all-mountain tool features a traditional camber profile for pop and energy, Sims' Flexible Thin Tip techology for maneuverability, and tip to tail bamboo stringers in the core for long lasting fun. If you're looking for a single board to do it all, the Sims ATV wants you to take it for a drive.",
		"image": "1653394193201.jpg",
		"price": "398.99",
		"sized": ["146", "138", "164"],
		"stock": 224,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber",
		"shape": "Directional Twin",
		"flex_rating": "Medium",
		"core": "Bamboo, Carbon, Wood"
	},
	{
		"title": "Sims Undertaker Snowboard 2022",
		"formattedTitle": "sims-undertaker-snowboard-",
		"brand": "sims",
		"description": "The Sims Undertaker Snowboard is a high-level all-mountain weapon of skate-style destruction. It has a directional twin shape with a blunted nose and tail for a perfect freestylie feel on natural features. Plus it's loaded up with the top tech from Sims, things like Bubblegum sidewalls and V2 Carbon stringers. But don't let any of that distract you from the fact that in 1998, The Undertaker threw Mankind off Hell In A Cell, and plummeted 16 feet through an announcer’s table.",
		"image": "1653394196745.jpg",
		"price": "404.69",
		"sized": ["138", "148", "152", "162", "164", "150"],
		"stock": 164,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional Twin",
		"flex_rating": "Stiff",
		"core": "Carbon, Wood"
	},
	{
		"title": "CAPiTA Spring Break Powder Twin Snowboard 2022 - Used",
		"formattedTitle": "capita-spring-break-powder-twin-snowboard----used",
		"brand": "capita",
		"description": "Yeah, that's right: CAPiTA Spring Break Powder Twin Snowboard. Powder. Twin. It makes sense when you remember the surfy, playful, don't-take-yourself-so-seriously ethos of the Spring Break line. The Powder Twin keeps the extra wide waist, the tight, carvey turn radius, and gentle Surf Rocker profile of its directional cousins, but packages them together in a Twin shape that's perfect for playful freestyle powder riding. Grab your homies and get to work that backcountry booter you've been talking about for years, this is the board you've been waiting for.",
		"image": "1653394201095.jpg",
		"price": "315.32",
		"sized": ["138", "168", "158"],
		"stock": 98,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, Powder",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Basalt, Wood"
	},
	{
		"title": "Season Aero Snowboard 2022 - Used",
		"formattedTitle": "season-aero-snowboard----used",
		"brand": "season",
		"description": "The Season Aero Snowboard is a rocket ship, surgeon’s scalpel, and artist’s paintbrush rolled into one. It’s that friend you can rely on to drop everything to go ride - the same one who makes you feel ten feet tall when things get spicy. Crafted with traditional camber and a powerful flex, it exudes confidence in rugged terrain and purrs when you open up the throttle to paint fast, clean arcs through the chop. Top to bottom, bell to bell, the Aero is built to fly.",
		"image": "1653394205693.jpg",
		"price": "245.51",
		"sized": ["162", "148", "150"],
		"stock": 186,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Wood"
	},
	{
		"title": "Sims Nub JP Snowboard 2022 - Used",
		"formattedTitle": "sims-nub-jp-snowboard----used",
		"brand": "sims",
		"description": "The top pick of some of Sims' most progressive riders, the Sims Nub JP Snowboard gets the nod for freeride trickery taken to its logical next step. With plenty of pop from its Traditional Camber shape and I-Carbon laminate, the Nub also uses Sims' fastest base and best Tri-Tex fiberglass layup. Throw in an exclusive topsheet found only at evo and this board is a strong contender for \"most freestyle fun you can have while not in the park\" honors.",
		"image": "1653394209841.jpg",
		"price": "401.20",
		"sized": ["168", "146", "148", "142"],
		"stock": 7,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain, Freeride",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber",
		"shape": "Directional Twin",
		"flex_rating": "Medium",
		"core": "Carbon, Wood"
	},
	{
		"title": "Lib Tech T.Rice Orca Snowboard - Blem 2022 - Used",
		"formattedTitle": "lib-tech-t.rice-orca-snowboard---blem----used",
		"brand": "lib",
		"description": "What's your idea of fun? Painting watercolors? Watching sportsball? Sitting on the couch giving the old thumbs a workout? They're all valid, of course, but if your idea of fun involves tossing yourself down mountains, snorkeling through bottomless snow, and breaching like a stoked out sea creature, boy do we have the tool for you. The Lib Tech T.Rice Orca Snowboard is king among all-terrain vehicles, and Travis Rice's go-to tool for slicing up the resort and sidecountry alike. It rails groomers, smashes pow, floats like a dream, and handles spicy tech zones with ease. It is quite simply one of the most capable all mountain boards in the biz. Sound like fun? *Please Note: This is a factory blem board and may have slight cosmetic damage.*",
		"image": "1653394213401.jpg",
		"price": "519.99",
		"sized": ["138", "150", "152", "164"],
		"stock": 74,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride, Powder",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Basalt, Wood"
	},
	{
		"title": "Lib Tech T.Rice Orca Snowboard 2022 - Used",
		"formattedTitle": "lib-tech-t.rice-orca-snowboard----used",
		"brand": "lib",
		"description": "What's your idea of fun? Painting watercolors? Watching sportsball? Sitting on the couch giving the old thumbs a workout? They're all valid, of course, but if your idea of fun involves tossing yourself down mountains, snorkeling through bottomless snow, and breaching like a stoked out sea creature, boy do we have the tool for you. The Lib Tech T.Rice Orca Snowboard is king among all-terrain vehicles, and Travis Rice's go-to tool for slicing up the resort and sidecountry alike. It rails groomers, smashes pow, floats like a dream, and handles spicy tech zones with ease. It is quite simply one of the most capable all mountain boards in the biz. Sound like fun?",
		"image": "1653394216609.jpg",
		"price": "375.99",
		"sized": ["142", "152", "146", "158", "150", "162"],
		"stock": 214,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride, Powder",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Basalt, Wood"
	},
	{
		"title": "Season Nexus Snowboard 2022 - Used",
		"formattedTitle": "season-nexus-snowboard----used",
		"brand": "season",
		"description": "The Season Nexus Snowboard stands out in the arms race of bloated quivers and technical jargon - a simple skeleton key capable of unlocking the innate potential of any day in the mountains. Its straightforward geometry cuts through the noise, creating something that adds up to much more than the sum of its parts. Ample float in powder, smooth, engaged turns on hardpack, and dependable performance in everyday resort chop. It’s the ultimate quiver of one - more than enough to remind you why you fell in love with snowboarding in the first place.",
		"image": "1653394221470.jpg",
		"price": "279.99",
		"sized": ["150", "146", "164", "142", "158", "148"],
		"stock": 175,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional Twin",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "GNU FB Head Space Asym C3 Snowboard 2022 - Used",
		"formattedTitle": "gnu-fb-head-space-asym-c3-snowboard----used",
		"brand": "gnu",
		"description": "If you're one of the folks who needs to think about their entire life before dropping in, consider getting the GNU FB Head Space Asym C3 Snowboard to quiet your mind. Featuring asymmetric construction, Magne-Traction edges, and signature C3 camber, this comp-level jib machine will boost your confidence and progression in the park and beyond.",
		"image": "1653394225378.jpg",
		"price": "319.99",
		"sized": ["138", "148", "168"],
		"stock": 70,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Asymmetrical, True Twin",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "Dinosaurs Will Die Never Not Snowboard 2022",
		"formattedTitle": "dinosaurs-will-die-never-not-snowboard-",
		"brand": "dinosaurs",
		"description": "Do you have a hard time putting a label on your preferred style of snowboarding? A little bit park and a little bit of all-mountain, with trees, cat track lips, cliffs, and full-on sends sprinkled in-between? The Dinosaurs Will Die Never Not Snowboard is made for you. This directional twin is locked and loaded for aggressive all-mountain exploration with a heavy dose of freestyle capability. Snowboarding will Never Not be rad!",
		"image": "1653394229603.jpg",
		"price": "389.99",
		"sized": ["158", "150", "146"],
		"stock": 244,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber",
		"shape": "Directional Twin",
		"flex_rating": "Stiff",
		"core": "Wood"
	},
	{
		"title": "CAPiTA Navigator Snowboard 2022",
		"formattedTitle": "capita-navigator-snowboard-",
		"brand": "capita",
		"description": "We could all use a little direction sometime. Luckily the CAPiTA Navigator Snowboard is here to pave the way in the land of the steep and deep. This snow vessel is thoughtfully shaped with a sinking tapered tail that cuts through the fluff, a wide frame rockered nose that guides you above it all, and inlaid Cork Dampeners for added stability and vibration damping. Batten down the hatches, it's time to watch snow fly on the CAPiTA Navigator Snowboard.",
		"image": "1653394233558.jpg",
		"price": "407.96",
		"sized": ["138", "164", "150", "168"],
		"stock": 14,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freeride, Powder",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Carbon, Wood"
	},
	{
		"title": "Sims Distortion Snowboard 2022",
		"formattedTitle": "sims-distortion-snowboard-",
		"brand": "sims",
		"description": "If all-mountain freestyle is your game, the Sims Distortion Snowboard is here to play. With a spring camber profile, spin-happy Thin Tips, and pop boosting stringers of carbon and bamboo, this deck is ready to go. Bounce through trees, jib over side hits, and crush jump lines like it's your dang job.",
		"image": "1653394236617.jpg",
		"price": "403.75",
		"sized": ["150", "148", "158", "138", "142", "162"],
		"stock": 60,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Bamboo, Carbon, Wood"
	},
	{
		"title": "Ride Psychocandy x Akomplice Snowboard 2022",
		"formattedTitle": "ride-psychocandy-x-akomplice-snowboard-",
		"brand": "ride",
		"description": "The Ride Psychocandy x Akomplice Snowboard is a rad collab that we're stoked to get behind. Proceeds from this board will go to helping indigenous people in Columbia to protect their land from deforestation and development, bringing attention to global health awareness. It helps that the board absolutely rips, too. Available in unisex sizing, the Psychocandy is a directional all-mountain tool that absolutely crushes in deep snow and challenging terrain while remaining versatile enough to slash around as you wait for the next storm to roll in.",
		"image": "1653394241894.jpg",
		"price": "519.99",
		"sized": ["158", "150"],
		"stock": 23,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Flat/Rocker",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Carbon, Metal, Wood"
	},
	{
		"title": "Weston Switchback Splitboard 2022",
		"formattedTitle": "weston-switchback-splitboard-",
		"brand": "weston",
		"description": "The Weston Switchback Splitboard is a jack of all trades that maintains an edge in variable terrain and doesn't mind getting down and dirty in the backcountry. Its poplar wood core is on the heavier side of Weston's split cores, but provides the extra dampening, pop, and durability that many splitboards lack. If you find yourself picking your way through tree filled approaches, or just aren't sure what direction you want to take in backcountry riding, the Weston Switchback Splitboard is the perfect foray onto the skin track.",
		"image": "1653394245804.jpg",
		"price": "559.20",
		"sized": ["146", "138", "142", "158", "164", "148"],
		"stock": 208,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Splitboarding",
		"ability_level": "Beginner-Intermediate",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "K2 Party Platter x Tony Hawk x Birdhouse Snowboard 2022",
		"formattedTitle": "k2-party-platter-x-tony-hawk-x-birdhouse-snowboard-",
		"brand": "k2",
		"description": "Nobody parties like K2, so when they name a board the \"Party Platter\" you know you're gonna be in for some fun. This volume shifted board is designed to be ridden short and wide, and features a rocker-camber-rocker profile for extra energy in transition. Although it's a ton of fun anywhere on the mountain, the K2 Party Platter x Tony Hawk x Birdhouse Snowboard really comes into its own in tight trees, narrow chutes, and featured terrain. Add one-of-a-kind Tony Hawk x Birdhouse graphics and you have a collector's item you can both ride and cherish.",
		"image": "1653394249839.jpg",
		"price": "449.96",
		"sized": ["150", "142", "138", "146"],
		"stock": 210,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Powder",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Wood"
	},
	{
		"title": "Gentemstick Rocket Fish 144 Snowboard 2022",
		"formattedTitle": "gentemstick-rocket-fish-144-snowboard-",
		"brand": "gentemstick",
		"description": "Roll over creamy lips with ease, leave a sharp cut in fresh froth, and enjoy that feeling you get deep in your chest when the snow is so good that everything else melts away. The Gentemstick Rocket Fish 144 Snowboard is a true pow surfer that brings joy to every part of the mountain, from wide open fresh snow in Hokkaido to the wind lips of Mt. Hood Meadows. Its short length, wide outline, and stout tip serve up top-notch carving ability, along with a swallowtail that sinks into the snow to surf on wave after wave of fresh pow.",
		"image": "1653394254694.jpg",
		"price": "1,020.00",
		"sized": ["150", "146"],
		"stock": 0,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freeride, Powder",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "",
		"core": "Wood"
	},
	{
		"title": "Ride Smokescreen Snowboard 2022 - Used",
		"formattedTitle": "ride-smokescreen-snowboard----used",
		"brand": "ride",
		"description": "Don't let the smoke obscure your vision, the Ride Smokescreen Snowboard is the real deal, and a good deal at that. A great freeride platform, priced aggressively, and paired with some of Ride's best construction, the Smokescreen is on fire when it comes to having a good time in the mountains.",
		"image": "1653394258272.jpg",
		"price": "332.99",
		"sized": ["164", "148", "146", "162"],
		"stock": 91,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Bamboo, Carbon, Wood"
	},
	{
		"title": "Yes. Hybrid Snowboard 2023",
		"formattedTitle": "yes.-hybrid-snowboard-",
		"brand": "yes.",
		"description": "The Yes. Hybrid Snowboard mashes two old favorites together with a design that cherry-picks the best technology out there to create something entirely new. Combining the floaty, volume shifted design of the 420 with the grippy Tapered UnderBite outline originally unveiled on the PYL, the Hybrid transcends to a new level of resort versatility. Pow, chunder, groomers, or trees, the Yes. Hybrid Snowboard takes it all in stride.",
		"image": "1653394262109.jpg",
		"price": "599.95",
		"sized": ["138", "164", "150", "168"],
		"stock": 62,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride, Powder",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Wood"
	},
	{
		"title": "GNU Finest Asym C2X Snowboard 2023",
		"formattedTitle": "gnu-finest-asym-c2x-snowboard-",
		"brand": "gnu",
		"description": "When you're in the business of tossing tricks, the landing surface doesn't matter. That's why the GNU Finest Asym C2X Snowboard is a trick tossing machine that lands in powder just as well as it lands on smooth groomer park surfaces. As a matter of fact, it lands on chopped up mogul fields, slushy mank, and bulletproof ice pretty well too, if you've got the guts for it. The Finest is, simply put, the finest freestyle board you could ask for, ready to throw down whenever you are.",
		"image": "1653394264921.jpg",
		"price": "529.99",
		"sized": ["138", "142"],
		"stock": 246,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Asymmetrical, True Twin",
		"flex_rating": "Stiff",
		"core": "Wood"
	},
	{
		"title": "Moss Snowstick Mahi 50th Anniversary - Early Release Snowboard 2022",
		"formattedTitle": "moss-snowstick-mahi-50th-anniversary---early-release-snowboard-",
		"brand": "moss",
		"description": "Can you really replicate the feel of a surfboard on snow? That question has driven Moss for decades, and the Moss Snowstick Mahi 50th Anniversary Snowboard celebrates half a century of harmonious lines and perfect powder. The Mahi has been in the works from the start, as one of the original Moss snowboards that was never released. Fast-forward a few years and the rockered nose, poppy flex, and convex 3D edges are ready for modern snowsurfers looking to experience the freedom of the ocean all year long.",
		"image": "1653394268343.jpg",
		"price": "1,200.00",
		"sized": ["164", "142", "158"],
		"stock": 0,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride, Powder",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Flat",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Bamboo, Wood"
	},
	{
		"title": "Nidecker Beta Snowboard 2023",
		"formattedTitle": "nidecker-beta-snowboard-",
		"brand": "nidecker",
		"description": "What if your snowboard could launch from the snow like a bird of prey? What if it could slice through deep pow like a dolphin moving through the waves? For Nidecker, the answer lies in Biomimicry: incorporating shapes found in the natural world, and strategies honed over millennia through natural selection. It could mean learning from the structure of a bird’s wing in flight and applying the same principles to optimize lift and float, or analyzing the morphology of a penguin's stomach for a more fluid edge to edge feel. If it sounds simultaneously groundbreaking and obvious - as if the answer was staring us in the face all along - that's because it is. The Nidecker Beta Snowboard is built for freeride, with a notched swallowtail that allows for effortless float in deep snow. You were always meant to fly free, and this board makes it easier than ever.",
		"image": "1653394272653.jpg",
		"price": "479.95",
		"sized": ["150", "138", "162", "146"],
		"stock": 197,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Aramid (Kevlar®), Carbon, Wood"
	},
	{
		"title": "K2 Bottle Rocket Snowboard 2023",
		"formattedTitle": "k2-bottle-rocket-snowboard-",
		"brand": "k2",
		"description": "The K2 Bottle Rocket Snowboard is full featured freestyle deck but without the traditional camber underfoot. Built for riders who prefer the loose and flowy feel of rocker, this Rocket is ready to press and smear it's way to greatness. It's super lively and playful through turns, crazy easy to pivot, and still packs plenty of punch for popping off lips and stomping landings.",
		"image": "1653394276908.jpg",
		"price": "499.95",
		"sized": ["152"],
		"stock": 49,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Flat/Rocker",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Bamboo, Carbon, Wood"
	},
	{
		"title": "Nidecker Merc SE Snowboard 2022",
		"formattedTitle": "nidecker-merc-se-snowboard-",
		"brand": "nidecker",
		"description": "Whether you are out exploring corners of the mountain, exposing yourself to unknown and new terrain on your progression grind, or you're the rider who goes wherever the wind takes you — laps through the park, ripping trees, finding powder when it's there, the Nidecker Merc SE Snowboard was made for you. Designed to be a one-and-done quiver killer, the Merc is a mid-flex all-mountain board ready to answer any call of duty. Without being a powerlifter, riders can load up the CamRock in the core and tail with relative ease and receive ample response for big pop in their ollies and smooth and powerful carving. Exclusive to evo, the Nidecker Merc SE Snowboard is the best value on snow!",
		"image": "1653394280499.jpg",
		"price": "266.36",
		"sized": ["164"],
		"stock": 100,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional Twin",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "Dinosaurs Will Die Wizard Stick Snowboard 2022",
		"formattedTitle": "dinosaurs-will-die-wizard-stick-snowboard-",
		"brand": "dinosaurs",
		"description": "Powder is preferred. Always. But like many of us, the Dinosaurs Will Die Wizard Stick Snowboard appreciates whatever winter decides to lay down. There's not a condition, day, or side of the mountain where the Wizard Stick won't be suited to go full-on beast mode. This versatile directional twin comes in a variety of sizes so you can find the fit that best suits your style and needs.",
		"image": "1653394284400.jpg",
		"price": "359.99",
		"sized": ["164", "142", "162"],
		"stock": 60,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain, Freeride",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional Twin",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "Dinosaurs Will Die maeT Snowboard 2022",
		"formattedTitle": "dinosaurs-will-die-maet-snowboard-",
		"brand": "dinosaurs",
		"description": "Just like you, the Dinosaurs Will Die maeT Snowboard knows when it's time to play, and when it's time to work. With its general softer flex, the tip and tail of this true twin freestyle-forward board have the playfulness for buttery fun while keeping plenty of pop and energy. Built to thrive in the park and beyond, the lowride camberprofile means you'll have the power, snap, and stability to go head-to-head with any corner of the mountain.",
		"image": "1653394288534.jpg",
		"price": "299.99",
		"sized": ["138", "142", "168", "148", "162"],
		"stock": 15,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "Sims Nub JP Snowboard 2022",
		"formattedTitle": "sims-nub-jp-snowboard-",
		"brand": "sims",
		"description": "The top pick of some of Sims' most progressive riders, the Sims Nub JP Snowboard gets the nod for freeride trickery taken to its logical next step. With plenty of pop from its Traditional Camber shape and I-Carbon laminate, the Nub also uses Sims' fastest base and best Tri-Tex fiberglass layup. Throw in an exclusive topsheet found only at evo and this board is a strong contender for \"most freestyle fun you can have while not in the park\" honors.",
		"image": "1653394291592.jpg",
		"price": "501.50",
		"sized": ["152", "138", "162", "142", "158", "146"],
		"stock": 56,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain, Freeride",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Camber",
		"shape": "Directional Twin",
		"flex_rating": "Medium",
		"core": "Carbon, Wood"
	},
	{
		"title": "Nitro Squash Splitboard 2022",
		"formattedTitle": "nitro-squash-splitboard-",
		"brand": "nitro",
		"description": "There's no way around it, the Nitro Squash Splitboard is the most fun you can have in the backcountry. This board loves speed, and turning, and turning at speed - so much, in fact, that it's impossible to just putter around on. The Squash is a motivational speaker, a hype man, a wild scream into the night. It's equipped with straight up camber, a stiffer directional flex, and that mellow swallowtail - all designed to increase velocity in every snow condition. But there's something else, a distinct set of characteristics this board has that just makes it rip. Snow-sliding charisma, maybe, something hard to define but undeniable in effect. This one is so good it'll have you hooting and hollering up the skin track.",
		"image": "1653394295104.jpg",
		"price": "409.99",
		"sized": ["150", "148", "168"],
		"stock": 91,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Splitboarding",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Wood"
	},
	{
		"title": "Nitro Prime Raw Snowboard 2023",
		"formattedTitle": "nitro-prime-raw-snowboard-",
		"brand": "nitro",
		"description": "The Nitro Prime Raw Snowboard is a quiver busting all mountain ripper for riders seeking one board to rule them all. A directional twin shape combines with Nitro's snappy Power Core construction and Flat Out rocker profile for a versatile ride that serves up the goods in any conditions.",
		"image": "1653394300008.jpg",
		"price": "299.95",
		"sized": ["138", "142", "162", "152", "146", "148"],
		"stock": 40,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Flat/Rocker",
		"shape": "Directional Twin",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "K2 WWW Snowboard 2021",
		"formattedTitle": "k2-www-snowboard-",
		"brand": "k2",
		"description": "Download the K2 WWW Snowboard and plug into one of the finest freestyle tools in the game. The World Wide Weapon, as it's more commonly known, is arguably the most well known board in the K2 lineup, as it's easy to see why. This is a tried and tested jib machine that knows no bounds in the park. The ultralight Aspen Core is loaded with pop, the True Twin Combination Camber profile is tuned for park domination, and it's almost impossible to destroy – even after repeated slams into rails and features. Drop in on the WWW, you won't be sorry.",
		"image": "1653394305548.jpg",
		"price": "389.95",
		"sized": ["158", "152", "162", "148", "150", "168"],
		"stock": 90,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "Burton Family Tree 3D Double Dog Snowboard 2022",
		"formattedTitle": "burton-family-tree-3d-double-dog-snowboard-",
		"brand": "burton",
		"description": "Riding deep pow is a feeling that's hard to describe but impossible to forget. The Burton Family Tree 3D Double Dog Snowboard gives you more of that je ne sais quoi, with a 3D contoured \"V\" shape in the nose and a full concave tail that make this dog plane like a superboat bouncing along the lake surface at full tilt. Burton pays special attention to the fit and finish of the Family Tree boards - once you ride the Double Dog it'll be hard to go back.",
		"image": "1653394308985.jpg",
		"price": "508.69",
		"sized": ["138", "142", "146"],
		"stock": 249,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freeride, Powder",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Carbon, Wood"
	},
	{
		"title": "Burton Family Tree Hometown Hero Splitboard 2022",
		"formattedTitle": "burton-family-tree-hometown-hero-splitboard-",
		"brand": "burton",
		"description": "The backcountry holds a dirty little secret that Big Snowboard Inc™ doesn't want you to know. The truth is, it's not all rainbows and white rooms. In fact, it's kinda hard. For every pristine 2k of untouched pow, there's 10k of refrozen slop. For every panoramic, bluebird mountaintop, there are 10 blustery ridgelines that send you scrambling for the puffy buried deep in your pack. That's why it pays to have tool like the Burton Family Tree Hometown Hero Splitboard in your arsenal. It gives you the same the full-on charging, slashing, floating fun of the solid version, but in an upwardly mobile package that's ready for anything the backcountry throws at you. It won't make everything easy, but it'll turn those challenging days into something that looks a whole lot more like fun.",
		"image": "1653394313249.jpg",
		"price": "679.96",
		"sized": ["168", "146", "142", "138"],
		"stock": 1,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Splitboarding",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Carbon, Wood"
	},
	{
		"title": "Burton Family Tree Hometown Hero X Splitboard 2022",
		"formattedTitle": "burton-family-tree-hometown-hero-x-splitboard-",
		"brand": "burton",
		"description": "Burton's second-stiffest splitboard is the one most likely to be caught dropping those impossible looking lines on video. The Burton Family Tree Hometown Hero X Splitboard gets the next-level \"X\" treatment with an ultralight Mystery Glass layup and Dragonfly™ 600G core that helps it fly uphill just as well as it rips down. A splitboard for those who don't intend to mess around, the Hometown Hero X Split is looking for volunteers to become the vigilante hero of their local backcountry scene.",
		"image": "1653394317511.jpg",
		"price": "1,279.96",
		"sized": ["152", "150"],
		"stock": 0,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Splitboarding",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Carbon, Wood"
	},
	{
		"title": "Burton Family Tree Leader Board Splitboard 2022",
		"formattedTitle": "burton-family-tree-leader-board-splitboard-",
		"brand": "burton",
		"description": "Built to handle the burliest terrain you can access on foot, the Burton Family Tree Leader Board Splitboard maxes out the edge-hold and stability scale to let you shred the steepest and most technical lines on the planet. Engineered with a stout flex, 10mm of taper, and tons of torsional stability, the Leader Split brings freeride comp style to the deep backcountry. If you need one, you probably already know it.",
		"image": "1653394321641.jpg",
		"price": "639.96",
		"sized": ["146", "142", "168", "152"],
		"stock": 45,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freeride",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Wood"
	},
	{
		"title": "Salomon HPS - Louif Paradis Snowboard 2023",
		"formattedTitle": "salomon-hps---louif-paradis-snowboard-",
		"brand": "salomon",
		"description": "All-mountain freestyle is a hard niche to do well, but the Salomon HPS - Louif Paradis Snowboard has some excellent inspiration in it's namesake rider. Rock Out Camber has quick turn initation and a freestyle feel and the wide, tapered directional shape excels in deep pow. The Popster core and ABC Wrapper construction with snappy bamboo boosts your pop off lips and the flex is stiff enough to land those big off-piste jumps with ease.",
		"image": "1653394325742.jpg",
		"price": "649.95",
		"sized": ["148", "146", "138"],
		"stock": 72,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freeride, Powder",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Bamboo, Cork, Wood"
	},
	{
		"title": "Salomon HPS - Takaharu Nakai Snowboard 2023",
		"formattedTitle": "salomon-hps---takaharu-nakai-snowboard-",
		"brand": "salomon",
		"description": "For a powder board with a little more versatility, you can't go wrong with the Salomon HPS - Takaharu Nakai Snowboard. The tapered directional shape is more all-purpose than a swallowtail but still has tons of float thanks to the wide waist and rockered nose. Powder Camber gives your back foot precise control when you're leaning back in deep pow and the Quadratic Sidecut makes for easy edge-to-edge transitions despite the width. Salomon's Hillside Project has some crazy good boards and Takaharu Nakai's design earns it place in that esteemed lineup.",
		"image": "1653394329359.jpg",
		"price": "649.95",
		"sized": ["164"],
		"stock": 63,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride, Powder",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Bamboo, Carbon, Cork, Wood"
	},
	{
		"title": "Salomon Sickstick Snowboard 2023",
		"formattedTitle": "salomon-sickstick-snowboard-",
		"brand": "salomon",
		"description": "There is truly no place where the Salomon Sickstick Snowboard doesn't excel - it's basically in the name. The stiff flex cuts through the most tracked out chunder and the Quadralizer sidecut and reduced tail swing weight nail high speed carves like a champ. The bamboo rails and Popster core are snappy and fun, and you can ride the fall line to the trees to the groomers with ease. And let's be honest, we always say that topsheets don't matter but the fact that this board is dang good-looking sure doesn't hurt.",
		"image": "1653394333490.jpg",
		"price": "649.95",
		"sized": ["164", "158", "168", "152", "142"],
		"stock": 39,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride, Powder",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Bamboo, Cork, Wood"
	},
	{
		"title": "GNU Essential Service Snowboard 2022 - Used",
		"formattedTitle": "gnu-essential-service-snowboard----used",
		"brand": "gnu",
		"description": "One board that's not going out of style any time soon, in this economy or any other, is the GNU Essential Service Snowboard. A directional speed demon for freeriders seeking out secret stashes and sketchy steeps. The C2 Hybrid profile perfectly blends rocker and camber so you can rip everything from fresh powder to spicy chunder fields, while Magne-Traction steak knife edges allow you to slice your line like a medium-rare filet mignon no matter how firm the snow. A portion of the proceeds from this board goes to @theserviceboard to mentor kids and create awesome outdoor experiences, much like the ones you'll get from the GNU Essential Service Snowboard.",
		"image": "1653394336472.jpg",
		"price": "289.79",
		"sized": ["150"],
		"stock": 121,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain, Freeride",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber/Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Wood"
	},
	{
		"title": "Arbor Westmark Rocker Snowboard 2022",
		"formattedTitle": "arbor-westmark-rocker-snowboard-",
		"brand": "arbor",
		"description": "Riding the Arbor Westmark Rocker Snowboard feels like what would happen if you could take your skateboard down to your favorite point break and start tailsliding the lip of every wave that rolls through. The full rocker profile gives it a super flowy feeling, easy turn initiation, and a bit of float when the snow starts falling, but first and foremost, this thing is all about freestyle. Its big blunted tips give it a nice stable feeling on rails and jumps, and the sturdy medium flex pattern makes this a perfect board for all mountain jibbing and park progression.",
		"image": "1653394340113.jpg",
		"price": "422.99",
		"sized": ["150", "162"],
		"stock": 97,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "Rossignol ONE Snowboard 2022",
		"formattedTitle": "rossignol-one-snowboard-",
		"brand": "rossignol",
		"description": "Looking at three different boards? Stop. Close all your tabs. The Rossignol ONE Snowboard rules all conditions. You need a board that can carve corduroy just as well as it hits powder stashes when the surprise storm hits. It's something you can throw into your car without a thought and be happy all day long. A L.I.T.E. Frame wood core and directional twin shape provide a playful yet smooth ride that doesn't weigh you down. Plus AmpTek All-Mountain Rocker has soft tips and a stiffer waist for float where you need it and stability where you don't. Hit any conditions with ease thanks to the Rossignol ONE Snowboard.",
		"image": "1653394344508.jpg",
		"price": "549.95",
		"sized": ["150", "152"],
		"stock": 182,
		"type": "snowboard",
		"gender": "men",
		"terrain": "All-Mountain",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional Twin",
		"flex_rating": "Stiff",
		"core": "Polyurethane (PU), Wood"
	},
	{
		"title": "Burton Family Tree Pow Wrench Splitboard 2022",
		"formattedTitle": "burton-family-tree-pow-wrench-splitboard-",
		"brand": "burton",
		"description": "Talk about first world problems - there are plenty of awesome powder boards, but few days when you can actually get more than a handful of untracked turns at the area. But wait, we can let you in on a little secret: there's always untracked snow somewhere on our little corner of the solar system. The Burton Family Tree Pow Wrench Splitboard is the tool of choice for powder aficionados who want the goods and are willing to work for it. Now you can burn some calories AND be the first and only customer in that powder choked chute. This is the same awesome shape as the regular Pow Wrench, with the Hex-shaped tail cutout and long, wide nose, it just comes apart for the trip uphill.",
		"image": "1653394348532.jpg",
		"price": "639.96",
		"sized": ["164", "150", "138"],
		"stock": 113,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Splitboarding",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Flat",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Wood"
	},
	{
		"title": "Jones Ultracraft Snowboard 2023",
		"formattedTitle": "jones-ultracraft-snowboard-",
		"brand": "jones",
		"description": "The Hovercraft has rightly earned cult status for its nimble feel and versatile performance, but serious freeriders will want to skip a few steps and jump straight to the Jones Ultracraft Snowboard. It riffs on the same shape, with the addition of premium materials like basalt stringers and an ash veneer topsheet that reduce chatter and smooth out the ride. The 3D Contour Base 3.0 and directional rocker profile guarantee float and fluidity in pow, while the long side-cut and short, stiff tail are perfect for that no-speed-limit feel when you open up the throttle. If you're looking for a Goldilocks big mountain crusher for all occasions, you're looking for the Ultracraft.",
		"image": "1653394352240.jpg",
		"price": "699.95",
		"sized": ["152", "138", "142", "146", "168", "162"],
		"stock": 82,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freeride, Powder",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Basalt, Carbon, Wood"
	},
	{
		"title": "K2 Medium Snowboard 2023",
		"formattedTitle": "k2-medium-snowboard-",
		"brand": "k2",
		"description": "The K2 Medium Snowboard is a freestyle fanatic. It's a high level twin loaded with some of K2's best technology, from the edge-gripping Carbon DarkWeb to the pop boosting Ollie Bar. It's a dedicated freestyle board that kills it in the park and flows down groomers with style and finesse. If rallying around the resort tricking off of everything in sight sounds like your idea of a good time, the Medium is your maximum method of madness.",
		"image": "1653394356193.jpg",
		"price": "529.95",
		"sized": ["148", "138", "168", "152", "162"],
		"stock": 69,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Camber",
		"shape": "True Twin",
		"flex_rating": "Medium",
		"core": "Bamboo, Carbon, Wood"
	},
	{
		"title": "Rome Uprise Splitboard 2023",
		"formattedTitle": "rome-uprise-splitboard-",
		"brand": "rome",
		"description": "Standing in line at the resort gives you plenty of time to ponder your situation. What if there was another path, a road less travelled? Well, friend, you're in for a treat. The Rome Uprise Splitboard is built to feed your habit without having to deal with the crowds at the resort. Crafted with Bamboo HotRods and Rome's versatile Free-the-Ride Camber profile, this split offers handles the skin track with ease and slays when you point it down. Problem solved.",
		"image": "1653394359496.jpg",
		"price": "599.95",
		"sized": ["152"],
		"stock": 159,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Splitboarding",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Stiff",
		"core": "Bamboo, Wood"
	},
	{
		"title": "Moss Snowstick Wing Pin 59 Snowboard 2022",
		"formattedTitle": "moss-snowstick-wing-pin-59-snowboard-",
		"brand": "moss",
		"description": "Surf your favorite mountains just like the waves on the Moss Snowstick Wing Pin 59 Snowboard. Made with high quality materials and a unique surfy feel, this board is modeled to emulate the smooth floaty feeling of riding the surf. Its directional snow surf camber profile sets peak camber closer to your front foot for speedy response and soulful carves in fresh snow.",
		"image": "1653394363517.jpg",
		"price": "1,040.00",
		"sized": ["164"],
		"stock": 0,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Powder",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber",
		"shape": "Directional",
		"flex_rating": "Medium",
		"core": "Bamboo, Wood"
	},
	{
		"title": "K2 World Peace Snowboard 2023",
		"formattedTitle": "k2-world-peace-snowboard-",
		"brand": "k2",
		"description": "A lot of people think the key to world peace is something esoteric like empathy, or brotherly love. But what they don't realize is that the actual solution is park snowboarding. Yeah that's right. If we could just build a big enough terrain park and give everyone the feeling of landing their first ever 360, all at the same time, there would never be another war, ever again. But we can't get to this utopia all at once, so to start things off, get on your K2 World Peace Snowboard and land your first 360. Or your 360th 360. Either way, you're doing your part and spreading the good vibes.",
		"image": "1653394367072.jpg",
		"price": "429.95",
		"sized": ["150", "148", "162", "146", "142"],
		"stock": 222,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle",
		"ability_level": "Intermediate-Advanced",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "True Twin",
		"flex_rating": "Soft",
		"core": "Wood"
	},
	{
		"title": "Jones Ultra Mountain Twin Snowboard 2023",
		"formattedTitle": "jones-ultra-mountain-twin-snowboard-",
		"brand": "jones",
		"description": "You can take the rider out of the park, but you can't take the park out of the rider. If you've graduated to the steep and deep but still see the mountain as one giant terrain park, then the Jones Ultra Mountain Twin Snowboard is for you. With a versatile CamRock profile and a powerful flex, the Ultra Mountain Twin is ideal for the expert freerider who likes to lay down big tricks, spins, and butters off every natural feature without sacrificing float in pow or stability for rowdy runouts. Built with new freeride / freestyle pack inserts that let you switch up your stance as conditions change, the Ultra Mountain Twin is your all-mountain freestyle weapon for all occasions.",
		"image": "1653394370939.jpg",
		"price": "649.95",
		"sized": ["146", "148", "162", "142"],
		"stock": 219,
		"type": "snowboard",
		"gender": "men",
		"terrain": "Freestyle, All-Mountain, Freeride",
		"ability_level": "Advanced-Expert",
		"rocker_type": "Rocker/Camber/Rocker",
		"shape": "Directional Twin",
		"flex_rating": "Very Stiff",
		"core": "Bamboo, Basalt, Wood"
	}
]
