[
	{
		"title": "thirtytwo Jones MTB Boa Snowboard Boots 2023",
		"formattedTitle": "thirtytwo-jones-mtb-boa-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "When you're dropping hairball lines in the middle of nowhere and using a split to get to the goods, you need a super burly boot with enough articulation to skin with. In other words, you need the thirtytwo Jones MTB Boa Snowboard Boots, designed and used by the guy who pretty much invented this type of riding. With a pedal-to-the-metal \"10\" flex, dual Boa closures, a full length gaiter to keep snow and ice at bay, and a flexible walk mode collar for the uphills, this purpose-built tool is as unique as it is practical.",
		"image": "1653400044990.jpg",
		"price": "699.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 206,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Very Stiff",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Ion Leather Snowboard Boots 2022",
		"formattedTitle": "burton-ion-leather-snowboard-boots-",
		"brand": "burton",
		"description": "Dress it up like Chris Tucker in Rush Hour 2 and snake your way down the toughest terrain in the Burton Ion Leather Snowboard Boots. These puppies have the fly leather look that only a true performer can pull off, and an aggressive flex that makes for incredibly responsive riding, while heat-moldable Life Liners and Tuff Cuffs are guaranteed to keep your heels and ankles locked in at high speeds. Luckily, the good looks and high-performance of these boots don't come at the cost of comfort, with Total Comfort construction ensuring an instantly broken-in feel from day one so you can step right out of the dressing room and knock 'em dead on the big stage. If you ride with the tenacity of a bucking bronco and the precision of Michael Jackson's tip-toes, then the Burton Ion Leather Snowboard Boots are right up your alley!",
		"image": "1653400048029.jpg",
		"price": "589.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 49,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Quick-Pull",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton SLX Snowboard Boots 2022",
		"formattedTitle": "burton-slx-snowboard-boots-",
		"brand": "burton",
		"description": "The Burton SLX Snowboard Boots combine Burton's top tech and best materials in a sleek speed-lace design that's arguably the most versatile model on the shelf. Everything about the SLX reeks of performance and comfort, from the top-end LIFE+ Liner and Level 3 EVA footbed to the Firm Flex Tongue and Welded Backstay. When snowboarding means the world to you, the SLX is the boot you seek.",
		"image": "1653400052108.jpg",
		"price": "575.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 3,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Quick-Pull",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo Jones MTB Snowboard Boots 2022",
		"formattedTitle": "thirtytwo-jones-mtb-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Jones MTB Snowboard Boots are as unique as Mr. Jones himself. These are splitboarding-specific boots designed to access the most inhospitable terrain on the planet, climb and ride the burliest mountain you can find there, and return safely. The one-of-a-kind Walk Mode Collar is held in place by a Boa® TX3 lace system for the ride down, but hinges freely for skinning and climbing. A full-length gaiter protects the entire front of the boot, because wet feet = misery. A next-level Vibram® sole gives you the confidence you need when you absolutely cannot slip and fall. And so on. The MTB is just what Jeremy ordered, and just what you need when the going gets insanely tough.",
		"image": "1653400055890.jpg",
		"price": "560.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 45,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Very Stiff",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Ion Step On Snowboard Boots 2022",
		"formattedTitle": "burton-ion-step-on-snowboard-boots-",
		"brand": "burton",
		"description": "It makes sense that one of the most responsive boots on the planet would have a Step On option: what's the point of instantaneous inputs and maximum response if it's all going to be lost in the slop of straps? The Burton Ion Step On Snowboard Boots eliminate the hassle of straps and let you have a real sole-ful connection with your board. Just step on and slide off. The Ion comes in a firm flex with extra heel retention from the Snugger Strap, so just because its super easy to use, don't think for a second that it's not a responsive, high performing all-mountain boot. This one's definitely worthy of the classic name Ion!",
		"image": "1653400058921.jpg",
		"price": "559.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 116,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Quick-Pull",
		"binding_style": "Step-On"
	},
	{
		"title": "K2 Waive Snowboard Boots 2023",
		"formattedTitle": "k2-waive-snowboard-boots-",
		"brand": "k2",
		"description": "If you're a hardcore backcountry rider but you'd never dream of hard booting, K2 has an answer for you. The K2 Waive Snowboard Boots is a specifically designed backcountry snowboard boot that crushes the skin track and gives you in-bounds board feel on the way down. Borrowing from ski boot tech, the Waive features a Boa powered walk mode to increase range of motion on the way up without sacrificing any of the stiff flexing power transfer. Cap it all off with a rugged Vibram outsole and you've got yourself a touring boot for the modern era.",
		"image": "1653400061509.jpg",
		"price": "529.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 110,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Ion Step On Snowboard Boots 2021",
		"formattedTitle": "burton-ion-step-on-snowboard-boots-",
		"brand": "burton",
		"description": "Wearing these boots will help you keep your ion the prize, instead of looking around for the tool bench every time you get to the chair. The Burton Ion Step On Snowboard Boots eliminate the hassle of straps and let you have a real sole-ful connection with your board. Just step on and slide off. The Ion comes in a firm flex with extra heel retention from the Snugger Strap, so just because its super easy to use, don't think for a second that it's not a responsive, high performing all-mountain boot.",
		"image": "1653400065309.jpg",
		"price": "529.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 32,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Quick-Pull",
		"binding_style": "Step-On"
	},
	{
		"title": "Burton Ion Step On Snowboard Boots 2021 - Used",
		"formattedTitle": "burton-ion-step-on-snowboard-boots----used",
		"brand": "burton",
		"description": "Wearing these boots will help you keep your ion the prize, instead of looking around for the tool bench every time you get to the chair. The Burton Ion Step On Snowboard Boots eliminate the hassle of straps and let you have a real sole-ful connection with your board. Just step on and slide off. The Ion comes in a firm flex with extra heel retention from the Snugger Strap, so just because its super easy to use, don't think for a second that it's not a responsive, high performing all-mountain boot.",
		"image": "1653400069022.jpg",
		"price": "503.45",
		"sized": ["S", "M", "L", "XL"],
		"stock": 158,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Quick-Pull",
		"binding_style": "Step-On"
	},
	{
		"title": "K2 Aspect Snowboard Boots 2023",
		"formattedTitle": "k2-aspect-snowboard-boots-",
		"brand": "k2",
		"description": "The K2 Aspect Snowboard Boots are badass boots that are built to handle whatever the raddest riders on the planet can throw at them. With a super stiff flex, a traditional lacing system, and a Boa-powered Intuition liner, they start off with everything you're looking for in a resort boot. Then, they add in everything you dreamed of but couldn't hope to ask for in a backcountry boot. They feature heat radiating liners that will make you the envy of all your friends while camped out for multi day missions, as well as Vibram Mountaineer outsoles that are simply incredible. They're straight off a mountaineering boot: stiff and grippy for traction on varied terrain, and best of all, crampon compatible. So get these on, get out there, and get after it.",
		"image": "1653400072717.jpg",
		"price": "499.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 208,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Very Stiff",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Ride Trident Boa Snowboard Boots 2023",
		"formattedTitle": "ride-trident-boa-snowboard-boots-",
		"brand": "ride",
		"description": "The Ride Trident Boa Snowboard Boots stake a bold claim for biggest, baddest Boa boots in the biz. Pairing a powerful flex with super comfy Intuition™ Trap Wrap Liners, the Tridents are nailed on for all day comfort and performance, and that's before you get to a triple Boa beatdown designed to keep that pesky heel securely locked in for the duration. If you demand the best and you're done wrangling crusty laces with frozen fingers, these are the boots.",
		"image": "1653400076383.jpg",
		"price": "499.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 9,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Very Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Ion Snowboard Boots 2021",
		"formattedTitle": "burton-ion-snowboard-boots-",
		"brand": "burton",
		"description": "Crank up the voltage and conduct your descent down the most volatile lines with the Burton Ion Snowboard Boots. These powerhouses pack an aggressive flex that makes for incredibly responsive riding, while the heat-moldable Life Liners and Tuff Cuffs keep your heels and ankles locked in at lightning speeds. Fortunately, good looks and high-performance don't come at the cost of comfort. Total Comfort construction ensures an instantly broken-in feel from day one, so you can step in and charge without dilly-dallying. If you ride with the tenacity of a raging bull and the precision of Bob Ross's paintbrush, then the Burton Ion Snowboard Boots should be in your wheelhouse.",
		"image": "1653400080285.jpg",
		"price": "485.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 53,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Quick-Pull",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "K2 Thraxis Snowboard Boots 2023",
		"formattedTitle": "k2-thraxis-snowboard-boots-",
		"brand": "k2",
		"description": "The K2 Thraxis Snowboard Boots are some bad mama jamas. Topping off the stiffness scale with a 10/10 flex rating, these things offer dialed precision for hard charging descents. It's a full Boa setup inside and out for a super snug fit, and it's supported by an Intuition Pro Foam liner and a Vibram outsole. Packed with name-brand tech and premium construction, these boots are the cream of the crop for crazy carving and furious freeriding.",
		"image": "1653400084556.jpg",
		"price": "479.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 107,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Very Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Driver X Snowboard Boots 2022",
		"formattedTitle": "burton-driver-x-snowboard-boots-",
		"brand": "burton",
		"description": "A high-performing vehicle only reaches it's potential with the right driver behind the wheel, so step into the Burton Driver X Snowboard Boots and make 'em purr. Stiff, responsive, and surefooted as a mountain goat, these powerhouses are built to throw down on the biggest, most technical lines around and come out the other side demanding more. Imprint™ 3 Liners easily form to your feet and legs, while the extra burly flex supports your tear down committing terrain. For ultimate power and control through every turn, let the Burton Driver X Snowboard Boots be your guide.",
		"image": "1653400088181.jpg",
		"price": "459.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 226,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Very Stiff",
		"lacing_system": "Quick-Pull",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Ride Trident Snowboard Boots 2022",
		"formattedTitle": "ride-trident-snowboard-boots-",
		"brand": "ride",
		"description": "The Ride Trident Boa Snowboard Boots are ready to throw down as hard as you do, any time, any place. A new Intuition® Trap Wrap liner delivers unbelievable fit and heel hold, and the fiber Reinforced Flex Slime Tongue™ provides rebound and damping while keeping the flex super stiff. Now boasting a grippier Michelin® Traverse outsole for your booting pleasure, the Trident is the perfect choice to conquer the backcountry lines you've been dreaming of.",
		"image": "1653400092029.jpg",
		"price": "449.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 213,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Very Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Ride The 92 Snowboard Boots 2023",
		"formattedTitle": "ride-the-92-snowboard-boots-",
		"brand": "ride",
		"description": "If you're thirsty for inspiration in your riding, it never hurts to look to the past. The Ride The 92 Snowboard Boots are a new take on an old classic, rooted in Ride's rich heritage of innovation in the snowboarding world. These throwbacks have a solid, do-it-all mid flexing design to go with the proven Boa® H4 Focus Fit System, not to mention the heat moldable Intuition® Mobile Wrap liner and Michelin® Fiberlite sole to keep your heel locked in and your feet firmly planted on the snow, right where they belong.",
		"image": "1653400094824.jpg",
		"price": "449.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 96,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "K2 Thraxis Clicker X HB Snowboard Boots 2022",
		"formattedTitle": "k2-thraxis-clicker-x-hb-snowboard-boots-",
		"brand": "k2",
		"description": "Throw your burliest lines and biggest drops at the K2 Thraxis Clicker X HB Snowboard Boots, and watch them handle it. This is K2's most aggressive Clicker boot, complete with H4 Focus Boa® System, a rubber reinforced Flex Zone upper with Endo™ 2.0 construction, and a fully moldable Intuition® SpaceHeater™ liner. If you've pooh-poohed step-in systems in the past, the Thraxis Clicker X HB may surprise you; this boot can run with the biggest dogs around.",
		"image": "1653400098721.jpg",
		"price": "439.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 115,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Very Stiff",
		"lacing_system": "Boa®",
		"binding_style": "K2 Clicker"
	},
	{
		"title": "Nitro Chase Dual Boa Snowboard Boots 2023",
		"formattedTitle": "nitro-chase-dual-boa-snowboard-boots-",
		"brand": "nitro",
		"description": "The Nitro Chase Dual Boa Snowboard Boots represent the pinnacle of BOA convenience and performance. These everyday, all mountain slayers offer a more responsive and professional fit than any of Nitro's BOA boots without skimping on the all day comfort you expect from their superb Cloud 9 Liner. If you're looking for the best, look no further than the Nitro Chase Dual Boa Snowboard Boots.",
		"image": "1653400102567.jpg",
		"price": "439.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 82,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Photon Step On Wide Snowboard Boots 2022",
		"formattedTitle": "burton-photon-step-on-wide-snowboard-boots-",
		"brand": "burton",
		"description": "We're still waiting on those hoverboards they promised us in the 80's, but the future has come to snowboarding and it goes by the name Burton Photon Step On Snowboard Boots. With a firm, responsive flex, the Photons cater to aggressive riders who like to stay in full control of their line, no matter where they point it. An Imprint™ 3 liner featuring Ultralon heat-moldable foam ensures these boots remain comfortable, warm and perfectly contoured to your feet, season after season. Burton Photons are synonymous with precision and control - these Step Ons are no different, they just add convenience to the mix!",
		"image": "1653400106255.jpg",
		"price": "439.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 88,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Step-On"
	},
	{
		"title": "Burton Photon Step On Snowboard Boots 2022",
		"formattedTitle": "burton-photon-step-on-snowboard-boots-",
		"brand": "burton",
		"description": "We're still waiting on those hoverboards they promised us in the 80's, but the future has come to snowboarding and it goes by the name Burton Photon Step On Snowboard Boots. With a firm, responsive flex, the Photons cater to aggressive riders who like to stay in full control of their line, no matter where they point it. An Imprint™ 3 liner featuring Ultralon heat-moldable foam ensures these boots remain comfortable, warm and perfectly contoured to your feet, season after season. Burton Photons are synonymous with precision and control - these Step Ons are no different, they just add convenience to the mix!",
		"image": "1653400109219.jpg",
		"price": "439.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 4,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Step-On"
	},
	{
		"title": "Salomon Echo Dual Boa Snowboard Boots 2023",
		"formattedTitle": "salomon-echo-dual-boa-snowboard-boots-",
		"brand": "salomon",
		"description": "If you're on the hunt for new boots, you might as well help the planet out too. The Salomon Echo Dual Boa® Snowboard Boots are made for all around versatility with eco-friendly materials from the inside out. The dual Boa® system is extra supportive and easy to use, and the fully heat-moldable liner provides the most dialed fit of any boot around. The MTN GOAT and Contagrip® outsoles provide long-lasting durability and traction too, so you can keep these boots out of the landfill for many seasons to come.",
		"image": "1653400112983.jpg",
		"price": "429.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 182,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Ride Insano Snowboard Boots 2023",
		"formattedTitle": "ride-insano-snowboard-boots-",
		"brand": "ride",
		"description": "You're the one breaking trail up the bootpack to get first tracks on your favorite spine. You're the one dropping in without hesitation, airing without checking your speed, and stomping without ruffling a single. damm. feather. You mount your steed in the Ride Insano Snowboard Boots, because nothing less than the best will do. When your riding style is full-charge, full-time, you need a boot you can trust with your life, a boot that flexes like rebar and holds your foot in place no matter how chunderous the runout. The Ride Insano Snowboard Boots are as burly as they get - just what the doctor ordered.",
		"image": "1653400116836.jpg",
		"price": "429.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 187,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Very Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Salomon Echo Dual Boa Wide Snowboard Boots 2023",
		"formattedTitle": "salomon-echo-dual-boa-wide-snowboard-boots-",
		"brand": "salomon",
		"description": "If you're on the hunt for the perfect high-volume boots, you might as well do the planet a favor in the process. The Salomon Echo Dual Boa® Wide Snowboard Boots are made for exploring the mountain and feature eco-friendly materials from the inside-out. The dual Boa® system provides a dialed fit and is easy to use, and the fully heat-moldable liner makes foot woes a thing of the past. The MTN GOAT and Contagrip® outsoles provide long-lasting durability and traction too, making these boots the obvious choice for your wallet and the planet.",
		"image": "1653400120511.jpg",
		"price": "429.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 210,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo TM-Two Jones Snowboard Boots 2023",
		"formattedTitle": "thirtytwo-tm-two-jones-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "A new split-friendly design for riders who don't always straightline 60 degree spines, as well as more playful sorts and those with smaller frames, the thirtytwo TM-Two Jones Snowboard Boots are based on the tried-and-true TM-Two boot with a flex of 7 out of 10 (the MTB is a 10). A walk mode collar and grippy Vibram® sole make getting to the goods a reality rather than a hope, and a smooth zip-up gaiter keeps the front of the boot clear of snow and ice. Get it so you can get there.",
		"image": "1653400123587.jpg",
		"price": "424.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 192,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Traditional",
		"binding_style": "Strap"
	},
	{
		"title": "Salomon Malamute Snowboard Boots 2023",
		"formattedTitle": "salomon-malamute-snowboard-boots-",
		"brand": "salomon",
		"description": "The Salamon Malamute Snowboard Boots are Salomon's premiere boots for freeriders. A stiff, stable upper with supportive Powerframe and Power Bars is ready for fast, deep carves and the MTN GOAT and Contagrip® outsoles will hold up for plenty of sidecountry hikes. The Precision Harness locks your heel in place for maximum control and the fully-customizable liner can be heat-molded for a dialed fit that's comfy all day long.",
		"image": "1653400126478.jpg",
		"price": "419.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 108,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Very Stiff",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "DC Judge Boa Step On Snowboard Boots 2022",
		"formattedTitle": "dc-judge-boa-step-on-snowboard-boots-",
		"brand": "dc",
		"description": "Judge, jury, executioner. This is the boot that sets the tempo. The go-to boot for DC's stacked roster of team riders, the Judge Boa Step On Snowboard Boots provides that impeccable balance of responsiveness and smooth flex that progressive riders are drawn to - enough power to react quickly on steep faces, but with the give and stability for pop and controlled style. Take control of your setup and put the hammer down - the DC Judge Boa Step On Snowboard Boots are the boots you need to take your riding to the stratosphere.",
		"image": "1653400130201.jpg",
		"price": "419.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 194,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Step-On"
	},
	{
		"title": "thirtytwo TM-Two Double Boa Snowboard Boots 2023",
		"formattedTitle": "thirtytwo-tm-two-double-boa-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "The thirtytwo TM-Two Double Boa Snowboard Boots kill it day in and day out, with their mid-stiff flex and dial-up Boa® comfort, so you can just be yourself and concentrate on the snowboarding. Just buy them and don't overcomplicate things.",
		"image": "1653400133104.jpg",
		"price": "419.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 123,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo TM-Two Double Boa Wide Snowboard Boots 2023",
		"formattedTitle": "thirtytwo-tm-two-double-boa-wide-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "Built at the request of team rider Bode Merrill, and ready to rip for wider feet worldwide, the thirtytwo TM-Two Double Boa Wide Snowboard Boots feature a powerful \"7\" flex and dual Boa® closure for the ultimate in convenience and on-the-fly adjustment. The classic TM-Two features you've grown to know and love are all still here, plus an extra 18mm in toebox space.",
		"image": "1653400136937.jpg",
		"price": "419.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 223,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo TM-Two Double Boa Wide Merrill Snowboard Boots 2023",
		"formattedTitle": "thirtytwo-tm-two-double-boa-wide-merrill-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "Bode Merrill asked for this boot, and wide-footed riders everywhere are the beneficiaries. The thirtytwo TM-Two Double Boa Wide Merrill Snowboard Boots make even the widest feet on the block happy campers, and the super versatile \"7\" flex rules everywhere from the backcountry to the park.",
		"image": "1653400140567.jpg",
		"price": "419.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 31,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "K2 Thraxis Snowboard Boots 2022",
		"formattedTitle": "k2-thraxis-snowboard-boots-",
		"brand": "k2",
		"description": "The K2 Thraxis Snowboard Boots are designed for big lines and bigger ambitions. The most aggressive of K2's freeride boots combines a very stiff flex with all the top shelf features you expect, like Intuition® SpaceHeater™ liners and Boa® Conda closures for a quick and supportive fit every time out. The Thraxis gives as good as it gets, and remains the standard for power riding both in and out of bounds.",
		"image": "1653400144320.jpg",
		"price": "407.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 97,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Very Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "Burton Tourist Snowboard Boots 2022",
		"formattedTitle": "burton-tourist-snowboard-boots-",
		"brand": "burton",
		"description": "Riders looking for a hassle-free experience on splitboard tours should take a serious look at the Burton Tourist Snowboard Boots. They deliver an ultra-smooth skin up with improved negative flex and impressive traction in sketchy zones thanks to the Rubber Ice Spikes. A full-custom Life Liner provides top-notch cushioning so you can bet your apres-beer you'll be ready to ride the next day. Tour-specific features and the time-tested comfort of Burton's boot construction makes the Burton Tourist Snowboard Boots quite the catch for determined splitters.",
		"image": "1653400148427.jpg",
		"price": "403.71",
		"sized": ["S", "M", "L", "XL"],
		"stock": 132,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Quick-Pull"
	},
	{
		"title": "thirtytwo TM-Three Snowboard Boots 2021",
		"formattedTitle": "thirtytwo-tm-three-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "From park sessions to pow laps, the thirtytwo TM-Three Snowboard Boots give you the ultimate combo of support, flex, and durability. Elite liners give you a consistent fit all season while Tongue Tension+ provides full control through every turn. The thirtytwo TM-Three Snowboard Boots are happy to take you anywhere on the mountain, thanks to the Exo Armor and Storm Shield that help withstand everything the wonderful fury of nature brings. Send all day.",
		"image": "1653400152131.jpg",
		"price": "399.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 84,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "K2 Aspect Snowboard Boots 2022",
		"formattedTitle": "k2-aspect-snowboard-boots-",
		"brand": "k2",
		"description": "A burly boot with its eyes set on the backcountry, the K2 Aspect Snowboard Boots are built with big mountain durability in mind. They come with a heavy duty Vibram® Mountaineer outsole built for tromping over glacial talus, traditional lacing, and liners designed with a grippy bottom so you can chill in them while snow camping. When your idea of fun entails days or weeks away from the trailhead, much less the lifts, the Aspects belong on your feet.",
		"image": "1653400156552.jpg",
		"price": "399.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 100,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Very Stiff",
		"lacing_system": "Traditional"
	},
	{
		"title": "K2 Orton Snowboard Boots 2023",
		"formattedTitle": "k2-orton-snowboard-boots-",
		"brand": "k2",
		"description": "Just like Goldilocks' preferred porridge, the K2 Orton Snowboard Boots are just right. They flex is stiff and responsive, but soft enough to allow for a bit of tweaking and flow through powder and playful terrain. They're packed with high-end tech and meant for serious rippers (as Sage Kotsenburg's signature boot, you'd expect nothing less), but maintain a bit of freestyle feel that makes them a popular choice for riders of many different styles.",
		"image": "1653400160809.jpg",
		"price": "399.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 27,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "K2 Holgate Snowboard Boots 2023",
		"formattedTitle": "k2-holgate-snowboard-boots-",
		"brand": "k2",
		"description": "The K2 Holgate Snowboard Boots are super solid, stiff flexing, and precision fitting. They offer all-mountain riders a high-end option loaded with features and performance. Featuring a dual Boa fit system for customizable fit, an Intuition SpaceHeater liner for added warmth, and a Vibram outsole for grip and dampening, these boots will keep you comfortable and powerful while you shred the whole mountain.",
		"image": "1653400163543.jpg",
		"price": "399.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 126,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Ride Lasso Pro Wide Snowboard Boots 2023",
		"formattedTitle": "ride-lasso-pro-wide-snowboard-boots-",
		"brand": "ride",
		"description": "Do you love the fit and feel of the Lassos but wish they had a little more juice? A little more oomph? The Ride Lasso Pro Wide Snowboard Boots have exactly what you're looking for, serving up a stiffer flex on the same fit you know and love. They feature an Intuition™ wrap liner and H4 Boa® Coiler Fit System for real-time response, and Ride's all new Impacto™ Elite Insole to absorb big hits and chattery snow. From the steeps to the half pipe, the Lasso Pro Wide delivers the goods. If you've got wide feet, this boot will be your jam!",
		"image": "1653400166675.jpg",
		"price": "399.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 245,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Ride Lasso Pro Snowboard Boots 2023",
		"formattedTitle": "ride-lasso-pro-snowboard-boots-",
		"brand": "ride",
		"description": "Do you love the fit and feel of the Lassos but wish they had a little more juice? A little more oomph? The Ride Lasso Pro Snowboard Boots have exactly what you're looking for, serving up a stiffer flex on the same fit you know and love. They feature an Intuition™ wrap liner and H4 Boa® Coiler Fit System for real-time response, and Ride's all new Impacto™ Elite Insole to absorb big hits and chattery snow. From the steeps to the half pipe, the Lasso Pro delivers the goods.",
		"image": "1653400170038.jpg",
		"price": "399.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 11,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Salomon Echo Lace SJ Boa Snowboard Boots 2023",
		"formattedTitle": "salomon-echo-lace-sj-boa-snowboard-boots-",
		"brand": "salomon",
		"description": "If you have to get new boots, you might as well make them eco-friendly. The Salomon Echo Lace SJ Boa® Snowboard Boots are all-mountain rippers made with less-harmful materials from the inside-out. The STR8JKT BOA® Pro uses a three-point harness to end heel-lift for good, and the fully heat-moldable liner and combination of lace and Boa® work together to provide the most dialed fit on the mountain.",
		"image": "1653400172890.jpg",
		"price": "399.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 3,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Traditional, Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo Lashed Premium Spring Break Snowboard Boots 2023",
		"formattedTitle": "thirtytwo-lashed-premium-spring-break-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "Palm trees bring to mind the classic break from the tedium of college, and places like Ft. Lauderdale and Cabo as well as no holds-barred snowboarding. evo loves the former, but outside of boardshorts and flipflops we can't offer you much there. On the snowboarding side we do a whole lot better, with the thirtytwo Lashed Premium Spring Break Snowboard Boots leading the charge. Trad styling, trad lacing, a slightly stiffer flex and the telltale palm tree logo embossed into the cuff . . . what more can you ask for?",
		"image": "1653400176257.jpg",
		"price": "399.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 110,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo TM-Two XLT Helgason Snowboard Boots 2023",
		"formattedTitle": "thirtytwo-tm-two-xlt-helgason-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "With a burly big-mountain \"9\" flex and extra power strap to keep everything buttoned up under stress, the thirtytwo TM-Two XLT Helgason Snowboard Boots are what you need to rip like Halldor Helgason, even if you aren't a Viking.",
		"image": "1653400179272.jpg",
		"price": "399.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 24,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Very Stiff",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Photon Step On Snowboard Boots 2022 - Used",
		"formattedTitle": "burton-photon-step-on-snowboard-boots----used",
		"brand": "burton",
		"description": "We're still waiting on those hoverboards they promised us in the 80's, but the future has come to snowboarding and it goes by the name Burton Photon Step On Snowboard Boots. With a firm, responsive flex, the Photons cater to aggressive riders who like to stay in full control of their line, no matter where they point it. An Imprint™ 3 liner featuring Ultralon heat-moldable foam ensures these boots remain comfortable, warm and perfectly contoured to your feet, season after season. Burton Photons are synonymous with precision and control - these Step Ons are no different, they just add convenience to the mix!",
		"image": "1653400182935.jpg",
		"price": "395.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 152,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Step-On"
	},
	{
		"title": "Burton Ion Snowboard Boots 2021 - Used",
		"formattedTitle": "burton-ion-snowboard-boots----used",
		"brand": "burton",
		"description": "Crank up the voltage and conduct your descent down the most volatile lines with the Burton Ion Snowboard Boots. These powerhouses pack an aggressive flex that makes for incredibly responsive riding, while the heat-moldable Life Liners and Tuff Cuffs keep your heels and ankles locked in at lightning speeds. Fortunately, good looks and high-performance don't come at the cost of comfort. Total Comfort construction ensures an instantly broken-in feel from day one, so you can step in and charge without dilly-dallying. If you ride with the tenacity of a raging bull and the precision of Bob Ross's paintbrush, then the Burton Ion Snowboard Boots should be in your wheelhouse.",
		"image": "1653400185828.jpg",
		"price": "388.77",
		"sized": ["S", "M", "L", "XL"],
		"stock": 115,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Quick-Pull",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Ride Insano Snowboard Boots 2022",
		"formattedTitle": "ride-insano-snowboard-boots-",
		"brand": "ride",
		"description": "It's hardly crazy to want a burly boot you can totally trust when your riding style is full-charge, full-time. The Ride Insano Snowboard Boots are as burly as they get. This stout boot features a fiber-reinforced tongue for a flex that cranks all the way up, a new Boa® H4 Focus closure system, and a grippier Michelin® Traverse Outsole for hitting your favorite bootpack.",
		"image": "1653400189440.jpg",
		"price": "386.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 51,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Very Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo Mullair Snowboard Boots 2021",
		"formattedTitle": "thirtytwo-mullair-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "They call him, \"the Swiss master of style,\" and they designed these boots for him — Nicolas Müller. The thirtytwo Mullair Snowboard Boots give you a smooth ride and fresh looks, so you can try to emulate his effortless riding style. Tailored lacing technology provides a perfect fit while Cushion Cups lock your heels in place. The Michelin Fiberlite Outsole paired with the plush rebound of energy foam feels like walking on air. Continue your search for backcountry powder paradise in comfort and looking as rad as can be.",
		"image": "1653400193076.jpg",
		"price": "384.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 228,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Tourist Snowboard Boots 2022 - Used",
		"formattedTitle": "burton-tourist-snowboard-boots----used",
		"brand": "burton",
		"description": "Riders looking for a hassle-free experience on splitboard tours should take a serious look at the Burton Tourist Snowboard Boots. They deliver an ultra-smooth skin up with improved negative flex and impressive traction in sketchy zones thanks to the Rubber Ice Spikes. A full-custom Life Liner provides top-notch cushioning so you can bet your apres-beer you'll be ready to ride the next day. Tour-specific features and the time-tested comfort of Burton's boot construction makes the Burton Tourist Snowboard Boots quite the catch for determined splitters.",
		"image": "1653400196005.jpg",
		"price": "383.52",
		"sized": ["S", "M", "L", "XL"],
		"stock": 91,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Quick-Pull"
	},
	{
		"title": "thirtytwo TM-Three XD Grenier Snowboard Boots 2022",
		"formattedTitle": "thirtytwo-tm-three-xd-grenier-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "Built to take a beating and keep your feet warm and dry in the process, the thirtytwo TM-Three Grenier Snowboard Boots are the pinnacle of thirtytwo's progression in the combination freeride/freestyle arena. They feature EXO Armor protection in key areas where the binding meets the boot, the top-tier Elite Liner with super durable injection molded foam components, and a taller Elite harness for extra support. When you push your gear hard and expect it to show some fighting spirit, this is the boot for you.",
		"image": "1653400198685.jpg",
		"price": "379.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 150,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Ride Deadbolt Zonal Snowboard Boots 2023",
		"formattedTitle": "ride-deadbolt-zonal-snowboard-boots-",
		"brand": "ride",
		"description": "Your boots can make or break the whole season, so trust the Ride Deadbolt Zonal Snowboard Boots to keep your feet happy and your turns amped. The Deadbolts are tough as nails and tuned to hit the sweet spot between performance and comfort, combining fully moldable Intuition™ Support Foam Liners with a BOA® Zonal Fit System to keep you comfortably locked in. Updated with all new Impacto™ Ultra Insoles for elite level cushioning, the Ride Deadbolt Zonal Snowboard Boots have what it takes to take your riding to the next level.",
		"image": "1653400201355.jpg",
		"price": "379.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 168,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo TM-Two Snowboard Boots 2023",
		"formattedTitle": "thirtytwo-tm-two-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "The thirtytwo TM-Two Snowboard Boots do it all, and well, If you style is a combination of big mountain, park and whatever riles your imagination, the mid-stiff TM-Two is a great choice for a one-boot quiver.",
		"image": "1653400205762.jpg",
		"price": "379.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 64,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo TM-Two Stevens Snowboard Boots 2023",
		"formattedTitle": "thirtytwo-tm-two-stevens-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "The thirtytwo TM-Two Stevens Snowboard Boots combine power, precision and comfort in one sick package and lead the field in versatility for an all conditions ripper like you. Tremendous support and heel hold are TM-Two trademarks and the Stevens provides those in spades, along with a standout brown patterned colorway.",
		"image": "1653400209344.jpg",
		"price": "379.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 180,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo TM-Two Wide Snowboard Boots 2023",
		"formattedTitle": "thirtytwo-tm-two-wide-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "The thirtytwo TM-Two Wide Snowboard Boots are the perfect all-mountain, all-conditions boot choice for riders with wide and high-volume feet, with ultra soft Energy Foam inside and extra width throughout the forefoot and instep. If this sounds like your foot (you know who you are), get with the TM-Two Wide and make good things happen for your feet.",
		"image": "1653400212023.jpg",
		"price": "379.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 245,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Ion Boa Snowboard Boots 2021 - Used",
		"formattedTitle": "burton-ion-boa-snowboard-boots----used",
		"brand": "burton",
		"description": "The skier bros trundling along on the lift are already in awe of your lightening fast reflexes, jealous of your face shots, and stunned at your devil-may-care attitude to life-threatening gnar, but just wait until they catch a glimpse of your insane holographic Burton Ion Boa Snowboard Boots. These things look like they've been beamed onto planet earth from a perma-powing alternate reality, and they ride like it too. Stiff, responsive, and powerful, yet instantly wearable thanks to their Total Comfort Construction, the Ions will keep you charging for eons.",
		"image": "1653400215613.jpg",
		"price": "371.67",
		"sized": ["S", "M", "L", "XL"],
		"stock": 140,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Swath Step On Snowboard Boots 2022 - Used",
		"formattedTitle": "burton-swath-step-on-snowboard-boots----used",
		"brand": "burton",
		"description": "With the combined power of a dual zone Boa system and Burton's Step On tech, the Burton Swath Step On Snowboard Boots might just be the easiest to use boots on the market. There's no straps or laces to worry about in your whole setup. Just slip your feet in, crank down the dials, and step on your board, and you're ready to start shredding. The dual zone Boa gets you the most precise fit available, and the Swath has a smooth medium flex that's perfect and comfy for all-mountain riding, park laps, and impromptu après dance parties.",
		"image": "1653400219172.jpg",
		"price": "370.45",
		"sized": ["S", "M", "L", "XL"],
		"stock": 70,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Step-On"
	},
	{
		"title": "Salomon Dialogue Dual Boa Snowboard Boots 2023",
		"formattedTitle": "salomon-dialogue-dual-boa-snowboard-boots-",
		"brand": "salomon",
		"description": "The Salomon Dialogue Dual Boa® Snowboard Boots are built with freestyle performance and customization in mind. The dual Boa® system and heel cage keep your heel locked-in and the fully heat-moldable liner can be perfectly molded to your foot. The Contagrip® rubber outsole strategically combines durability and flex where you need it and Damplite+ EVA foam maximizes grip and comfort on even the biggest landings.",
		"image": "1653400223025.jpg",
		"price": "369.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 208,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Nitro Team Standard Snowboard Boots 2023",
		"formattedTitle": "nitro-team-standard-snowboard-boots-",
		"brand": "nitro",
		"description": "The Nitro Team Standard Snowboard Boots are like rocket fuel for riders who live to rip big lines and stomp big airs. They've earned the status of official-do-anything-boot for Nitro's pro team through an unholy blend of powerful, responsive flex, supportive Armored Spine construction, and all-day comfort. With classic lacing for those who like to dial their fit the old school way and shock absorbing Air Dampening technology to protect from hard landings, the Nitro Team Standard Snowboard Boots are a no-brainer for aggressive riders pushing the envelope.",
		"image": "1653400226926.jpg",
		"price": "369.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 175,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Salomon Dialogue Dual Boa Wide JP Snowboard Boots 2023",
		"formattedTitle": "salomon-dialogue-dual-boa-wide-jp-snowboard-boots-",
		"brand": "salomon",
		"description": "The Salomon Dialogue Lace SJ Boa® Snowboard Boots are the high-volume boots you need for optimized comfort and performance. The dual Boa® system and heel cage keep your heel locked-in and the fully heat-moldable liner provides the perfect fit. The Contagrip® rubber outsole strategically combines durability and flex where you need it and Damplite+ EVA foam maximizes board-feel and comfort for all-day riding.",
		"image": "1653400230474.jpg",
		"price": "369.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 157,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "K2 Aspect Snowboard Boots 2021",
		"formattedTitle": "k2-aspect-snowboard-boots-",
		"brand": "k2",
		"description": "Built for those willing to go the extra mile (or five), K2 Aspect Snowboard Boots aren't exactly daily drivers with broad appeal. Stiff and burly, they have a heavy duty Vibram® Mountaineer outsole that accepts crampons, are mega reinforced throughout, and sport overbuilt hardware--because where these boots can take you there's no repair shop to bail you out. With the durability and support to carry you deep into the backcountry, the Aspects are mountaineering equipment for snowboarders.",
		"image": "1653400234315.jpg",
		"price": "367.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 29,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Very Stiff",
		"lacing_system": "Traditional"
	},
	{
		"title": "thirtytwo Mullair Snowboard Boots 2020",
		"formattedTitle": "thirtytwo-mullair-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "Built for the Swiss master of style, Nicolas Müller, the all-new thirtytwo Mullair Snowboard Boots are designed to accommodate like-minded riders with a buttery smooth ride and a responsive flex. Fitted with an ultra-light and grippy Michelin Fiberlite outsole fused with cushy Energy Foam, these boots want to hike the backcountry, lap the park, and stay going for hours on end. Engineered with a Cushion cup for locking your heel in place, these boots utilize your natural geometry to keep heel bruise at bay no matter how huge the airtime.",
		"image": "1653400236974.jpg",
		"price": "359.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 103,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Medium",
		"lacing_system": "Traditional"
	},
	{
		"title": "Ride The 92 Snowboard Boots 2022",
		"formattedTitle": "ride-the-92-snowboard-boots-",
		"brand": "ride",
		"description": "The Ride The 92 Snowboard Boots hark back to a day when snowboarding was rad and your dad was still skiing. These throwbacks have a solid, do-it-all mid flexing design to go with the proven Boa® H4 Focus Fit System, not to mention the heat moldable Intuition® Mobile Wrap liner and Michelin® Fiberlite sole to keep your heel locked in and your feet firmly planted on the snow, right where they belong.",
		"image": "1653400239885.jpg",
		"price": "359.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 153,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "thirtytwo TM-Three Grenier Snowboard Boots 2021",
		"formattedTitle": "thirtytwo-tm-three-grenier-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "From park sessions to pow laps, the thirtytwo TM-Three Grenier Snowboard Boots give you the ultimate combo of support, response, and durability. Built around an Elite liner with Tongue Tenson+, you'll get a consistent fit all season long and full control through every turn. Take the the thirtytwo TM-Three Grenier Snowboard Boots anywhere on the mountain, Exo Armor and Storm Shield gives them the power to withstand every dunk, stomp, and slash required to tame your hill.",
		"image": "1653400243456.jpg",
		"price": "359.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 175,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo TM-Two Jones Snowboard Boots 2021",
		"formattedTitle": "thirtytwo-tm-two-jones-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "And you thought the regular thirtytwo boots were wide and comfy? It wasn't enough for Bode Merrill, and he asked for an even wider last on his pro model. The result is the thirtytwo TM-Two Double Boa Wide Merrill Snowboard Boots, which add another 18mm of width in the forefoot for true Sasquatch foot relief. This is a stout boot with a \"7\" flex and dual Boa® Fit System closures, and deserves a close look if your feet are seriously wide.",
		"image": "1653400246953.jpg",
		"price": "359.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 232,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Traditional"
	},
	{
		"title": "Burton Photon Boa -Wide Snowboard Boots 2022",
		"formattedTitle": "burton-photon-boa--wide-snowboard-boots-",
		"brand": "burton",
		"description": "All you know and love about the Photon Boa® (which is a lot), but in a wider fit, the Burton Photon Boa Wide Snowboard Boots are a life-saver for riders with high volume feet. This supremely balanced freeride boot features Dual Zone Boa® Lockdown lacing for instant and accurate tightness adjustment even with your gloves on, plus a super sweet Imprint™ 3 Liner for unheard-of heat moldable comfort.",
		"image": "1653400250672.jpg",
		"price": "359.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 106,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "Burton Photon Boa Snowboard Boots 2022",
		"formattedTitle": "burton-photon-boa-snowboard-boots-",
		"brand": "burton",
		"description": "Light up your riding this season with the Burton Photon Boa Snowboard Boots, and see why this mid-stiff Boa® boot is a perennial best-seller in the stacked Burton lineup. A Dual Zone Boa® Lockdown system gives you the freedom to instantly adjust tension in both liner and shell on the fly, and the Imprint™ 3 Liner offers peerless comfort and control.",
		"image": "1653400254439.jpg",
		"price": "359.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 118,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "K2 Hanford Snowboard Boots 2023",
		"formattedTitle": "k2-hanford-snowboard-boots-",
		"brand": "k2",
		"description": "The K2 Hanford Snowboard Boots are all about solid, all-mountain performance. They accomplish this task with a mid-stiff flex pattern, customizable fit, and top-notch heel hold. The boot uses a double reel Boa system on the outside and a quick-pull harness on the liner to keep your feet locked in place, letting you pressure your edges harder and lay out your carves deeper than ever before.",
		"image": "1653400257891.jpg",
		"price": "359.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 51,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "K2 Ender Snowboard Boots 2023",
		"formattedTitle": "k2-ender-snowboard-boots-",
		"brand": "k2",
		"description": "The K2 Ender Snowboard Boots are stiffer-flexing freestyle boots with top-of-the-line vibration dampening and shock absorption for stomping big airs and riding out choppy landings. With traditional lacing on the outside and unbeatable Boa Conda heel hold in the liner, these things offer a dialed, customizable fit for precision performance. Paired with the tweakable Vibram RollSole, these boots provide the perfect balance of business and pleasure.",
		"image": "1653400261588.jpg",
		"price": "359.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 43,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Ride Fuse Snowboard Boots 2023",
		"formattedTitle": "ride-fuse-snowboard-boots-",
		"brand": "ride",
		"description": "Light the touchpaper with a boot that gets it done from peak to parking lot, inbounds and out, day after day. The Ride Fuse Snowboard Boots combine traditional lacing with a Boa TongueTied™ system for comfort, fit, and heel hold you can rely on when the chips are down. Updated with Impacto™ Elite Insoles for improved cushioning on hard landings, the Fuse is a fantastic choice for freestyle riders who prefer a stiffer flex.",
		"image": "1653400264746.jpg",
		"price": "359.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 189,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo Bandito x Christenson Snowboard Boots 2023",
		"formattedTitle": "thirtytwo-bandito-x-christenson-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "Designed by surf guru and board shaper Chris Christenson,\" the thirtytwo Bandito x Christenson Snowboard Boots take their name from his big wave 9'4\" gun. With a surf-style internal harness and liner designed to let you flex more fully without losing heel hold, the Bandito is ready to deliver a more \"fluid\" sensation on snow.",
		"image": "1653400268063.jpg",
		"price": "359.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 167,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Soft",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Vans Infuse Snowboard Boots 2022",
		"formattedTitle": "vans-infuse-snowboard-boots-",
		"brand": "vans",
		"description": "Infuse some power into your riding with the tried-and-true Vans Infuse Snowboard Boots, and see what a difference a top-end performer makes. This boot sports a medium-stiff flex, Van's top V3 construction, and a hybrid traditional and Boa® lace system for a \"best of all worlds\" fit and locked-in performance. The Infuse is the choice of team rider Arthur Longo - no slacker when it comes to a challenge - and you could do a heck of a lot worse than take a ride in his shoes.",
		"image": "1653400271884.jpg",
		"price": "356.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 78,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Traditional, Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Salomon Dialogue Lace SJ Boa Snowboard Boots 2023",
		"formattedTitle": "salomon-dialogue-lace-sj-boa-snowboard-boots-",
		"brand": "salomon",
		"description": "If you're getting big air in the park, you need a boot that's stiff enough to stomp those landings. The Salomon Dialogue Lace SJ BOA® combines their slim, Fit to Ride profile with a medium flex for the ultimate combination of performance and comfort. The STR8JKT Boa® and heel cage keep your heel in place and the fully heat-moldable liner can be customized to address any problem areas. The Contagrip® rubber outsole strategically combines durability and flex where you need it and the Damplite+ maximizes board-feel and comfort for all-day shredding.",
		"image": "1653400275257.jpg",
		"price": "349.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 239,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional, Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Kendo Step On Snowboard Boots 2022",
		"formattedTitle": "burton-kendo-step-on-snowboard-boots-",
		"brand": "burton",
		"description": "A riders' favorite boot, now in a Step-On version! Burton Kendo Step On Snowboard Boots combine traditional lacing with the ease of Burton's Step-On system, providing the sure fit and smooth, responsive board-feel needed to get your carving looking like a work of art. The heat-moldable Imprint™ 3 liners with Focus cuffs strike the perfect balance between support and comfort for heroic ankle hold and heel retention, allowing you to freely manipulate your sword while exercising complete control. Find true zen in all snow conditions with the Burton Kendo Step On Snowboard Boots.",
		"image": "1653400279518.jpg",
		"price": "349.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 208,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Step-On"
	},
	{
		"title": "thirtytwo Lashed Double Boa Bradshaw Snowboard Boots 2023",
		"formattedTitle": "thirtytwo-lashed-double-boa-bradshaw-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Lashed Double Boa Snowboard Boots provide the same awesome fit and performance as the regular Lashed series, but with the quick and easy addition of dual Boa closures. A medium flex covers all the bases from full pow days to park laps, and the heel hold and comfort are unsurpassed. The thirtytwo Lashed Double Boa Bradshaw Snowboard Boots feature an easy-on-the-eyes two-tone brown with olive colorway that set them apart from the pack.",
		"image": "1653400282807.jpg",
		"price": "349.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 234,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo Lashed Double Boa Powell Snowboard Boots 2023",
		"formattedTitle": "thirtytwo-lashed-double-boa-powell-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Lashed Double Boa Snowboard Boots provide the same awesome fit and performance as the regular Lashed series, but with the quick and easy addition of dual Boa closures. A medium flex covers all the bases from full pow days to park laps, and the heel hold and comfort are unsurpassed. This model features a one-off white-grey-orange colorway to keep your feet extra fresh.",
		"image": "1653400285671.jpg",
		"price": "349.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 94,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo Lashed Double Boa Snowboard Boots 2023",
		"formattedTitle": "thirtytwo-lashed-double-boa-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Lashed Double Boa Snowboard Boots provide the same awesome fit and performance as the regular Lashed series, but with the quick and easy addition of dual Boa closures. A medium flex covers all the bases from full pow days to park laps, and the heel hold and comfort are unsurpassed.",
		"image": "1653400289388.jpg",
		"price": "349.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 58,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo TM-Two Jones Snowboard Boots 2022",
		"formattedTitle": "thirtytwo-tm-two-jones-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "The thirtytwo TM-Two Jones Snowboard Boots are the classic TM-Two's with special mods for splitboarding fanatics. They feature a hybrid walk mode collar that loosens so you can elongate your stride while skinning, the same mountaineering-level Vibram® sole as the stiffer MTB, and the same superb fit and comfort as the regular TM-Two. This boot is a no-brainer for big mountain riders who also dabble in splitboarding but want one pair of boots for both setups.",
		"image": "1653400292889.jpg",
		"price": "348.46",
		"sized": ["S", "M", "L", "XL"],
		"stock": 143,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Vans Baldface Snowboard Boots 2022",
		"formattedTitle": "vans-baldface-snowboard-boots-",
		"brand": "vans",
		"description": "A once-in-a-lifetime collaboration between Van's and the powdercat guides at Baldface, British Columbia, the Vans Baldface Snowboard Boots are a burly backcountry and big mountain-oriented design employing ultra-reliable traditional design with added features like a Waterproof Zipper Shroud gaiter that keeps snow and moisture from getting into the lower of the boot. When you access your lines with the aid of a cat or a heli, you let your guide take care of the details - why not let them design your boot as well?",
		"image": "1653400296096.jpg",
		"price": "340.00",
		"sized": ["S", "M", "L", "XL"],
		"stock": 200,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo TM-Two Double Boa Snowboard Boots 2021",
		"formattedTitle": "thirtytwo-tm-two-double-boa-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "Any rider can find comfort in the dual-zone precision fit of the thirtytwo TM-Two Double Boa Snowboard Boots. The most versatile in thritytwo's boot line, they feature a medium flex that works with any riding style, a heat-moldable liner, and, of course, the Double Boa Closure System for locked-in performance and high-end support. High-rebound energy foam cushioning makes these babies comfortable right out of the box, while the protective overmold keeps them intact season after season. You'll be glad you went with the thirtytwo TM-Two Double Boa Snowboard Boots whether you spend all day riding the groomers, slicing technical terrain like a human scalpel, or lining up epic air to impress your friends.",
		"image": "1653400299772.jpg",
		"price": "337.46",
		"sized": ["S", "M", "L", "XL"],
		"stock": 63,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "K2 Maysis Clicker X HB Snowboard Boots 2021",
		"formattedTitle": "k2-maysis-clicker-x-hb-snowboard-boots-",
		"brand": "k2",
		"description": "Take K2's most popular boot, toss it in a cauldron with the latest evolution of their acclaimed step-in technology, and what do you get? The K2 Maysis Clicker X HB Snowboard Boots, a smooth flexing foot stomper that you can click and rip, easy as pie. It's got all the features you need to shred hard - Boa® Lacing, heat moldable Intuition™ Control Foam 3D Liners, premium Endo™ 2.0 construction - along with the security and unbeatable convenience of the Clicker X HB binding. Enjoy.",
		"image": "1653400303329.jpg",
		"price": "283.46",
		"sized": ["S", "M", "L", "XL"],
		"stock": 196,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "K2 Clicker"
	},
	{
		"title": "DC Control Boa Step On Snowboard Boots 2022",
		"formattedTitle": "dc-control-boa-step-on-snowboard-boots-",
		"brand": "dc",
		"description": "What do you get when you pair DC's legendary out-of-the-box comfort with the unrivaled convenience of Step On® technology? The DC Control Boa Step On Snowboard Boots, and a whole new standard for everyone else to catch up to. Updated with DC's latest Response II Liner and an improved Dual Zone BOA® Fit System, these puppies have the performance and fit you need to squeeze the juice out of every turn.",
		"image": "1653400306816.jpg",
		"price": "329.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 132,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Step-On"
	},
	{
		"title": "K2 Maysis Snowboard Boots 2023",
		"formattedTitle": "k2-maysis-snowboard-boots-",
		"brand": "k2",
		"description": "The K2 Maysis Snowboard Boots are K2's best selling option for good reason. They're crazy comfortable, easy to adjust, and provide dialed, predictable performance. Built around the power of the Boa lacing system, these boots have one coiler for the outside and another for the liner, letting you get your foot snugly locked in and your fit completely customized. To add in some extra comfort, they come pre-equipped with Intuition liners and vibration dampening Harshmellow midsoles, making this sweet all-mountain boot just about as value-packed as you could ask for.",
		"image": "1653400310261.jpg",
		"price": "329.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 50,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "K2 Maysis Wide Snowboard Boots 2023",
		"formattedTitle": "k2-maysis-wide-snowboard-boots-",
		"brand": "k2",
		"description": "The K2 Maysis Snowboard Boots are K2's best selling option for good reason. They're crazy comfortable, easy to adjust, and provide dialed, predictable performance. Built around the power of the Boa lacing system, these boots have one coiler for the outside and another for the liner, letting you get your foot snugly locked in and your fit completely customized. To add in some extra comfort, they come pre-equipped with Intuition liners and vibration dampening Harshmellow midsoles, making this sweet all-mountain boot just about as value-packed as you could ask for. Now, for folks with wider feet, the K2 Maysis Wide Snowboard Boots are offered with an extra 7mm of width throughout the boot and liner.",
		"image": "1653400313669.jpg",
		"price": "329.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 11,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Ride Lasso Boa Snowboard Boots 2023",
		"formattedTitle": "ride-lasso-boa-snowboard-boots-",
		"brand": "ride",
		"description": "Catch some turns in the Ride Lasso Boa Snowboard Boots and you'll see why they've been the go-to for countless riders over the years. Their combination of comfort, convenience, and performance is tough to beat, regardless of style or ability level. The articulated cuff, quick action Boa® lacing, and all new Impacto™ Ultra Insoles will have you airing side hits, slashing trees, and riding smooth when the pow turns to mashed potatoes.",
		"image": "1653400317859.jpg",
		"price": "329.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 67,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "thirtytwo TM-Two Snowboard Boots 2023",
		"formattedTitle": "thirtytwo-tm-two-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "The thirtytwo TM-Two Snowboard Boots do it all, and well, If you style is a combination of big mountain, park and whatever riles your imagination, the mid-stiff TM-Two is a great choice for a one-boot quiver.",
		"image": "1653400321277.jpg",
		"price": "379.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 241,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Ruler Step On Snowboard Boots 2022",
		"formattedTitle": "burton-ruler-step-on-snowboard-boots-",
		"brand": "burton",
		"description": "The Burton Ruler Step On Snowboard Boots are the kings of the hill when it comes to comfort and ease of use. They feature an Imprint 2 heat moldable liner to get the fit the just right, and a Sequence Boa system to keep you locked and loaded. The medium flex is comfy and freestyle-ready, and best of all, the Rulers are part of Burton's Step On system, which means they're made to be paired with strapless and simple Step On bindings for impossibly easy on-the-fly use. Welcome to the future, my dudes.",
		"image": "1653400325282.jpg",
		"price": "324.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 146,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Step-On"
	},
	{
		"title": "Burton Swath Boa Snowboard Boots 2022",
		"formattedTitle": "burton-swath-boa-snowboard-boots-",
		"brand": "burton",
		"description": "The Burton Swath Boa Snowboard Boots are the all-day, every-way boots you've been waiting for. They feature a mid-range flex that suits all types of riding, plus the out-of-the-box feel of Total Comfort Construction with the user-friendly fit-customization of dual Boa closures. If you're looking for a reliable set of boots that perform day in and day out on any terrain in all conditions, then don't pass on the Burton Swath Boa Snowboard Boots.",
		"image": "1653400328287.jpg",
		"price": "323.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 57,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Ride The 92 Snowboard Boots 2022 - Used",
		"formattedTitle": "ride-the-92-snowboard-boots----used",
		"brand": "ride",
		"description": "The Ride The 92 Snowboard Boots hark back to a day when snowboarding was rad and your dad was still skiing. These throwbacks have a solid, do-it-all mid flexing design to go with the proven Boa® H4 Focus Fit System, not to mention the heat moldable Intuition® Mobile Wrap liner and Michelin® Fiberlite sole to keep your heel locked in and your feet firmly planted on the snow, right where they belong.",
		"image": "1653400331033.jpg",
		"price": "323.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 78,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "K2 Holgate Snowboard Boots 2021 - Used",
		"formattedTitle": "k2-holgate-snowboard-boots----used",
		"brand": "k2",
		"description": "These rock-solid boots are as dependable as they come. With a stiff flex, rubber reinforced uppers, and a super secure three-part Boa system, the K2 Holgate Snowboard Boots are seriously hard charging. Plus, they come standard with Vibram soles equipped with Harshmellow dampening to smooth out your ride and provide extra traction for summit-push rock scrambles and boot packs in the backcountry. Truly a do everything boot for the advanced rider.",
		"image": "1653400334830.jpg",
		"price": "322.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 226,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "Ride Lasso Pro Snowboard Boots 2022",
		"formattedTitle": "ride-lasso-pro-snowboard-boots-",
		"brand": "ride",
		"description": "Built off the popular Lasso boot, the Ride Lasso Pro Snowboard Boots deliver famous fit and function. They feature an Intuition™ wrap liner and H4 Boa® Coiler Fit System for real-time response and consistent flex. Whether you're ticking off new lines or stomping tricks in the park, the Ride Lasso Pro Snowboard Boots offer the support you need.",
		"image": "1653400338671.jpg",
		"price": "322.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 155,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Vans Jamie Lynn LTD Snowboard Boots 2020",
		"formattedTitle": "vans-jamie-lynn-ltd-snowboard-boots-",
		"brand": "vans",
		"description": "The Vans Jamie Lynn LTD Snowboard Boots are based on Van's flagship Infuse model, which uses Boa coilers on the inside and a traditional lacing system on the outside to offer one of the most customizable and tweakable flex profiles around. They're just as happy ripping hard in the backcountry, surfing through powder, or tweaking out huge methods in the park, and the limited edition black and gold colorway looks rad in any situation.",
		"image": "1653400342451.jpg",
		"price": "319.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 33,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "K2 Orton Snowboard Boots 2022",
		"formattedTitle": "k2-orton-snowboard-boots-",
		"brand": "k2",
		"description": "When K2 needed someone to fine tune their latest boot, there was only one name on the list. Sage Kostenburg put the K2 Orton Snowboard Boots through the wringer in the biggest, baddest terrain on the planet, and they passed with flying colors. Boasting a powerful flex, ultra-rugged Vibram® V5 outsoles, and fully heat moldable Intuition® Pro Foam 3D Liners, the Ortons blur the line between freeride and freestyle disciplines, performing at the absolute limits of human shredability. Top it off with Dual Zone Boa® H4/M3 lacing and Harshmellow™ damping to absorb the big hits, and you've got a winner that power riders can take to the bank.",
		"image": "1653400345225.jpg",
		"price": "319.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 32,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "K2 Holgate Snowboard Boots 2022",
		"formattedTitle": "k2-holgate-snowboard-boots-",
		"brand": "k2",
		"description": "The K2 Holgate Snowboard Boots set you up for success with a responsive flex, rubber reinforced uppers, and a super secure three-part Boa system. Featuring the same basic amenities as the Thraxis, the more tweak-friendly Holgate finds itself more at home in mellower environments like groomers and the park, while maintaining the power needed to nail those big lines.",
		"image": "1653400349391.jpg",
		"price": "319.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 198,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "Ride Lasso Pro Wide Snowboard Boots 2022",
		"formattedTitle": "ride-lasso-pro-wide-snowboard-boots-",
		"brand": "ride",
		"description": "The Ride Lasso Pro Wide Snowboard Boots feature a stiff, powerful flex, an Intuition® Support Trap Wrap liner for unequaled fit, and the Boa® H4 Coiler system to dial in the tightness to your liking. The Lasso is a favorite among big mountain rippers who demand solid support in their boots, and if you've got wide feet the Pro Wide may be your jam.",
		"image": "1653400352901.jpg",
		"price": "319.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 22,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Salomon Launch Boa SJ Boa Snowboard Boots 2023",
		"formattedTitle": "salomon-launch-boa-sj-boa-snowboard-boots-",
		"brand": "salomon",
		"description": "Park rats rejoice — the Salomon Launch Boa SJ Boots are back and ready to shred even longer. The STR8JKT Boa® keeps your heels solidly locked in when you're jibbing and popping off lips and the Custom Fit liner is heat-moldable in the most problematic areas. The soles are extra durable, with the classic cushy Feather outsole and new Contagrip® rubber that strategically adds flex and strength to your boot where you need it for the longest lifespan.",
		"image": "1653400357089.jpg",
		"price": "319.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 61,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo TM-Two Double Boa Wide Merrill Snowboard Boots 2022",
		"formattedTitle": "thirtytwo-tm-two-double-boa-wide-merrill-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "And you thought the regular thirtytwo boots were wide and comfy? It wasn't enough for Bode Merrill, and he asked for an even wider last on his pro model. The result is the thirtytwo TM-Two Double Boa Wide Merrill Snowboard Boots, which add another 18mm of width in the forefoot for true Sasquatch foot relief. This is a stout boot with a \"7\" flex and dual Boa® Fit System closures, and deserves a close look if your feet are seriously wide.",
		"image": "1653400360987.jpg",
		"price": "318.92",
		"sized": ["S", "M", "L", "XL"],
		"stock": 41,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Adidas Tactical Lexicon ADV Snowboard Boots 2021",
		"formattedTitle": "adidas-tactical-lexicon-adv-snowboard-boots-",
		"brand": "adidas",
		"description": "Adidas Tactical Lexicon ADV Snowboard Boots respond instantly to the language of your feet, giving you comfort and control through every jump, grab, carve, and slash. Gold Level Ultralon liners are heat-moldable for a custom fit, with the cushion and rebound to support big stomps off monster drops. The Adidas Tactical Lexicon ADV Snowboard Boots are finished off with boost™ soles, so you can cash checks at the Bank of Sending It, all winter long.",
		"image": "1653400364756.jpg",
		"price": "315.00",
		"sized": ["S", "M", "L", "XL"],
		"stock": 183,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo TM-Two Double Boa Snowboard Boots 2022",
		"formattedTitle": "thirtytwo-tm-two-double-boa-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "A day in the thirtytwo TM-Two Double Boa Snowboard Boots is a day in paradise. Spend the morning riding in a foot of pow and the PM throwing down in the park. Dial up the double boa for a good fit in a flash and head out with your board under your arm. It's that simple.",
		"image": "1653400367670.jpg",
		"price": "314.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 238,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo Lashed Premium Snowboard Boots 2021",
		"formattedTitle": "thirtytwo-lashed-premium-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Lashed Premium Snowboard Boots are strapped with full-grain leather and upgraded with a Performance Liner for extra support. These are for the rider who gets the job done in any type of terrain and loves to look good doing it. Tackle every project on the hillside with the durable construction, comfortable fit, and reliable support of the thirtytwo Lashed Premium Snowboard Boots.",
		"image": "1653400370662.jpg",
		"price": "314.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 14,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo Lashed Santa Cruz Snowboard Boots 2023",
		"formattedTitle": "thirtytwo-lashed-santa-cruz-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "The classic thirtytwo Lashed Snowboard Boots don't have to be boring - the trad lacing system and \"6\" flex have been killing it in both park and all over the mountain for years with little change - but now there's an insanely good Santa Cruz colorway to spice up your snowboarding life. Ask for the thirtytwo Lashed Santa Cruz Snowboard Boots and be done with it.",
		"image": "1653400374283.jpg",
		"price": "309.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 80,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo TM-Two Double Boa Wide Snowboard Boots 2022",
		"formattedTitle": "thirtytwo-tm-two-double-boa-wide-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "And you thought the regular thirtytwo boots were wide and comfy? It wasn't enough for Bode Merrill, and he asked for an even wider build on his pro model. The result is the thirtytwo TM-Two Double Boa Wide Snowboard Boots, which add another 18mm of width in the forefoot for true Sasquatch foot relief. This is a stout boot with a \"7\" flex and dual Boa® Fit System closures. It deserves a close look if your feet are seriously wide.",
		"image": "1653400377816.jpg",
		"price": "307.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 204,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Photon Snowboard Boots 2022",
		"formattedTitle": "burton-photon-snowboard-boots-",
		"brand": "burton",
		"description": "A team rider favorite, the Burton Photon Snowboard Boots are a medium flexing lace boot with an insanely high level of comfort. The Photon has tremendous control both heelside and toeside with its GripLITE Backstay and 1:1 Firm Flex PowerUP Tongue, while retaining plenty of ankle flex for tweaking and spinning.",
		"image": "1653400380941.jpg",
		"price": "307.76",
		"sized": ["S", "M", "L", "XL"],
		"stock": 179,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Quick-Pull",
		"binding_style": "Strap"
	},
	{
		"title": "Ride Lasso Pro Snowboard Boots 2022 - Used",
		"formattedTitle": "ride-lasso-pro-snowboard-boots----used",
		"brand": "ride",
		"description": "Built off the popular Lasso boot, the Ride Lasso Pro Snowboard Boots deliver famous fit and function. They feature an Intuition™ wrap liner and H4 Boa® Coiler Fit System for real-time response and consistent flex. Whether you're ticking off new lines or stomping tricks in the park, the Ride Lasso Pro Snowboard Boots offer the support you need.",
		"image": "1653400385032.jpg",
		"price": "306.81",
		"sized": ["S", "M", "L", "XL"],
		"stock": 124,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Ride Lasso Pro Snowboard Boots 2022 - Used",
		"formattedTitle": "ride-lasso-pro-snowboard-boots----used",
		"brand": "ride",
		"description": "Built off the popular Lasso boot, the Ride Lasso Pro Snowboard Boots deliver famous fit and function. They feature an Intuition™ wrap liner and H4 Boa® Coiler Fit System for real-time response and consistent flex. Whether you're ticking off new lines or stomping tricks in the park, the Ride Lasso Pro Snowboard Boots offer the support you need.",
		"image": "1653400389414.jpg",
		"price": "306.81",
		"sized": ["S", "M", "L", "XL"],
		"stock": 181,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Imperial Snowboard Boots 2020",
		"formattedTitle": "burton-imperial-snowboard-boots-",
		"brand": "burton",
		"description": "Don't be afraid to charge the heck out of your line in the powerful Burton Imperial Snowboard Boots. These monsters are made with strong, lightweight S4 shell panels that distribute strap pressure and give smooth, consistent flex season after season; good news for those who need a reliably stiff, responsive boot to go full aggro. Quick, easy lacing comes as standard with the Speed Zone™ lacing system so step in, strap up and get ready to rule the mountain.",
		"image": "1653400393372.jpg",
		"price": "305.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 104,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Quick-Pull",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "K2 Maysis Clicker X HB Snowboard Boots 2021 - Used",
		"formattedTitle": "k2-maysis-clicker-x-hb-snowboard-boots----used",
		"brand": "k2",
		"description": "Take K2's most popular boot, toss it in a cauldron with the latest evolution of their acclaimed step-in technology, and what do you get? The K2 Maysis Clicker X HB Snowboard Boots, a smooth flexing foot stomper that you can click and rip, easy as pie. It's got all the features you need to shred hard - Boa® Lacing, heat moldable Intuition™ Control Foam 3D Liners, premium Endo™ 2.0 construction - along with the security and unbeatable convenience of the Clicker X HB binding. Enjoy.",
		"image": "1653400397087.jpg",
		"price": "302.36",
		"sized": ["S", "M", "L", "XL"],
		"stock": 133,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "K2 Clicker"
	},
	{
		"title": "thirtytwo TM-Two XLT Helgason Snowboard Boots 2022",
		"formattedTitle": "thirtytwo-tm-two-xlt-helgason-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "The thirtytwo TM-Two XLT Helgason Snowboard Boots feature an aggressive \"9\" flex with a heel-cradling footbed, a heat-moldable liner, and a grippy Vibram® outsole for traverses. When you aspire to \"Viking Power\" in your riding, the Halldor Helgason pro model boots are a requisite.",
		"image": "1653400399843.jpg",
		"price": "299.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 235,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Very Stiff",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "K2 Boundary Snowboard Boots 2023",
		"formattedTitle": "k2-boundary-snowboard-boots-",
		"brand": "k2",
		"description": "Pushing the boundaries of your comfort zone has never felt so comfortable. The K2 Boundary Snowboard Boots are dependable all-mountain boots with a medium flex and a ton of features to help you stay in control while you explore the wilder sides of the mountain. The Intuition Control Foam liner is as comfortable as they come, and the Boa coiler keeps your foot locked in for extra performance. Topped off with Harshmellow midsoles for shock absorbing powers, these boots will have you crushing it harder than ever before.",
		"image": "1653400403541.jpg",
		"price": "299.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 76,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Ride Anchor Snowboard Boots 2023",
		"formattedTitle": "ride-anchor-snowboard-boots-",
		"brand": "ride",
		"description": "The Ride Anchor Snowboard Boots offer safe harbor in any freestyle storm, especially if your riding trends toward \"hurricane force\". A slim, minimalist design combines with a moderately stiff flex to let you go bigger and badder than ever, while upgraded Impacto™ Ultra Insoles provide much needed cushioning and protection when you land a little harder than expected. The Anchor comes with a Boa® Tongue Tied™ liner and traditional laced outer boot for best-of-all-worlds customization and fit.",
		"image": "1653400406928.jpg",
		"price": "299.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 114,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo Lashed Crab Grab Snowboard Boots 2023",
		"formattedTitle": "thirtytwo-lashed-crab-grab-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Lashed Snowboard Boots kill it in all conditions, and are a mainstay of the snowboarding world. Have been for years, in fact. Now there are more color options than ever before - witness the new thirtytwo Lashed Lashed Crab Grab Snowboard Boots in this year's black-grey-white color scheme.",
		"image": "1653400409668.jpg",
		"price": "299.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 53,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo Lashed Powell Snowboard Boots 2023",
		"formattedTitle": "thirtytwo-lashed-powell-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Lashed Snowboard Boots kill it in all conditions, and are a mainstay of the snowboarding world. Have been for years, in fact. Now there are more color options than ever before - witness the new thirtytwo Lashed Powell Snowboard Boots in a Creamsicle white and orange combination that's ready to fire your imagination and bring focus to your riding.",
		"image": "1653400412310.jpg",
		"price": "299.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 243,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo Lashed Snowboard Boots 2023",
		"formattedTitle": "thirtytwo-lashed-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "An undeniable classic in the world of snowboarding, the thirtytwo Lashed Snowboard Boots get 'er done \"old school\" with a medium \"6\" flex rating and traditional lace closure system. A great all-round solution for every riding style imaginable, from peak to park and back again.",
		"image": "1653400415822.jpg",
		"price": "299.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 80,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo Lashed Bradshaw Snowboard Boots 2023",
		"formattedTitle": "thirtytwo-lashed-bradshaw-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Lashed Snowboard Boots kill it in all conditions, and are a mainstay of the snowboarding world. Have been for years, in fact. Now there are more color options than ever before - witness the new thirtytwo Lashed Lashed Bradshaw Snowboard Boots in this year's brown-on-brown colorway. Earthtones rule, and so do these boots.",
		"image": "1653400420569.jpg",
		"price": "299.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 48,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Salomon Launch Lace SJ Boa Snowboard Boots 2023",
		"formattedTitle": "salomon-launch-lace-sj-boa-snowboard-boots-",
		"brand": "salomon",
		"description": "There's something to be said for classic laces to get that perfect fit. The Salomon Launch Lace SJ Boa® Snowboard Boots offer the best of both worlds, with quick-turn STR8JKT Boa® to lock your heel in place and traditional laces to tighten your boot exactly the way you want it. The custom fit liner is heat-moldable in the most-needed areas and Contagrip® and Feather outsoles offer lightweight durability for freestyle riders who want a boot that can do it all.",
		"image": "1653400424395.jpg",
		"price": "299.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 50,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional, Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Swath Snowboard Boots 2022",
		"formattedTitle": "burton-swath-snowboard-boots-",
		"brand": "burton",
		"description": "The Burton Swath Snowboard Boots are the seven-day steppers you've been waiting for. The Swaths feature a mid-range flex that suits all types of riding, plus Total Comfort Construction that provides a super comfortable, broken-in feel right from the start. If you're looking for a pair of boots that you can rely on every day of the week, on any terrain, in all conditions, then the Burton Swath Snowboard Boots are for you.",
		"image": "1653400428151.jpg",
		"price": "296.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 205,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Quick-Pull",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "DC Travis Rice Boa Snowboard Boots 2021",
		"formattedTitle": "dc-travis-rice-boa-snowboard-boots-",
		"brand": "dc",
		"description": "Made for the likes of T.Rice, the DC Travis Rice Boa Snowboard Boots are DC's most responsive boots. Back this year with an articulated design, Stormproof Storm Flaps, and Boa closure system, you'll feel confident in this professional setup. The DC Travis Rice Boa Snowboard Boots are even warmer this year thanks to the new Black Aerotech T. Rice liners with 3M Thinsulate. And it wouldn't be right not to mention the asymmetrical anti-drag outsoles from the mind of Rice. These soles facilitate a catch-free ride so you don't get hung up on steep, technical descents. If you're ready to take the next step in your snowboarding career, these are the boots.",
		"image": "1653400431834.jpg",
		"price": "293.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 12,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Very Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo TM-Two Stevens Snowboard Boots 2022",
		"formattedTitle": "thirtytwo-tm-two-stevens-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "The thirtytwo TM-Two Stevens Snowboard Boots are a powerful freeride boot that fits any style of charging hard. With a comfort-oriented construction and plenty of cushion to tame those hard landings, the TM-Two Stevens are big fans of treating your feet well and offer super secure ankle and heel hold.",
		"image": "1653400436517.jpg",
		"price": "293.21",
		"sized": ["S", "M", "L", "XL"],
		"stock": 193,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Swath Boa Snowboard Boots 2022 - Used",
		"formattedTitle": "burton-swath-boa-snowboard-boots----used",
		"brand": "burton",
		"description": "The Burton Swath Boa Snowboard Boots are the all-day, every-way boots you've been waiting for. They feature a mid-range flex that suits all types of riding, plus the out-of-the-box feel of Total Comfort Construction with the user-friendly fit-customization of dual Boa closures. If you're looking for a reliable set of boots that perform day in and day out on any terrain in all conditions, then don't pass on the Burton Swath Boa Snowboard Boots.",
		"image": "1653400441371.jpg",
		"price": "291.56",
		"sized": ["S", "M", "L", "XL"],
		"stock": 142,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "K2 Maysis Snowboard Boots 2021",
		"formattedTitle": "k2-maysis-snowboard-boots-",
		"brand": "k2",
		"description": "The K2 Maysis Snowboard Boots are the best-selling boots in the world for a reason. They've got a super smooth flex that's just on the al dente side of medium, backed up by a double reel Boa system. The Intuition Control liner is super comfy and has a precision fit, and the whole boot is made with K2's top of the line Endo 2.0 construction. It's like an All-Star team of boot components. Each piece has been hand selected for quality and mass appeal, and integrated with perfection into a true masterpiece of bootsmanship.",
		"image": "1653400445229.jpg",
		"price": "289.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 130,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "thirtytwo TM-Two Snowboard Boots 2021",
		"formattedTitle": "thirtytwo-tm-two-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "The thirtytwo TM-Two Snowboard Boots are the most versatile boots that thirtytwo makes. A medium flex with the support of Performance liners suits them to any riding style anywhere on the mountain. High-rebound energy foam underfoot makes these bad boys super comfortable right out of the box, and they'll feel just as good after a hundred rides thanks to the protective overmold. Grab a pair of thirtytwo TM-Two Snowboard Boots and see what all the buzz is about.",
		"image": "1653400448113.jpg",
		"price": "289.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 224,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "K2 Ender Snowboard Boots 2022",
		"formattedTitle": "k2-ender-snowboard-boots-",
		"brand": "k2",
		"description": "Love the infinite adjustability and easy replacement of traditional laces, but prefer the snug midfoot and heel grip you get with a Boa®? Lots of riders do, and the K2 Ender Snowboard Boots are a great answer. The Ender uses laces for the outer closure, but the Boa® Mobillity Conda™ inner system. K2's best tech is also included, with a rubber reinforced Articulating Cuff Upper with Endo 2.0 construction, their top Intuition® Pro Foam 3D liner, and grippy Vibram® RollSole™ outsoles.",
		"image": "1653400451498.jpg",
		"price": "287.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 170,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Traditional, Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "Ride Lasso Pro Wide Snowboard Boots 2021",
		"formattedTitle": "ride-lasso-pro-wide-snowboard-boots-",
		"brand": "ride",
		"description": "The Ride Lasso Pro Wide Snowboard Boots are a beefed up version of Ride's popular Lasso boot, in a wider last. They feature a Boa Coiler system and and Intuition wrap liner for even distribution of pressure and a firm yet consistent flex. This responsive, comfortable boot shines everywhere from the steeps to the half pipe.",
		"image": "1653400454485.jpg",
		"price": "287.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 105,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Tourist Snowboard Boots 2022 - Used",
		"formattedTitle": "burton-tourist-snowboard-boots----used",
		"brand": "burton",
		"description": "Riders looking for a hassle-free experience on splitboard tours should take a serious look at the Burton Tourist Snowboard Boots. They deliver an ultra-smooth skin up with improved negative flex and impressive traction in sketchy zones thanks to the Rubber Ice Spikes. A full-custom Life Liner provides top-notch cushioning so you can bet your apres-beer you'll be ready to ride the next day. Tour-specific features and the time-tested comfort of Burton's boot construction makes the Burton Tourist Snowboard Boots quite the catch for determined splitters.",
		"image": "1653400457756.jpg",
		"price": "282.60",
		"sized": ["S", "M", "L", "XL"],
		"stock": 221,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Quick-Pull"
	},
	{
		"title": "Ride Lasso Boa Snowboard Boots 2021",
		"formattedTitle": "ride-lasso-boa-snowboard-boots-",
		"brand": "ride",
		"description": "Wrangle up some good times whenever you step into your Ride Lasso Boa Snowboard Boots. These rockin' freeride kicks rope together a whole mess of performance features so you can drive a stampede of style and responsiveness down the mountain. Pull on your riding boots, cowboy, it's yee-haw time.",
		"image": "1653400462246.jpg",
		"price": "280.46",
		"sized": ["S", "M", "L", "XL"],
		"stock": 250,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "Ride Fuse Snowboard Boots 2021",
		"formattedTitle": "ride-fuse-snowboard-boots-",
		"brand": "ride",
		"description": "Just because it's a lace-up freestyle boot, doesn't mean it has to be soft and noodly. The Ride Fuse Snowboard Boots are stiff like a dive bar martini and hold up to the day in, day out abuse of serious riders who demand the best from their boots. Features like Flex Slime tongues, dual density TPU heel counters and Fiberlite soles help dampen vibrations and big impacts, making the Fuse a great option for freestyle riders who prefer a stiffer flex and the adjustability of laces.",
		"image": "1653400465898.jpg",
		"price": "279.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 114,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Nidecker Tracer Snowboard Boots 2022",
		"formattedTitle": "nidecker-tracer-snowboard-boots-",
		"brand": "nidecker",
		"description": "If surfers wore boots, maybe they would wear the Nidecker Tracer Snowboard Boots. Ideal for slashing mountain waves and weaving through trees, these boots blend flex and responsiveness. The Tracer's Silver-Level liner is pre-molded, cushy, and broken-in out of the box. Add the pressure-free fit and hell-hold provided by the Dual Zone Boa® system and you've got a perfect fit primed for high performance.",
		"image": "1653400469576.jpg",
		"price": "279.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 240,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Salomon Dialogue Dual Boa Snowboard Boots 2022",
		"formattedTitle": "salomon-dialogue-dual-boa-snowboard-boots-",
		"brand": "salomon",
		"description": "No need to \"talk it over\" because there's really no argument here; the Salomon Dialogue Dual Boa Snowboard Boots are a keeper. A fully moldable liner with Ultralon foam, an easy to use Focus Boa® dual closure system, and the smooth flex and dogged heel hold Salomon boots are known for allow you to throw down with supreme confidence. The only discussion should be between you and the snow.",
		"image": "1653400472463.jpg",
		"price": "279.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 9,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "DC Control Boa Step On Snowboard Boots 2021",
		"formattedTitle": "dc-control-boa-step-on-snowboard-boots-",
		"brand": "dc",
		"description": "Pairing DC's legendary out-of-the-box comfort with Step On® technology was always going to be a winning combination. The DC Control Step On Snowboard Boots put you in the driving seat, setting a new standard for comfort, performance, and ease of use. They feature a medium flex, dual-zone Boa closure, and heat-moldable White Liners with internal ankle harnesses that keep you buckled in no matter what. As for the Step On® interface, it's everything you ever wanted and more - quick, intuitive, and solid as a rock. Once you click in there's no going back - the DC Control Step On Snowboard Boots are here to stay.",
		"image": "1653400476013.jpg",
		"price": "279.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 217,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Step-On"
	},
	{
		"title": "DC Shuksan Boa Snowboard Boots 2021",
		"formattedTitle": "dc-shuksan-boa-snowboard-boots-",
		"brand": "dc",
		"description": "If snowboarding is your sport, your life, and the thing you look forward to more than anything, then these are your boots. The DC Shuksan Snowboard Boots feature an athletic-inspired design and Boa closure system for an on-point fit that holds and works with you. Strategically-placed Carbitex adds responsiveness and support without adding weight, making the Shuksan strong and agile. In other words, these boots are the athlete of the family. They also look awesome, with colorways in jet black or lightning yellow. People will take notice, not for the boots you're wearing, but the performance you'll deliver while wearing them. If you're at a point in your snowboarding life where you are ready to embody the gnar-gnar, embrace the DC Shuksan Snowboard Boots.",
		"image": "1653400479628.jpg",
		"price": "279.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 60,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Very Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Ride Jackson Snowboard Boots 2023",
		"formattedTitle": "ride-jackson-snowboard-boots-",
		"brand": "ride",
		"description": "The Ride Jackson Snowboard Boots pair all mountain capability with everyday comfort that won't leave you hobbling at the end of the day. The heat moldable Intuition™ Support Liner ensures a close, personalized fit, while the fast and easy Boa® closure makes hopping in and out second nature. Complete with Flex Lite 2.0 Soles and both internal and external J bars, the Ride Jackson Snowboard boots take your riding from the steep and deep to pak laps and groomer zoomers with ease.",
		"image": "1653400482706.jpg",
		"price": "279.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 46,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo STW Double Boa Snowboard Boots 2023",
		"formattedTitle": "thirtytwo-stw-double-boa-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "All about comfort and convenience, the thirtytwo STW Double Boa Snowboard Boots are a softer, freestyle-oriented style that are light on your feet and long on performance. With Double Boa closure and great heel hold when you're pushing the limits, the STW DB simply gets it done.",
		"image": "1653400486241.jpg",
		"price": "279.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 26,
		"type": "boots",
		"gender": "men",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Ruler Boa Snowboard Boots 2021",
		"formattedTitle": "burton-ruler-boa-snowboard-boots-",
		"brand": "burton",
		"description": "Conquer the mountain with the Burton Ruler Boa Snowboard Boots. A medium flex that finds the balance of progressive riding and forgiving feel for all day comfort and all-mountain versatility. Customizable fit with heat moldable liners and unmatched out-of-the-box comfort, will make sure that riding all day is a breeze. Say goodbye to the days of spending time lacing boots and painful pressure points with the Burton Ruler Boa Snowboard Boots.",
		"image": "1653400490431.jpg",
		"price": "278.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 102,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®"
	},
	{
		"title": "thirtytwo Lashed Double Boa Snowboard Boots 2021",
		"formattedTitle": "thirtytwo-lashed-double-boa-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Lashed Double Boa Snowboard Boots are best-sellers for a reason. Proven durability, renowned comfort, and professional performance. The Double Boa System, heel hold kit, and heat-moldable liners will lock you in to the feeling of freedom. Just ask pro rider Chris Bradshaw. Cinch into the thirtytwo Lashed Double Boa Snowboard Boots for high support, a smooth ride, and the versatility to dig deeper into your possibilities on a snowboard.",
		"image": "1653400493313.jpg",
		"price": "274.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 235,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "DC Travis Rice Boa Snowboard Boots 2022",
		"formattedTitle": "dc-travis-rice-boa-snowboard-boots-",
		"brand": "dc",
		"description": "When you ride steep, exposed lines with touches of freestyle flair like Travis, only the DC Travis Rice Boa Snowboard Boots will do. Equipped with a dual Boa closure for quick adjustments, the Travis Rice Boa is well ventilated yet stormproof, features SuperFabric™ zones for durability, and has been updated for the year with a new Response III liner for improved comfort, customization, and stiffness.",
		"image": "1653400496196.jpg",
		"price": "272.97",
		"sized": ["S", "M", "L", "XL"],
		"stock": 52,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Very Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo Lashed Double Boa Bradshaw Snowboard Boots 2022",
		"formattedTitle": "thirtytwo-lashed-double-boa-bradshaw-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Lashed Double Boa Bradshaw Snowboard Boots kill it all day and every day. It's no mystery why they are perennial best-sellers for thirtytwo. The \"7\" flex is a great choice for powerful all-mountain riders with a desire to throw bigger tricks in and out of the park, while the double Boa Fit System provides the means to an instant and super accurate way to tension your boots on the fly.",
		"image": "1653400498849.jpg",
		"price": "271.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 59,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Swath Snowboard Boots 2020",
		"formattedTitle": "burton-swath-snowboard-boots-",
		"brand": "burton",
		"description": "The Burton Swath Snowboard Boots are the all-arounders you've been searching for. Beyond their mid-range flex that's great for all types of riding, the Swath's feature a Total Comfort Construction that provides you a super comfortable, broken-in feel right from the get go. If you're looking to avoid the situation of having a distinct pair of boots for both park and all-mountain riding, then the Burton Swath Snowboard Boots are here to answer your call.",
		"image": "1653400502698.jpg",
		"price": "271.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 30,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Quick-Pull"
	},
	{
		"title": "Salomon Dialogue Wide Snowboard Boots 2021",
		"formattedTitle": "salomon-dialogue-wide-snowboard-boots-",
		"brand": "salomon",
		"description": "With a progressive flex and a fully custom fit, the Salomon Dialogue Wide Snowboard Boots are the kicks of choice for many freestyle rippers. In addition to the moldable Response liner, a ZoneLock Lacing system allows you to hone in the flex and get it exactly as responsive as you want, in all the right places. Finally, the boot sole features tons of shock absorbent EVA to take a bit of the harshness out of overshot landings and chopped up run ins. The wide version gives you a bit of extra comfort and breathing room for your flippers.",
		"image": "1653400506362.jpg",
		"price": "269.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 199,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Quick-Pull",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Swath Snowboard Boots 2022 - Used",
		"formattedTitle": "burton-swath-snowboard-boots----used",
		"brand": "burton",
		"description": "The Burton Swath Snowboard Boots are the seven-day steppers you've been waiting for. The Swaths feature a mid-range flex that suits all types of riding, plus Total Comfort Construction that provides a super comfortable, broken-in feel right from the start. If you're looking for a pair of boots that you can rely on every day of the week, on any terrain, in all conditions, then the Burton Swath Snowboard Boots are for you.",
		"image": "1653400509012.jpg",
		"price": "267.26",
		"sized": ["S", "M", "L", "XL"],
		"stock": 122,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Quick-Pull",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Salomon Malamute Snowboard Boots 2020",
		"formattedTitle": "salomon-malamute-snowboard-boots-",
		"brand": "salomon",
		"description": "When the comfort and fit of a Salomon boot meet this much responsiveness, the result is very impressive. If you're a rider who wants pinpoint precision in any terrain or condition, who's as likely to hit warp speed on a groomer as they are to throw a surfy top turn on a natural wave, the Salomon Malamute Snowboard Boots are for you. These boots are the top of the line from one of the most revered bootmakers in the world, with unbridled performance in an unbelievably comfortable package. Salomon has cut zero corners with these.",
		"image": "1653400512702.jpg",
		"price": "265.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 112,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Very Stiff",
		"lacing_system": "Quick-Pull"
	},
	{
		"title": "Burton Ruler Boa Snowboard Boots 2021 - Used",
		"formattedTitle": "burton-ruler-boa-snowboard-boots----used",
		"brand": "burton",
		"description": "Conquer the mountain with the Burton Ruler Boa Snowboard Boots. A medium flex that finds the balance of progressive riding and forgiving feel for all day comfort and all-mountain versatility. Customizable fit with heat moldable liners and unmatched out-of-the-box comfort, will make sure that riding all day is a breeze. Say goodbye to the days of spending time lacing boots and painful pressure points with the Burton Ruler Boa Snowboard Boots.",
		"image": "1653400515628.jpg",
		"price": "251.06",
		"sized": ["S", "M", "L", "XL"],
		"stock": 131,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®"
	},
	{
		"title": "thirtytwo Lashed Double Boa Snowboard Boots 2022",
		"formattedTitle": "thirtytwo-lashed-double-boa-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Lashed Double Boa Snowboard Boots kill it all day and every day. It's no mystery then why they are perennial best-sellers for thirtytwo. The \"7\" flex is a great choice for powerful all-mountain riders with a desire to throw bigger tricks in and out of the park, while the double Boa Fit System provides the means to an instant and super accurate way to tension your boots on the fly.",
		"image": "1653400518411.jpg",
		"price": "263.46",
		"sized": ["S", "M", "L", "XL"],
		"stock": 17,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Salomon Dialogue Dual Boa Wide Snowboard Boots 2022",
		"formattedTitle": "salomon-dialogue-dual-boa-wide-snowboard-boots-",
		"brand": "salomon",
		"description": "Get it all, and more, with the Salomon Dialogue Dual Boa Wide Snowboard Boots. A full custom fit heat moldable liner, dual Boa® closures for \"just right\" fit in a snap (or a twist, as the case may be), and a wider last provide the dialed comfort and performance those with higher volume feet have been waiting for.",
		"image": "1653400521052.jpg",
		"price": "262.46",
		"sized": ["S", "M", "L", "XL"],
		"stock": 213,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "thirtytwo Lashed Double Boa Snowboard Boots 2021 - Used",
		"formattedTitle": "thirtytwo-lashed-double-boa-snowboard-boots----used",
		"brand": "thirtytwo",
		"description": "The thirtytwo Lashed Double Boa Snowboard Boots are best-sellers for a reason. Proven durability, renowned comfort, and professional performance. The Double Boa System, heel hold kit, and heat-moldable liners will lock you in to the feeling of freedom. Just ask pro rider Chris Bradshaw. Cinch into the thirtytwo Lashed Double Boa Snowboard Boots for high support, a smooth ride, and the versatility to dig deeper into your possibilities on a snowboard.",
		"image": "1653400524728.jpg",
		"price": "261.24",
		"sized": ["S", "M", "L", "XL"],
		"stock": 38,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Ruler Boa Snowboard Boots 2021",
		"formattedTitle": "burton-ruler-boa-snowboard-boots-",
		"brand": "burton",
		"description": "Conquer the mountain with the Burton Ruler Boa Snowboard Boots. A medium flex that finds the balance of progressive riding and forgiving feel for all day comfort and all-mountain versatility. Customizable fit with heat moldable liners and unmatched out-of-the-box comfort, will make sure that riding all day is a breeze. Say goodbye to the days of spending time lacing boots and painful pressure points with the Burton Ruler Boa Snowboard Boots.",
		"image": "1653400527584.jpg",
		"price": "259.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 89,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®"
	},
	{
		"title": "Nidecker Hylite H-Lock Focus Snowboard Boots 2020",
		"formattedTitle": "nidecker-hylite-h-lock-focus-snowboard-boots-",
		"brand": "nidecker",
		"description": "Here's a good-looking, durable boot that fits well and performs even better. The Nidecker Hylite H-Lock Focus Snowboard Boots feature Heel-Lock Focus and Boa® lacing for customized hold and fit. Comfort is king in these boots thanks to the Gold-Level Heat-Moldable liner and 3D-Molded Triple Density footbed. Lace up, lock in, and look how far you've come in the Nidecker Hylite H-Lock Focus Snowboard Boots.",
		"image": "1653400530519.jpg",
		"price": "259.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 159,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo Zephyr Premium Spring Break Snowboard Boots 2021",
		"formattedTitle": "thirtytwo-zephyr-premium-spring-break-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "Surf's up! It's spring break and you know what that means — five weekdays in a row surfing soft spring corn wearing the thirtytwo Zephyr Premium Spring Break Snowboard Boots. The right mix of style and tech makes these boots perfect for casual but killer snowboarding. Slush it up with your buds or straight-line to oblivion, Recoil Flex Control lets you up or down the stiffness based on your mood. Upgraded with a performance rubber outsole and padded with energy foam, the thirtytwo Zephyr Premium Spring Break Snowboard Boots boots give you the kind of comfort that you feel on the first Friday of spring break.",
		"image": "1653400533381.jpg",
		"price": "259.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 220,
		"type": "boots",
		"gender": "men",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "K2 Darko Snowboard Boots 2023",
		"formattedTitle": "k2-darko-snowboard-boots-",
		"brand": "k2",
		"description": "When you're mostly riding the park, you don't need the mega-stiff flex found in most of the freeride boots on the market. The plus side of that is that awesome freestyle boots like the K2 Darko Snowboard Boots just happen to be crazy comfortable as well. This smooth flexing freestyler has a traditional lacing system with a Boa-secured Intuition liner. It keeps it simple so you can keep it stylish, feeling good and ripping park laps all day long.",
		"image": "1653400536052.jpg",
		"price": "259.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 7,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Ride Triad Snowboard Boots 2023",
		"formattedTitle": "ride-triad-snowboard-boots-",
		"brand": "ride",
		"description": "When it comes to your gear, simplicity matters. And it doesn't get any simpler than laces. The Ride Triad Snowboard Boots have been a rider favorite for years, and it's easy to see why. They continue to rank with the best thanks to features like grippy Flex Lite 2.0 Soles and impact absorbing +SLIME Midsoles, not to mention Ride's excellent In2grated™ Construction amd 1:1 Lasting. If you're in the market for a capable, straightforward boot that gets the job done no questions asked, try the Ride Triad Snowboard Boots on for size.",
		"image": "1653400539547.jpg",
		"price": "259.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 65,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo Bandito x Christenson Snowboard Boots 2022",
		"formattedTitle": "thirtytwo-bandito-x-christenson-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "Loose, relaxed, and in a word, \"surfy,\" the thirtytwo Bandito x Christenson Snowboard Boots take design inspiration from Chris Christenson and are appropriately named after his 9'4\" Bandito mega-gun. When the rhythm of the ocean is your template and you want that feeing on snow, the new Bandito boots have your name on them. A fresh surf-style internal harness and liner put the emphasis on max articulation with great heel hold, providing a unique riding feel. The roots revival theme carries on with the rustic full leather uppers and trad lacing system, so feel free to let your hair down and embrace the flow.",
		"image": "1653400542270.jpg",
		"price": "256.24",
		"sized": ["S", "M", "L", "XL"],
		"stock": 236,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Soft",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Rome Bodega Boa Snowboard Boots 2022",
		"formattedTitle": "rome-bodega-boa-snowboard-boots-",
		"brand": "rome",
		"description": "The Rome Bodega Boa Snowboard Boots are a freestyle behemoth with a softer flex and functional simplicity. A Focus Double Boa system keeps your feet locked in place while a Gripflex rubber outsole and and fully heat moldable liner mean you can stay upright and comfy all day long.",
		"image": "1653400545120.jpg",
		"price": "254.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 100,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "DC Shuksan Boa Snowboard Boots 2020",
		"formattedTitle": "dc-shuksan-boa-snowboard-boots-",
		"brand": "dc",
		"description": "With a name like Shuksan, it has to be good (and they are). DC Shuksan Boa Snowboard Boots take their name from the location of the Mt. Baker Ski Area, the spiritual home of Snowboarding with a capital S. They're built very stiff, to handle the type of riding you'll encounter at Baker, like blasting out of a chute into a chunder field. They're light and solid, for hiking to the goods. They look dope, because why not. These boots aren't messing around, because they're for snowboarding--the most important thing in the galaxy.",
		"image": "1653400547998.jpg",
		"price": "249.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 102,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Very Stiff",
		"lacing_system": "Boa®"
	},
	{
		"title": "thirtytwo Light Snowboard Boots 2023",
		"formattedTitle": "thirtytwo-light-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Light JP Snowboard Boots are the footwear of choice for team rider JP Walker, with ample support and less weight for better maneuverability and more air. A great choice for rails, ramps and powder riding where hiking is involved, the light features a medium \"4\" flex and classic lace system.",
		"image": "1653400551442.jpg",
		"price": "249.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 243,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo Light JP Snowboard Boots 2023",
		"formattedTitle": "thirtytwo-light-jp-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Light JP Snowboard Boots are the footwear of choice for team rider JP Walker, with ample support and less weight for better maneuverability and more air. A great choice for rails, ramps and powder riding where hiking is involved, the light features a medium \"4\" flex and classic lace system.",
		"image": "1653400554062.jpg",
		"price": "249.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 44,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "K2 Raider Snowboard Boots 2021",
		"formattedTitle": "k2-raider-snowboard-boots-",
		"brand": "k2",
		"description": "These boots are all about ease of use and durability. The Intuition Comfort liner are (you guessed it) mad comfy right out of the box, and the full rubber outsoles are grippy and long lasting. These boots slip on easily with a fast-in liner lacing system and crank down tight for optimum performance. For a first snowboard boot, or just a mellow-flexing all day comfortable resort rider, you can't go wrong with the K2 Raider Snowboard Boots.",
		"image": "1653400557726.jpg",
		"price": "187.46",
		"sized": ["S", "M", "L", "XL"],
		"stock": 49,
		"type": "boots",
		"gender": "men",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "Salomon Dialogue Dual Boa Wide Snowboard Boots 2022 - Used",
		"formattedTitle": "salomon-dialogue-dual-boa-wide-snowboard-boots----used",
		"brand": "salomon",
		"description": "Get it all, and more, with the Salomon Dialogue Dual Boa Wide Snowboard Boots. A full custom fit heat moldable liner, dual Boa® closures for \"just right\" fit in a snap (or a twist, as the case may be), and a wider last provide the dialed comfort and performance those with higher volume feet have been waiting for.",
		"image": "1653400561393.jpg",
		"price": "236.21",
		"sized": ["S", "M", "L", "XL"],
		"stock": 135,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "Burton Ruler Snowboard Boots 2022",
		"formattedTitle": "burton-ruler-snowboard-boots-",
		"brand": "burton",
		"description": "Conquer the mountain with the Burton Ruler Snowboard Boots. A medium flex that finds the balance of progressive riding and forgiving feel for all day comfort and all-mountain versatility. Customizable fit with heat moldable liners and unmatched out-of-the-box comfort, will make sure that riding all day is a breeze. Say goodbye to the days of spending time lacing boots and painful pressure points with the Burton Ruler Snowboard Boots.",
		"image": "1653400565229.jpg",
		"price": "229.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 216,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Quick-Pull"
	},
	{
		"title": "thirtytwo STW Double Boa Snowboard Boots 2022",
		"formattedTitle": "thirtytwo-stw-double-boa-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "An \"easy-to-love\" and \"forgiving when you mess up\" boot with twice the convenience thanks to its dual Boa controls, the STW Double Boa Snowboard Boots connect you to your bindings with maximum comfort and minimum drama. With true 1:1 lasting and dependable heel hold, these boots make it easy to find your feet some good partners.",
		"image": "1653400567934.jpg",
		"price": "209.91",
		"sized": ["S", "M", "L", "XL"],
		"stock": 72,
		"type": "boots",
		"gender": "men",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Vans Aura Pro Snowboard Boots 2022",
		"formattedTitle": "vans-aura-pro-snowboard-boots-",
		"brand": "vans",
		"description": "The Vans Aura Pro Snowboard Boots is a solid all around option for riders who like the locked-in feel of a two reel Boa system but prefer a mid flexing boot for more versatility. They feature a Smartwool-lined inner for warmth, comfort, and moisture-wicking prowess, plus an all-new V2 Waffle Pro Outsole for outstanding boardfeel and grippy scramblability.",
		"image": "1653400571792.jpg",
		"price": "246.49",
		"sized": ["S", "M", "L", "XL"],
		"stock": 227,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®"
	},
	{
		"title": "K2 Boundary Snowboard Boots 2022",
		"formattedTitle": "k2-boundary-snowboard-boots-",
		"brand": "k2",
		"description": "The K2 Boundary Snowboard Boots roam the zone between freeride and freestyle, giving you one boot that delivers the best of both worlds. They come with a park friendly flex, but can rail hard when pushed - ideal for riders looking to bring their favorite party tricks to the rest of the mountain. Dual H4/M3 Zonal Boa® dials let you control the fit to a T and the Intuition® Control Foam 3D liner with 3-Point Harness locks you in like no other. Live on the Boundary and rejoice.",
		"image": "1653400576231.jpg",
		"price": "242.21",
		"sized": ["S", "M", "L", "XL"],
		"stock": 98,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "thirtytwo Lashed Bradshaw Snowboard Boots 2022",
		"formattedTitle": "thirtytwo-lashed-bradshaw-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Lashed Snowboard Boots slay park and pow alike - and have for years. This proven classic is still the one to beat when you're shopping for an all-rounder to ride any type of conditions, and the traditional lace version is still the choice of many experienced riders. The thirtytwo Lashed Bradshaw Snowboard Boots feature a special black-grey-orange colorway that's super sick, and primed for Halloween.",
		"image": "1653400579044.jpg",
		"price": "239.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 87,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Ride Deadbolt Snowboard Boots 2020",
		"formattedTitle": "ride-deadbolt-snowboard-boots-",
		"brand": "ride",
		"description": "Lock the doors, because the Ride Deadbolt Snowboard Boots are so hot your friends might be clamoring like mad animals to take them out for a spin. Hard-charging freestyle riders and all-mountain black-diamond maulers, these are the boots for you. Adjustable Power Straps let you customize the amount of response and adjust your fit quickly. With the Ride Deadbolt Snowboard Boots you get superb edge-to-edge control, heat-moldable wrap liners, grippy Michelin Fiberlite Outsoles, and boots with some of the sickest looks around.",
		"image": "1653400582703.jpg",
		"price": "239.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 232,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®"
	},
	{
		"title": "DC Travis Rice Boa Snowboard Boots 2020",
		"formattedTitle": "dc-travis-rice-boa-snowboard-boots-",
		"brand": "dc",
		"description": "These are the boots T.Rice wears. Boom. Done. DC Travis Rice Boa Snowboard Boots have been designed to stay comfortable in the least comfortable conditions, be light when the going gets heavy, and pretty much just live up to the demands of the planet's most demanding snowboarder. Again: these are the boots T.Rice wears. Go forth and do something irrational!",
		"image": "1653400586491.jpg",
		"price": "239.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 190,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Very Stiff",
		"lacing_system": "Boa®"
	},
	{
		"title": "Nitro Club Boa Snowboard Boots 2021",
		"formattedTitle": "nitro-club-boa-snowboard-boots-",
		"brand": "nitro",
		"description": "There's no annual fee, no membership card, and no secret handshake needed to join this club. The Nitro Club Boa Snowboard Boots deliver bomber all mountain performance to all comers with a dialed blend of flexibility, response, precision, and play. Just as happy nuking down big lines as they are carving, buttering, and sending it off kickers large and small, these versatile boots feature heat moldable Cloud 5 Liners and Dual Boa® Lacing to keep the fit tweaked to perfection without having to waste time unlacing. See you in the Club.",
		"image": "1653400589995.jpg",
		"price": "239.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 199,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Salomon Faction Boa Snowboard Boots 2023",
		"formattedTitle": "salomon-faction-boa-snowboard-boots-",
		"brand": "salomon",
		"description": "If you're trying to get the hang of snowboarding, you need boots that are as comfy as your favorite sneakers. The Salomon Faction Boa® Snowboard Boots bring everyday comfort to newer riders, thanks to their sneaker-inspired design and shock-absorbing D-Light outsole. The soft flex is ideal for progression and the custom fit liner is optimized to mold to your feet in the most common problem zones for dialed-in perfection.",
		"image": "1653400593626.jpg",
		"price": "239.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 53,
		"type": "boots",
		"gender": "men",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo Shifty Boa Snowboard Boots 2023",
		"formattedTitle": "thirtytwo-shifty-boa-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "Surf and tweak to your hearts content in the thirtytwo Shifty Boa Snowboard Boots - they're thirtytwo's softest adult option and ready to rip with a convenient single Boa closure and tons of lightweight, streamlined style.",
		"image": "1653400597322.jpg",
		"price": "239.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 113,
		"type": "boots",
		"gender": "men",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Ruler Wide Snowboard Boots 2021",
		"formattedTitle": "burton-ruler-wide-snowboard-boots-",
		"brand": "burton",
		"description": "Put an end to pain and conquer the mountain with the extra forefoot room of the Burton Ruler Wide Snowboard Boots. A medium flex that finds the balance of progressive riding and forgiving feel for all day comfort and all-mountain versatility. Customizable fit with heat moldable liners and unmatched out-of-the-box comfort, will make sure that riding all day is a breeze. Say goodbye to the days of spending time manually lacing boots and painful pressure points with the Burton Ruler Wide Snowboard Boots.",
		"image": "1653400601159.jpg",
		"price": "235.09",
		"sized": ["S", "M", "L", "XL"],
		"stock": 242,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Quick-Pull"
	},
	{
		"title": "thirtytwo STW Double Boa Snowboard Boots 2022 - Used",
		"formattedTitle": "thirtytwo-stw-double-boa-snowboard-boots----used",
		"brand": "thirtytwo",
		"description": "An \"easy-to-love\" and \"forgiving when you mess up\" boot with twice the convenience thanks to its dual Boa controls, the STW Double Boa Snowboard Boots connect you to your bindings with maximum comfort and minimum drama. With true 1:1 lasting and dependable heel hold, these boots make it easy to find your feet some good partners.",
		"image": "1653400604613.jpg",
		"price": "234.60",
		"sized": ["S", "M", "L", "XL"],
		"stock": 143,
		"type": "boots",
		"gender": "men",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "DC Judge Boa Snowboard Boots 2021",
		"formattedTitle": "dc-judge-boa-snowboard-boots-",
		"brand": "dc",
		"description": "All rise for the honorable DC Judge Boa Snowboard Boots. The Judge means business, but looks cool as a cucumber. And that's not all. These boots deliver custom comfort and secure heel-hold thanks to the dual zone Boa closure system. Plus, they're tough as nails thanks to the stiff flex and rugged Vibram outsoles. If you want to control your own destiny on the slopes, get in the DC Judge Snowboard Boots.",
		"image": "1653400608899.jpg",
		"price": "230.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 99,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Ride Lasso Pro Wide Snowboard Boots 2021 - Used",
		"formattedTitle": "ride-lasso-pro-wide-snowboard-boots----used",
		"brand": "ride",
		"description": "The Ride Lasso Pro Wide Snowboard Boots are a beefed up version of Ride's popular Lasso boot, in a wider last. They feature a Boa Coiler system and and Intuition wrap liner for even distribution of pressure and a firm yet consistent flex. This responsive, comfortable boot shines everywhere from the steeps to the half pipe.",
		"image": "1653400612590.jpg",
		"price": "230.37",
		"sized": ["S", "M", "L", "XL"],
		"stock": 142,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Ride 92 Snowboard Boots 2020",
		"formattedTitle": "ride-92-snowboard-boots-",
		"brand": "ride",
		"description": "The Ride 92 Snowboard Boots are all that and a metaphorical bag of chips. Fitted with a two-zone BOA closure system and a wrap liner for luxurious levels of support from an all-terrain freestyle boot, you can enjoy maximum comfort with an easy entry and exit for convenience that puts vending machines to shame. Ride's Flex Slime Tongue gives ample rebound to cushion you through your tricks, carves, and trenches laid, while internal and external J bars help keep your foot properly seated for quick power transfer and dialed-in response.",
		"image": "1653400615973.jpg",
		"price": "229.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 94,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®"
	},
	{
		"title": "Vans Aura OG Snowboard Boots 2022",
		"formattedTitle": "vans-aura-og-snowboard-boots-",
		"brand": "vans",
		"description": "Simple, lightweight, and effective. The Vans Aura OG Snowboard Boots provide the durability and performance you need out of an all-mountain boot, but with a pared-down design that doesn't distract itself with all of the bells and whistles. The single Boa system will have you dialed in for a good time, and a forgiving flex and super comfortable liner will help you get the most out of any style of riding.",
		"image": "1653400619706.jpg",
		"price": "199.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 31,
		"type": "boots",
		"gender": "men",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Medium",
		"lacing_system": "Boa®"
	},
	{
		"title": "Salomon Launch Lace SJ Boa Snowboard Boots 2022",
		"formattedTitle": "salomon-launch-lace-sj-boa-snowboard-boots-",
		"brand": "salomon",
		"description": "The Salomon Launch Lace Boa SJ Snowboard Boots are a light, nimble feeling freestyle boot employing Salomon's exclusive STR8JKT support system for the liner and a combination of Boa® closure plus traditional laces for the outer. This clever arrangement keeps the heel fit super snug but lessens the chance of a catastrophic cable break from the edges of your (or someone else's) board. These boots are a favorite of Salomon's team riders, and for good reason.",
		"image": "1653400623306.jpg",
		"price": "229.46",
		"sized": ["S", "M", "L", "XL"],
		"stock": 198,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Nitro Club Boa Snowboard Boots 2021 - Used",
		"formattedTitle": "nitro-club-boa-snowboard-boots----used",
		"brand": "nitro",
		"description": "There's no annual fee, no membership card, and no secret handshake needed to join this club. The Nitro Club Boa Snowboard Boots deliver bomber all mountain performance to all comers with a dialed blend of flexibility, response, precision, and play. Just as happy nuking down big lines as they are carving, buttering, and sending it off kickers large and small, these versatile boots feature heat moldable Cloud 5 Liners and Dual Boa® Lacing to keep the fit tweaked to perfection without having to waste time unlacing. See you in the Club.",
		"image": "1653400627261.jpg",
		"price": "227.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 188,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Salomon Dialogue Focus Boa Snowboard Boots 2021",
		"formattedTitle": "salomon-dialogue-focus-boa-snowboard-boots-",
		"brand": "salomon",
		"description": "With a progressive flex and a fully custom fit, the Salomon Dialogue Focus Boa Snowboard Boots are the kicks of choice for many freestyle rippers. In addition to the moldable Response liner, a dual Boa system allows you to hone in the flex and get it exactly as responsive as you want, in all the right places. Finally, the boot sole features tons of shock absorbent EVA to take a bit of the harshness out of overshot landings and chopped up run ins.",
		"image": "1653400631169.jpg",
		"price": "227.47",
		"sized": ["S", "M", "L", "XL"],
		"stock": 43,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo STW Double Boa Snowboard Boots 2021",
		"formattedTitle": "thirtytwo-stw-double-boa-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "Full customization meets ultimate comfort in the thirtytwo STW Double Boa Snowboard Boots. The dual zone precision fit keeps you locked into the comfort liner, footbed, and harness, giving your feet cold-weather serenity inside your boots while you experience the ever-changing mountain terrain. Find who you are as a snowboarder in the thirtytwo STW Double Boa Snowboard Boots. You'll get more out of a season pass if you have gear that supports your urge to ride from first chair to last.",
		"image": "1653400635097.jpg",
		"price": "224.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 213,
		"type": "boots",
		"gender": "men",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Moto Boa Snowboard Boots 2021",
		"formattedTitle": "burton-moto-boa-snowboard-boots-",
		"brand": "burton",
		"description": "The Burton Moto Boa Snowboard Boots have been in the Burton lineup for 17 years. With over a decade under its belt, the careful refinement of these legendary boots have made them a must for any novice to experienced shredder who needs the best soft flex boot on the mountain. Stay warm and dry while you carve some surfy lines without any toe drag thanks to the Shrinkage™ footprint reduction technology. Ultimate comfort and an easy-to-use Boa® Coiler™ lacing system make the Burton Moto Boa Snowboard Boots a must for creative riding and park tweaks.",
		"image": "1653400638209.jpg",
		"price": "224.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 3,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Soft",
		"lacing_system": "Boa®"
	},
	{
		"title": "Salomon Launch Boa SJ Snowboard Boots 2022",
		"formattedTitle": "salomon-launch-boa-sj-snowboard-boots-",
		"brand": "salomon",
		"description": "The Salomon Launch Boa SJ Snowboard Boots are favorites among park and pipe aficionados the world over, and not without reason. Salomon's STR8JKT system really does grab your heel and midfoot and produce a remarkable fit, the light weight and clean design work well in a freestyle environment, and the heat-moldable liner is super comfy. Do what you want after you strap in, but ignore the Launch Boa SJ at your peril.",
		"image": "1653400640929.jpg",
		"price": "224.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 20,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Salomon Dialogue Focus Boa Snowboard Boots 2019",
		"formattedTitle": "salomon-dialogue-focus-boa-snowboard-boots-",
		"brand": "salomon",
		"description": "Catering to the freestyle fanatic, the Salomon Dialogue Focus Boa Snowboard Boots blends the speed and convenience of Boa with the full flexing performance of the ever popular Dialogue chassis. To ensure a premium fit, Salomon's equipped these boots with heat moldable Gold Liners and Heel Cage tech to virtually eliminate any potential heel-lift. Dial in precision and performance in the park this year with the Salomon Dialogue Focus Boa Snowboard Boots.",
		"image": "1653400645000.jpg",
		"price": "224.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 84,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®"
	},
	{
		"title": "K2 Lewiston Snowboard Boots 2022",
		"formattedTitle": "k2-lewiston-snowboard-boots-",
		"brand": "k2",
		"description": "The K2 Lewiston Snowboard Boots hit the mark for both versatility and comfort - the kind of boots that you can just put on and ride without a second thought. They're very lightweight with a super clean, straightforward design, and they pack just right amount of tech without going overboard.",
		"image": "1653400648623.jpg",
		"price": "223.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 237,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "Burton Ruler Wide Snowboard Boots 2021 - Used",
		"formattedTitle": "burton-ruler-wide-snowboard-boots----used",
		"brand": "burton",
		"description": "Put an end to pain and conquer the mountain with the extra forefoot room of the Burton Ruler Wide Snowboard Boots. A medium flex that finds the balance of progressive riding and forgiving feel for all day comfort and all-mountain versatility. Customizable fit with heat moldable liners and unmatched out-of-the-box comfort, will make sure that riding all day is a breeze. Say goodbye to the days of spending time manually lacing boots and painful pressure points with the Burton Ruler Wide Snowboard Boots.",
		"image": "1653400651534.jpg",
		"price": "223.34",
		"sized": ["S", "M", "L", "XL"],
		"stock": 71,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Quick-Pull"
	},
	{
		"title": "Vans Hi-Standard Pro Snowboard Boots 2022",
		"formattedTitle": "vans-hi-standard-pro-snowboard-boots-",
		"brand": "vans",
		"description": "Simple, low-key Van's style in a lace up design that never fails to perform, the Vans Hi-Standard Pro Snowboard Boots are a classic that won't go away. The V2 Ultracush with Smartwool liner uses Merino wool to actively keep your feet dry all day, which translates to better riding and more warmth. An old-school design that ranks among the best.",
		"image": "1653400654637.jpg",
		"price": "220.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 123,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo Lashed Snowboard Boots 2022",
		"formattedTitle": "thirtytwo-lashed-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Lashed Snowboard Boots slay park and pow alike - and have for years. This proven classic is still the one to beat when you're shopping for an all-rounder to ride any type of conditions. The traditional lace version is still the choice of many experienced riders. Get in the Lashed and see what all the fuss is and has been about.",
		"image": "1653400657422.jpg",
		"price": "220.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 212,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Vans Standard XF Snow MTE Pow Surfing Boots 2022",
		"formattedTitle": "vans-standard-xf-snow-mte-pow-surfing-boots-",
		"brand": "vans",
		"description": "When there's a meter of fresh in his driveway, Wolle Nyvelt pulls on the Vans Standard XF Snow MTE Snowboard Boots. When he can finally get his car out, he's ready to go powsurfing - the MTE grippy sole with its inverted waffle pattern is ready to do its thing, the velcro powerstrap gets the tension just right, and the snowboard-inspired V2 Popcush footbed is oh-so comfy when riding a bindingless setup in pow. If powsurfing is your thing, you won't want anything else.",
		"image": "1653400660318.jpg",
		"price": "220.00",
		"sized": ["S", "M", "L", "XL"],
		"stock": 69,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Medium",
		"lacing_system": "Traditional"
	},
	{
		"title": "Ride Rook Snowboard Boots 2023",
		"formattedTitle": "ride-rook-snowboard-boots-",
		"brand": "ride",
		"description": "If you're gonna hit the big leagues, you're gonna need quality gear. The Ride Rook Snowboard Boots rescue you from the morning rental scrum to get you out on the snowsooner. They offer a mid-flexing design with a comfortable Intuition® Plush Foam liner and easy-to-adjust Boa® H4 closure system. A fantastic, progression-friendly choice for riders with big ambitions.",
		"image": "1653400663876.jpg",
		"price": "219.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 188,
		"type": "boots",
		"gender": "men",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo STW Boa Snowboard Boots 2022",
		"formattedTitle": "thirtytwo-stw-boa-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "Great comfort straight out of the box, a softer flex ideal for new riders or park progression, and the convenience of a single Boa closure are just a few of the details that make the thirtytwo STW Boa Snowboard Boots a great choice for both beginning and experienced riders. When it's time to get up off the couch and make some turns, the thirtytwo STW Boa Snowboard Boots are ready and waiting.",
		"image": "1653400667537.jpg",
		"price": "186.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 46,
		"type": "boots",
		"gender": "men",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Vans Invado OG Snowboard Boots 2023",
		"formattedTitle": "vans-invado-og-snowboard-boots-",
		"brand": "vans",
		"description": "The Vans Invado OG Snowboard Boots have those classic Off the Wall looks you know and love, along with fat stacks of modern freestyle performance. The Hybrid Boa system provide bomber heel hold to keep you locked in the driver's seat no matter what, and the flex is a perfect balance of forgiving and responsive for optimal park and all-mountain stylin'.",
		"image": "1653400670914.jpg",
		"price": "219.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 170,
		"type": "boots",
		"gender": "men",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Medium",
		"lacing_system": "Traditional, Boa®"
	},
	{
		"title": "Burton Ruler Snowboard Boots 2022 - Used",
		"formattedTitle": "burton-ruler-snowboard-boots----used",
		"brand": "burton",
		"description": "Conquer the mountain with the Burton Ruler Snowboard Boots. A medium flex that finds the balance of progressive riding and forgiving feel for all day comfort and all-mountain versatility. Customizable fit with heat moldable liners and unmatched out-of-the-box comfort, will make sure that riding all day is a breeze. Say goodbye to the days of spending time lacing boots and painful pressure points with the Burton Ruler Snowboard Boots.",
		"image": "1653400674743.jpg",
		"price": "218.49",
		"sized": ["S", "M", "L", "XL"],
		"stock": 6,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Quick-Pull"
	},
	{
		"title": "Nidecker Helios Focus Boa Snowboard Boots 2020",
		"formattedTitle": "nidecker-helios-focus-boa-snowboard-boots-",
		"brand": "nidecker",
		"description": "The Nidecker Helios Focus Boa Snowboard Boots are responsive snowboarding kicks that are smooth on the outside, cushioned on the inside, and ride like a bat out of hell. Silver Level Heat Moldable liners offer stellar board feel with premium comfort and an ergonomic fit and keep your heel flush for control thanks to the integrated internal harness. The B.F.T. Vibram® Ascent outsoles on the Nidecker Helios Focus Boa Snowboard Boots handle icy conditions in stride, and the Silvadur™ Antimicrobial lined interior helps you avoid killing everyone's appetite for lunch when you let your tired dogs loose in the lodge.",
		"image": "1653400678354.jpg",
		"price": "215.97",
		"sized": ["S", "M", "L", "XL"],
		"stock": 185,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®"
	},
	{
		"title": "Nidecker Triton Snowboard Boots 2022",
		"formattedTitle": "nidecker-triton-snowboard-boots-",
		"brand": "nidecker",
		"description": "Having trouble balancing the budget while you set up your rocking new winter setup? Well, the Nidecker Triton Snowboard Boots are here to help. The Triton is a teched up mid-soft boot that offers performance-forward quality and innovative features that frankly, could cost a whole bunch more! The Dual Zone Boa features fabric-wrapped laces and the H4 Coiler™, allowing users to adjust the lower and upper boot independently. The Triton has 5 degrees of forward lean, so rider's won't feel the need to constantly use their edges, making it perfect for intermediate shredders who want less edge bite during the progression.",
		"image": "1653400681971.jpg",
		"price": "215.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 134,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo Lashed Crab Grab Snowboard Boots 2022",
		"formattedTitle": "thirtytwo-lashed-crab-grab-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "Now we're talking - thirtytwo's most versatile boot in a Crab Grab black, white and red colorway? The thirtytwo Lashed Crab Grab Snowboard Boots might not fulfill your EVERY fantasy, but that's one big one out of the way.",
		"image": "1653400685579.jpg",
		"price": "215.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 160,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo TM-Two Double Boa Wide Snowboard Boots 2022 - Used",
		"formattedTitle": "thirtytwo-tm-two-double-boa-wide-snowboard-boots----used",
		"brand": "thirtytwo",
		"description": "And you thought the regular thirtytwo boots were wide and comfy? It wasn't enough for Bode Merrill, and he asked for an even wider build on his pro model. The result is the thirtytwo TM-Two Double Boa Wide Snowboard Boots, which add another 18mm of width in the forefoot for true Sasquatch foot relief. This is a stout boot with a \"7\" flex and dual Boa® Fit System closures. It deserves a close look if your feet are seriously wide.",
		"image": "1653400688453.jpg",
		"price": "215.57",
		"sized": ["S", "M", "L", "XL"],
		"stock": 171,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Ride Anthem Snowboard Boots 2021",
		"formattedTitle": "ride-anthem-snowboard-boots-",
		"brand": "ride",
		"description": "Oh yeah, these boots are comfy as heck. Park your lamborfeeties in these luxury garages and you're in for a good time. The Ride Anthem Snowboard Boots come with a shmedium flex and extra plush liners that ensure all-day comfort. A favorite of up and coming riders, snowboard instructors, and dedicated après enthusiasts. These boots handle well on the slopes, and never give you a hard time.",
		"image": "1653400692253.jpg",
		"price": "212.46",
		"sized": ["S", "M", "L", "XL"],
		"stock": 13,
		"type": "boots",
		"gender": "men",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Ride Jackson Snowboard Boots 2021",
		"formattedTitle": "ride-jackson-snowboard-boots-",
		"brand": "ride",
		"description": "The Ride Jackson Snowboard Boots are some of the highest quality mid-flexing boots on the market. Fitted with my of the features found on Ride's top-of-the-line freeride boots, like an H4 Boa system and Intuition liners, these boots are ready to rock it right out of the box.",
		"image": "1653400695597.jpg",
		"price": "209.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 34,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Salomon Dialogue Snowboard Boots 2019",
		"formattedTitle": "salomon-dialogue-snowboard-boots-",
		"brand": "salomon",
		"description": "Step into the Salomon Dialogue Snowboard Boots and you'll find the confidence-inspiring foot lockers you've been looking for, from the terrain park to the backcountry booter and beyond. Superior comfort from the Ortholite C2 insole pairs with a Flight + outsole to soak up the shock of hard landings. A progressive, medium flex makes tweaks easy while still providing you with enough support for all day happy feet.",
		"image": "1653400699236.jpg",
		"price": "209.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 223,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Quick-Pull"
	},
	{
		"title": "DC The Laced Boot Snowboard Boots 2021",
		"formattedTitle": "dc-the-laced-boot-snowboard-boots-",
		"brand": "dc",
		"description": "The skate-inspired DC Laced Snowboard Boots strike a beautiful balance between support and flexibility. The premium traditional lacing is super convenient but also infinitely adjustable. They look and feel like a pair of skate shoes. The kind that gives you that new-kicks, extra-pep-in-your-step kind of feeling that you get when you're walking down the hall to the last school period of the day. You won't just feel good wearing these, you'll perform better. DC says the Laced Snowboard Boots are the most responsive laced setup they've ever built, and we agree.",
		"image": "1653400702659.jpg",
		"price": "209.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 99,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Vans Hi-Standard Pro Snowboard Boots 2022 - Used",
		"formattedTitle": "vans-hi-standard-pro-snowboard-boots----used",
		"brand": "vans",
		"description": "Simple, low-key Van's style in a lace up design that never fails to perform, the Vans Hi-Standard Pro Snowboard Boots are a classic that won't go away. The V2 Ultracush with Smartwool liner uses Merino wool to actively keep your feet dry all day, which translates to better riding and more warmth. An old-school design that ranks among the best.",
		"image": "1653400705351.jpg",
		"price": "176.79",
		"sized": ["S", "M", "L", "XL"],
		"stock": 130,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Ruler Boa Snowboard Boots 2021 - Used",
		"formattedTitle": "burton-ruler-boa-snowboard-boots----used",
		"brand": "burton",
		"description": "Conquer the mountain with the Burton Ruler Boa Snowboard Boots. A medium flex that finds the balance of progressive riding and forgiving feel for all day comfort and all-mountain versatility. Customizable fit with heat moldable liners and unmatched out-of-the-box comfort, will make sure that riding all day is a breeze. Say goodbye to the days of spending time lacing boots and painful pressure points with the Burton Ruler Boa Snowboard Boots.",
		"image": "1653400708310.jpg",
		"price": "207.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 124,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®"
	},
	{
		"title": "K2 Darko Snowboard Boots 2022",
		"formattedTitle": "k2-darko-snowboard-boots-",
		"brand": "k2",
		"description": "A freestyle staple since the day, the K2 Darko Snowboard Boots combine a traditional lace-up exterior with a Boa® laced Intuition® Control Foam inner liner to create a boot that fits park riders' need perfectly. A medium-flexing classic that's still ruling from the bottoms of your feet.",
		"image": "1653400712608.jpg",
		"price": "207.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 163,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Strap"
	},
	{
		"title": "Rome Bodega Hybrid Boa Snowboard Boots 2022",
		"formattedTitle": "rome-bodega-hybrid-boa-snowboard-boots-",
		"brand": "rome",
		"description": "For riders who want a softer boot that doesn't compromise on performance, the Rome Bodega Hybrid Boa Snowboard Boots are for you. A Pro F.I.T. Liner is fully heat-moldable for maximum comfort and performance, while a Hybrid Heel Lock Boa and lace system makes strapping in and staying locked a breeze. Embrace your freestyle side with the Rome Bodega Hybrid Boa Snowboard Boots.",
		"image": "1653400716616.jpg",
		"price": "204.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 61,
		"type": "boots",
		"gender": "men",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Medium",
		"lacing_system": "Traditional, Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Moto Boa Snowboard Boots 2021 - Used",
		"formattedTitle": "burton-moto-boa-snowboard-boots----used",
		"brand": "burton",
		"description": "The Burton Moto Boa Snowboard Boots have been in the Burton lineup for 17 years. With over a decade under its belt, the careful refinement of these legendary boots have made them a must for any novice to experienced shredder who needs the best soft flex boot on the mountain. Stay warm and dry while you carve some surfy lines without any toe drag thanks to the Shrinkage™ footprint reduction technology. Ultimate comfort and an easy-to-use Boa® Coiler™ lacing system make the Burton Moto Boa Snowboard Boots a must for creative riding and park tweaks.",
		"image": "1653400720935.jpg",
		"price": "202.46",
		"sized": ["S", "M", "L", "XL"],
		"stock": 19,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Soft",
		"lacing_system": "Boa®"
	},
	{
		"title": "DC Control Boa Snowboard Boots 2020",
		"formattedTitle": "dc-control-boa-snowboard-boots-",
		"brand": "dc",
		"description": "DC Control Boa Snowboard Boots give you dominion over your foot-to-board interface. From their ultra-grippy soles to the pinpoint adjustability of their dual zone Boa closure system, you're always in charge. These boots are made with the rider who does it all in mind: if there's snow, you're on it. These are lightweight, durable, and a proven favorite.",
		"image": "1653400724942.jpg",
		"price": "199.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 33,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®"
	},
	{
		"title": "K2 Maysis Snowboard Boots 2020",
		"formattedTitle": "k2-maysis-snowboard-boots-",
		"brand": "k2",
		"description": "Powerful riders need powerful boots for powerful riding, and the K2 Maysis Snowboard Boots are the power-to-the-floor big line and steeps boots for the trench laying shredder. Internal and external J bars pack excellent heel hold to keep responsiveness high for reliable control, with 3D formed EVA foam in the footbeds to help your feet hold up better during all out descents, inspired moments in the park, and anywhere your sideways ripping takes you. Boa® lacing systems make it easy to dial in a custom and secure fit with easy exit for convenience on the mountain. The K2 Maysis Snowboard Boots are performance boots for the all-terrain snow traveler with a confident style.",
		"image": "1653400728334.jpg",
		"price": "199.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 205,
		"type": "boots",
		"gender": "men",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®"
	},
	{
		"title": "DC Judge Boa Snowboard Boots 2020",
		"formattedTitle": "dc-judge-boa-snowboard-boots-",
		"brand": "dc",
		"description": "Here comes the Judge! The DC Judge Boa Snowboard Boots slams the gavel down hard on stiff, high-performance boots: case closed. These babies have everything you're looking for: dual Boa dials, tons of support, and a perfect Vibram sole. Throw these on and you're instantly equipped to deliver justice to the mountains.",
		"image": "1653400731477.jpg",
		"price": "199.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 214,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®"
	},
	{
		"title": "Vans Hi Standard OG Snowboard Boots 2023",
		"formattedTitle": "vans-hi-standard-og-snowboard-boots-",
		"brand": "vans",
		"description": "The standard-bearer for classic style and modern performance, the Vans Hi-Standard OG Snowboard Boots continues to be one of the best-selling boots on the market. Keeping the comfort and familiarity of your favorite Vans, the Hi-Standard OG offers a traditional lace-up closure and key features like an Instep Lace Lockout and Internal Web Harness. With a V1 Waffle Lug Outsoles and an iconic Vans side stripe, the timelessness of the OG speaks for itself.",
		"image": "1653400735013.jpg",
		"price": "199.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 160,
		"type": "boots",
		"gender": "men",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional"
	},
	{
		"title": "thirtytwo Shifty Snowboard Boots 2023",
		"formattedTitle": "thirtytwo-shifty-snowboard-boots-",
		"brand": "thirtytwo",
		"description": "Surf and tweak to your hearts content in the thirtytwo Shifty Boa Snowboard Boots - they're thirtytwo's softest adult option and ready to rip with a convenient single Boa closure and tons of lightweight, streamlined style.",
		"image": "1653400738779.jpg",
		"price": "199.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 220,
		"type": "boots",
		"gender": "men",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	}
]
