[
	{
		"title": "thirtytwo Hight MTB Boa Snowboard Boots - Women's 2023",
		"formattedTitle": "thirtytwo-hight-mtb-boa-snowboard-boots---women's-",
		"brand": "thirtytwo",
		"description": "When you're dropping hairball lines in the middle of nowhere and using a split to get to the goods, you need a super burly boot with enough articulation to skin with. In other words, you need the thirtytwo Hight MTB Boa Snowboard Boots, designed just for this sort of uncompromising riding. With a pedal-to-the-metal \"10\" flex, dual Boa closures, a full length gaiter to keep snow and ice at bay, and a flexible walk mode collar for the uphills, this purpose-built tool is as unique as it is practical.",
		"image": "1653400792702.jpg",
		"price": "699.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 82,
		"type": "boots",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Very Stiff",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Supreme Snowboard Boots - Women's 2022",
		"formattedTitle": "burton-supreme-snowboard-boots---women's-",
		"brand": "burton",
		"description": "Nacho Supreme, Burrito Supreme, Burton Supreme. Just as the name suggests, the Burton Supreme Snowboard Boots reign supreme in terms of performance. They feature PowerUP Tongues for high speed stiffness and response, DryRide lining and sleeping bag reflective foil for lasting warmth and comfort on the coldest days, and Speed Zone lacing for a precise fit that won't fail you when the going gets tough. With durability to perform every day, all season, in any conditions, the Burton Supreme Snowboard Boots will usher in your reign over the mountain.",
		"image": "1653400795345.jpg",
		"price": "440.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 73,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Quick-Pull",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Felix Step On Snowboard Boots - Women's 2022",
		"formattedTitle": "burton-felix-step-on-snowboard-boots---women's-",
		"brand": "burton",
		"description": "Bid farewell to fiddly straps and the forced up'n'down squats routine before every run. The Burton Felix Step On Snowboard Boots offer the unrivaled convenience of the Step On system along with the all comfort and performance you need to shred your best this season. Driven by comfort and tuned for response, the Felix Step On Snowboard Boots offer an Imprint™ 3 Liner and a women's specific cuff that provides you with a broken-in feel straight out of the box. With their mid-stiff flex and Dual Zone Boa® System, feel free to go for it while reaping the rewards of the Step On connection!",
		"image": "1653400799140.jpg",
		"price": "439.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 242,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Step-On"
	},
	{
		"title": "thirtytwo TM-Two X Hight Snowboard Boots - Women's 2023",
		"formattedTitle": "thirtytwo-tm-two-x-hight-snowboard-boots---women's-",
		"brand": "thirtytwo",
		"description": "A new split-friendly design for riders who don't always straightline 60 degree spines, as well as more playful sorts and those with smaller frames, the thirtytwo TM-Two X Hight Snowboard Boots are based on the tried-and-true TM-Two boot with a flex of 7 out of 10 (the MTB is a 10). A walk mode collar and grippy Vibram® sole make getting to the goods a reality rather than a hope, and a smooth zip-up gaiter keeps the front of the boot clear of snow and ice. Get it so you can get there.",
		"image": "1653400803200.jpg",
		"price": "424.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 168,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Traditional",
		"binding_style": "Strap"
	},
	{
		"title": "thirtytwo TM-Two Double Boa Snowboard Boots - Women's 2023",
		"formattedTitle": "thirtytwo-tm-two-double-boa-snowboard-boots---women's-",
		"brand": "thirtytwo",
		"description": "The thirtytwo TM-Two Double Boa Snowboard Boots give you the speed and convenience of Boa® along with the classic TM-Two performance and fit. If you're looking for a single boot to cover everything from steep pow to park laps, this is one of the very best options out there.",
		"image": "1653400806953.jpg",
		"price": "419.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 158,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "K2 Format Snowboard Boots - Women's 2023",
		"formattedTitle": "k2-format-snowboard-boots---women's-",
		"brand": "k2",
		"description": "The K2 Format Snowboard Boots are stiff, high-performance big mountain boots that offer dialed precision to the rowdiest riders. They're loaded with features designed to help you ride fast and fluidly through technical terrain . A dual-zone Boa system on the outside keeps your shell cranked, while the simple, bombproof 3-point harness on the Intuition Pro Foam liner keeps your heel locked down. Topped off with a Vibram outsole to help dampen vibrations from harsh snow, these boots have everything you need to get after it.",
		"image": "1653400810249.jpg",
		"price": "399.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 188,
		"type": "boots",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Ride Cadence Snowboard Boots - Women's 2023",
		"formattedTitle": "ride-cadence-snowboard-boots---women's-",
		"brand": "ride",
		"description": "The Ride Cadence Snowboard Boots are the stiffest women's boot in the Ride lineup, but that's not the whole story. They deliver everything you expect from a high performance all-terrain crusher without compromising on comfort. Heat moldable Intuition™ Dream Liners offer a close, precise fit, along with upgraded Impacto™ Elite Insoles to cushion landings and dampen vibration. For ripping ladies seeking a no-compromise tool for all their riding, the Ride Cadence Snowboard Boots deliver in spades.",
		"image": "1653400812870.jpg",
		"price": "399.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 101,
		"type": "boots",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "K2 Estate Snowboard Boots - Women's 2023",
		"formattedTitle": "k2-estate-snowboard-boots---women's-",
		"brand": "k2",
		"description": "The K2 Estate Snowboard Boots are excellent snowboard boots for a wide variety of all-mountain riders. They have a smooth mid-stiff flex that provides excellent control and power transfer for expert riders. But they're also super comfortable and approachable, making them a good choice for high-level intermediates. The Vibram RollSole is exceptionally comfortable, fighting fatigue even after a full day on your feet. Paired with a fully customizable Boa fit system, both on the shell and in the liner, the Estate boots combine high tech comfort with good old fashioned performance in a way that few boots can.",
		"image": "1653400817330.jpg",
		"price": "379.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 148,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "Ride Hera Pro Snowboard Boots - Women's 2023",
		"formattedTitle": "ride-hera-pro-snowboard-boots---women's-",
		"brand": "ride",
		"description": "Bring the heat to your feet with the Ride Hera Pro Snowboard Boots. The Hera Pros bring the same all mountain capability and comfort as the Heras, along with a stiffer flex that's well suited to advanced freeriders laying the hammer down in big, bad terrain. The good news is they don’t skimp on comfort, thanks to Intuition™ Trap Liners that provide an incredibly precise fit after a single heat mold. With 1:1 lasting, Ride’s excellent In2grated™ Construction, and improved insoles to cushion your landings, the Ride Hera Pro Snowboard Boots are the right choice for every line.",
		"image": "1653400819991.jpg",
		"price": "379.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 128,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "K2 Kinsley Clicker X HB Snowboard Boots - Women's 2022",
		"formattedTitle": "k2-kinsley-clicker-x-hb-snowboard-boots---women's-",
		"brand": "k2",
		"description": "Fiddling around with straps and laces is old news. Snowboarding can be as easy as twisting a dial and clicking a boot in. Don't believe us? Check out the K2 Kinsley Clicker X HB Snowboard Boots. Boa® lacing is easy to use with gloves on, featuring a three reel system to independently tighten upper and lower for the perfect fit, and Clicker step-in technology makes your transition from chairlift to pow field speedier and smoother than ever. With a heat moldable Intuition® Control Foam 3D Liner and 3-Point Harness to keep you comfortable and locked in, the Kinsley Clicker X HB is the perfect boot for riders who just can't quit.",
		"image": "1653400823806.jpg",
		"price": "295.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 94,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "K2 Clicker"
	},
	{
		"title": "Salomon Kiana Dual Boa Snowboard Boots - Women's 2023",
		"formattedTitle": "salomon-kiana-dual-boa-snowboard-boots---women's-",
		"brand": "salomon",
		"description": "You'll never have to sacrifice style for performance thanks to the Salomon Kiana Dual Boa® Snowboard Boots. The liner is heat-moldable in the most-needed areas and the dual Boa® system offers a locked-in feeling with a few quick twists. The Damplite+ and Contagrip® outsoles are durable and shock-absorbing and the lightweight Fit to Ride construction preserves your energy so you can carve perfect turns and stomp landings all day long.",
		"image": "1653400826665.jpg",
		"price": "369.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 184,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "K2 Trance Snowboard Boots - Women's 2023",
		"formattedTitle": "k2-trance-snowboard-boots---women's-",
		"brand": "k2",
		"description": "The K2 Trance Snowboard Boots are all about solid, all-mountain performance. They accomplish this task with a mid-stiff flex pattern, customizable fit, and top-notch heel hold. The boot uses a double reel Boa system on the outside and a quick-pull harness on the liner to keep your feet locked in place, letting you pressure your edges harder and lay out your carves deeper than ever before.",
		"image": "1653400830220.jpg",
		"price": "359.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 130,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "Ride Karmyn Zonal Snowboard Boots - Women's 2023",
		"formattedTitle": "ride-karmyn-zonal-snowboard-boots---women's-",
		"brand": "ride",
		"description": "The Ride Karmyn Zonal Snowboard Boots are ideal for freestyle rippers who like their boots a little on the al dente side. Their not-so-noodly medium flex ensures confidence inducing performance when things get spicy outside the park, but they're perfectly capable of hitting jumps and grinding rails til the cows come home, too. A Boa® Zonal Fit System makes it easy to crank things down without taking your gloves off, and Ride's new Impacto™ Ultra Insoles provide the cushioning you need to push the limit. A fantastic all rounder.",
		"image": "1653400833271.jpg",
		"price": "359.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 34,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Ritual LTD Step On Snowboard Boots - Women's 2022",
		"formattedTitle": "burton-ritual-ltd-step-on-snowboard-boots---women's-",
		"brand": "burton",
		"description": "Just one more time: remind us again why we're still using strap bindings that haven't fundamentally changed in 40 years. Is it just tradition? Because the Burton Ritual LTD Step On Snowboard Boots are the easiest to use boots on the market. There's no straps or laces to worry about in your whole setup. Just slip your feet in, crank down the dials, and step on your board, and you're ready to start shredding. The dual zone Boa gets you the most precise fit available, and the Ritual has a smooth medium flex that's perfect and comfy for all-mountain riding, park laps, or even an impromptu après dance party. Burn your straps, it's time for new Rituals.",
		"image": "1653400836499.jpg",
		"price": "350.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 82,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Step-On"
	},
	{
		"title": "thirtytwo Lashed Double Boa Snowboard Boots - Women's 2023",
		"formattedTitle": "thirtytwo-lashed-double-boa-snowboard-boots---women's-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Lashed Double Boa Snowboard Boots are a classic that need no introduction - a standard in the snowboard industry for everything from blower pow days to hours-long sessions in the park and everything in between. Incredible comfort, awesome heel retention, and now the convenience of dual Boa closures so you can hit the snow that much quicker.",
		"image": "1653400839338.jpg",
		"price": "349.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 92,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "thirtytwo Lashed Double Boa Melancon Snowboard Boots - Women's 2023",
		"formattedTitle": "thirtytwo-lashed-double-boa-melancon-snowboard-boots---women's-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Lashed Double Boa Snowboard Boots are a classic that need no introduction - a standard in the snowboard industry for everything from blower pow days to hours-long sessions in the park and everything in between. Incredible comfort, awesome heel retention, and now the convenience of dual Boa closures so you can hit the snow that much quicker. The thirtytwo Lashed Double Boa Melancon Snowboard Boots offer a unique colorway in this boot, so you won't be able to mistake your feet from everyone else's on the hill.",
		"image": "1653400842876.jpg",
		"price": "349.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 176,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "thirtytwo Lashed Double Boa B4BC Snowboard Boots - Women's 2023",
		"formattedTitle": "thirtytwo-lashed-double-boa-b4bc-snowboard-boots---women's-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Lashed Double Boa Snowboard Boots are a classic that need no introduction - a standard in the snowboard industry for everything from blower pow days to hours-long sessions in the park and everything in between. Incredible comfort, awesome heel retention, and now the convenience of dual Boa closures so you can hit the snow that much quicker. Now is your chance to rock the thirtytwo Lashed Double Boa B4BC Snowboard Boots and get a superb ride while benefitting Boarding for Breast Cancer.",
		"image": "1653400846208.jpg",
		"price": "349.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 227,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "Ride Hera Pro Snowboard Boots - Women's 2022",
		"formattedTitle": "ride-hera-pro-snowboard-boots---women's-",
		"brand": "ride",
		"description": "If you’re looking to drop into the burliest lines and biggest booters, lace up the Ride Hera Pro Snowboard Boots and get after it. The Hera Pros come with a relatively stiff flex that will be suited to advanced riders laying the hammer, but they don’t skimp on comfort, with Intuition Wrap Liners that provide an incredibly precise fit after a single heat mold. Throw in 1:1 lasting, Ride’s excellent In2grated™ Construction, and a velcro calf adjuster on the boot cuff to get the fit just right, and you've got a boot to keep you dancing until the lifts stop spinning.",
		"image": "1653400849173.jpg",
		"price": "341.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 68,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "K2 Contour Snowboard Boots - Women's 2023",
		"formattedTitle": "k2-contour-snowboard-boots---women's-",
		"brand": "k2",
		"description": "The K2 Contour Snowboard Boots are super stiff and super comfortable. Blending the support and response necessary for pro riders like Hannah Eddy with the all-day comfort required by regular resort riders, the Contour is the best of both worlds. They're undoubtedly badass boots that will support your freeride antics no matter how hard you charge, and they'll have you feeling so good, you might just forget to take them off when you get back to the car.",
		"image": "1653400853138.jpg",
		"price": "329.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 195,
		"type": "boots",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "Ride Hera Snowboard Boots - Women's 2023",
		"formattedTitle": "ride-hera-snowboard-boots---women's-",
		"brand": "ride",
		"description": "Slipping into your favorite pair of shoes just hits different. But your favorite pair of snowboard boots? The Ride Hera Snowboard Boots are up to the task. Their heat moldable Intuition™ Support Liners deliver personalized comfort, along with a balanced medium flex that covers all the bases for your riding without leaving you wanting for more. For all day comfort and performance you can count on, the Ride Hera Snowboard Boots have you covered.",
		"image": "1653400856203.jpg",
		"price": "329.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 183,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Limelight Step On Snowboard Boots - Women's 2022",
		"formattedTitle": "burton-limelight-step-on-snowboard-boots---women's-",
		"brand": "burton",
		"description": "Burton Step Ons have passed the gimmick test, and they've proven they're legit. The Burton Limelight Step On Snowboard Boots continue to perform in a world without straps, buckles, or top-of-the-lift stress. These classically styled boots feature a medium flex and an Imprint 2 liner for all-mountain excellence and versatility. They keep your feet warm and comfy, whether your day consists of riding hard on bumpy terrain, surfing powder, or taking a lap or two in between parking lot BBQ sessions. Step into the Limelight Step On and realize the most intuitive connection to your board.",
		"image": "1653400858812.jpg",
		"price": "324.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 2,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Step-On"
	},
	{
		"title": "Ride Hera Pro Snowboard Boots - Women's 2022 - Used",
		"formattedTitle": "ride-hera-pro-snowboard-boots---women's----used",
		"brand": "ride",
		"description": "If you’re looking to drop into the burliest lines and biggest booters, lace up the Ride Hera Pro Snowboard Boots and get after it. The Hera Pros come with a relatively stiff flex that will be suited to advanced riders laying the hammer, but they don’t skimp on comfort, with Intuition Wrap Liners that provide an incredibly precise fit after a single heat mold. Throw in 1:1 lasting, Ride’s excellent In2grated™ Construction, and a velcro calf adjuster on the boot cuff to get the fit just right, and you've got a boot to keep you dancing until the lifts stop spinning.",
		"image": "1653400862142.jpg",
		"price": "324.86",
		"sized": ["S", "M", "L", "XL"],
		"stock": 102,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "K2 Format Snowboard Boots - Women's 2022",
		"formattedTitle": "k2-format-snowboard-boots---women's-",
		"brand": "k2",
		"description": "Designed for women who push the limits both inbounds and out, the K2 Format Snowboard Boot is a super supportive boot for laying deep trenches and conquering steep lines. With Boa®'s premium H4/M3 dual fit system, a super moldable Intuition® Pro Foam 3D liner with SpaceHeater™ for comfort, and internal 3-Point Harness Liner Lacing for the best heel hold in the business, the Format is the boot for lady chargers who don't take slow for an answer.",
		"image": "1653400865158.jpg",
		"price": "319.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 240,
		"type": "boots",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "Ride Cadence Snowboard Boots - Women's 2022",
		"formattedTitle": "ride-cadence-snowboard-boots---women's-",
		"brand": "ride",
		"description": "Hit your stride with the Ride Cadence Focus Boa Snowboard Boots and find out why this boot rules the world of freeriding. With a stiff, responsive flex, the dual zone Boa® H4 Focus Fit System, and Lock Down™ Turbo lacing, the Cadence gives strong riders the support and rock solid heel hold they crave. Now with a grippier Michelin® Traverse sole for more secure booting to that hard-to-reach line, the Ride Cadence Snowboard Boots will help you find your happy place.",
		"image": "1653400868184.jpg",
		"price": "319.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 39,
		"type": "boots",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Salomon Ivy Boa SJ Boa Snowboard Boots - Women's 2023",
		"formattedTitle": "salomon-ivy-boa-sj-boa-snowboard-boots---women's-",
		"brand": "salomon",
		"description": "The Salomon Ivy Boa® SJ Snowboard Boots offer a tried-and-true fit and medium flex that's great for newer riders and advanced freestyle shredders alike. The double Boa® system with a STR8JKT Boa® Harness keep your heel locked in and the Fit to Ride construction is streamlined for a slimmer profile. The Comfort Liner is great out of the box but can also be heat molded to your foot specifications too, so you'll never have boot woes again.",
		"image": "1653400870840.jpg",
		"price": "319.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 110,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo TM-Two Double Boa Snowboard Boots - Women's 2022",
		"formattedTitle": "thirtytwo-tm-two-double-boa-snowboard-boots---women's-",
		"brand": "thirtytwo",
		"description": "The thirtytwo TM-Two Double Boa Snowboard Boots add a double Boa fit system to the classic all-mountain TM-2. While gaining speedy adjustments, they retain the proven mid-stiff flex and power of the lace version. The TM-Two DB gets the ultra-moldable Performance Liner with its locked in internal harness, plus an articulated cuff for super smooth progression.",
		"image": "1653400874445.jpg",
		"price": "314.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 173,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Ritual LTD Boa Snowboard Boots - Women's 2022 - Used",
		"formattedTitle": "burton-ritual-ltd-boa-snowboard-boots---women's----used",
		"brand": "burton",
		"description": "Some rituals are better than others, and the Burton Ritual LTD Boa Snowboard Boots are among the finest. Built around a women's specific True Fit™ design this top-end Burton boot delivers great out-of-the-box comfort and the medium flex is the perfect choice for all-mountain riders who don't want to be limited to any single style of riding. The Dual Zone Boa® lacing is quick and intuitive to use with gloves on, a huge positive for all day comfort.",
		"image": "1653400876647.jpg",
		"price": "291.56",
		"sized": ["S", "M", "L", "XL"],
		"stock": 41,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "K2 Estate Snowboard Boots - Women's 2022",
		"formattedTitle": "k2-estate-snowboard-boots---women's-",
		"brand": "k2",
		"description": "Estate wagons. Estate planning. K2 Estate Snowboard Boots. The luxury implicit in the name isn't bogus - the Estate blends the extravagance of Boa®'s Focus Fit System (Boa® inside and out), a toasty Intuition® Pro Foam liner with SpaceHeater™ technology to keep your feet warm, and a Vibram® RollSole outsole for walking ease and safety.",
		"image": "1653400880028.jpg",
		"price": "303.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 42,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "DC Lotus Boa Step On Snowboard Boots - Women's 2022",
		"formattedTitle": "dc-lotus-boa-step-on-snowboard-boots---women's-",
		"brand": "dc",
		"description": "What do you get when you pair DC's legendary out-of-the-box comfort with the unrivaled convenience of Step On® technology? The DC Lotus Boa Step On Snowboard Boots, and a whole new standard for everyone else to catch up to. Updated with DC's latest Response II Liner and an improved Dual Zone BOA® Fit System, these puppies have the performance and fit you need to squeeze the juice out of every turn.",
		"image": "1653400883118.jpg",
		"price": "299.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 66,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Step-On"
	},
	{
		"title": "thirtytwo TM-Two Double Boa Snowboard Boots - Women's 2021",
		"formattedTitle": "thirtytwo-tm-two-double-boa-snowboard-boots---women's-",
		"brand": "thirtytwo",
		"description": "The thirtytwo TM-Two Double Boa Snowboard Boots give all-mountain girls the best fit they can ask for with the Double Boa System. Performance liners provide support, flexibility, and heel-hold so you can confidently drive your edge anywhere on the mountain regardless of conditions. Cushioned by lightweight evolution foam, you'll feel right at home in the thirtytwo TM-Two Double Boa Snowboard Boots, whether it's day one or day one hundred.",
		"image": "1653400885984.jpg",
		"price": "299.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 122,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "K2 Kinsley Snowboard Boots - Women's 2023",
		"formattedTitle": "k2-kinsley-snowboard-boots---women's-",
		"brand": "k2",
		"description": "Comfort, fit, and performance are the hallmarks of the K2 Kinsley Snowboard Boots. The Intuition Control foam liners hug your feet like fluffy slippers, making you feel happy and safe, even if you're standing in a lift line for half the day. The dual-zone Boa system allows you to dial in just the right tightness, snuggling up those slipper-like liners to optimum tightness so the boot becomes an extension of your foot. Finally, the perfect medium flex of the shell allows you to transfer your weight seamlessly into your edges, turning the whole board into an extension of your boots, flowing down the fall line while the whole mountain turns into an extension of your soul.",
		"image": "1653400890193.jpg",
		"price": "299.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 172,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "Ride Context Snowboard Boots - Women's 2023",
		"formattedTitle": "ride-context-snowboard-boots---women's-",
		"brand": "ride",
		"description": "You known what they say: if it ain't broke, don't fix it. And laces sure as heck ain't broke. The Ride Context Snowboard Boots offer the best of both worlds. Traditional laces allow you to tweak the outer boot to perfection, while a dial-up-the-tightness Boa® Tongue Tied™ liner locks your ankle and heel in for the duration, no questions asked. Updated with an all new Impacto™ Ultra Insole for improved comfort on heavy landings and chattery snow, this freeride boot will have you riding on cloud 9 all season long.",
		"image": "1653400892917.jpg",
		"price": "299.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 117,
		"type": "boots",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo Lashed Melancon Snowboard Boots - Women's 2023",
		"formattedTitle": "thirtytwo-lashed-melancon-snowboard-boots---women's-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Lashed Melancon Snowboard Boots are Desiree's choice when it comes to stomping strong urban lines, which she does as well as anyone. Add a little color to your footwear choice this season with this grey-mint-aqua boot that's consistently proven itself in both freeride and freestyle venues the world over.",
		"image": "1653400896080.jpg",
		"price": "299.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 117,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo Lashed Snowboard Boots - Women's 2023",
		"formattedTitle": "thirtytwo-lashed-snowboard-boots---women's-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Lashed Snowboard Boots aren't exactly new on the scene, and that's a good thing. A long-time favorite of team riders and customers alike, the Lashed delivers outstanding performance and fit with a medium \"6\" flex and a traditional lace closure system that gets the fit dialed in just right every time.",
		"image": "1653400898379.jpg",
		"price": "299.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 34,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Ride Karmyn Zonal Snowboard Boots - Women's 2022",
		"formattedTitle": "ride-karmyn-zonal-snowboard-boots---women's-",
		"brand": "ride",
		"description": "The Ride Karmyn Zonal Snowboard Boots are for the freestyle ripper who still wants to kill it high up on the mountain, and needs a slightly stiffer flexing boot to do it. The new Karmyn Zonal lets you dial in the fit in 2 separate zones using the Boa® Zonal Fit System. When your riding doesn't fit any particular mold, and you're just as likely to spend time in the park as harvesting fresh pow in the trees, the Karmyn Zonal is your boot.",
		"image": "1653400901139.jpg",
		"price": "287.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 69,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "DC Lotus Boa Step On Snowboard Boots - Women's 2022 - Used",
		"formattedTitle": "dc-lotus-boa-step-on-snowboard-boots---women's----used",
		"brand": "dc",
		"description": "What do you get when you pair DC's legendary out-of-the-box comfort with the unrivaled convenience of Step On® technology? The DC Lotus Boa Step On Snowboard Boots, and a whole new standard for everyone else to catch up to. Updated with DC's latest Response II Liner and an improved Dual Zone BOA® Fit System, these puppies have the performance and fit you need to squeeze the juice out of every turn.",
		"image": "1653400903912.jpg",
		"price": "284.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 188,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Step-On"
	},
	{
		"title": "Ride Hera Snowboard Boots - Women's 2022",
		"formattedTitle": "ride-hera-snowboard-boots---women's-",
		"brand": "ride",
		"description": "The Ride Hera Snowboard Boots will bring you down to earth with a smooth medium flex and comfortable fit that allows riders of any level to ride like royalty. With an Intuition® Support Foam liner and the classic Boa® H4 Coiler closure system, the Hera will lock you in painlessly for the utmost in performance.",
		"image": "1653400907386.jpg",
		"price": "263.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 236,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Ritual Snowboard Boots - Women's 2022",
		"formattedTitle": "burton-ritual-snowboard-boots---women's-",
		"brand": "burton",
		"description": "Make pow-surfing a daily habit with the Burton Ritual Snowboard Boots. Made with women's specific True Fit™ design features built into every single element, the Ritual is engineered to jive with your ride and be more comfortable from the get go. Say goodbye to fiddling around with laces without your gloves on, Speed Zone™ lacing is quick, intuitive and allows you to dial in the fit of both upper and lower independently. A medium flex is perfect for everything from park jibbing to high speed cruising, so observe the sacred rite of passage and let 'er rip in the Ritual Snowboard Boots.",
		"image": "1653400911090.jpg",
		"price": "280.46",
		"sized": ["S", "M", "L", "XL"],
		"stock": 10,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Quick-Pull"
	},
	{
		"title": "DC Lotus Boa Step On Snowboard Boots - Women's 2021",
		"formattedTitle": "dc-lotus-boa-step-on-snowboard-boots---women's-",
		"brand": "dc",
		"description": "Pairing DC's legendary out-of-the-box comfort with Step On® technology was always going to be a winning combination. The DC Lotus Step On Snowboard Boots put you in the driving seat, setting a new standard for comfort, performance, and ease of use. They feature a medium flex, dual-zone Boa closure, and heat-moldable White Liners with internal ankle harnesses that keep you buckled in no matter what. As for the Step On® interface, it's everything you ever wanted and more - quick, intuitive, and solid as a rock. Once you click in there's no going back - the DC Lotus Step On Snowboard Boots are here to stay.",
		"image": "1653400915426.jpg",
		"price": "279.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 66,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Step-On"
	},
	{
		"title": "thirtytwo STW Double Boa Snowboard Boots - Women's 2023",
		"formattedTitle": "thirtytwo-stw-double-boa-snowboard-boots---women's-",
		"brand": "thirtytwo",
		"description": "The thirtytwo STW Double Boa Snowboard Boots give lighter and more freestyle-oriented riders a lighter, slightly softer-flexing option for an all-mountain boot, with a flex that runs to 3 out of 10, less reinforcing material overall, and the convenience of dual Boa® closure.",
		"image": "1653400919167.jpg",
		"price": "279.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 227,
		"type": "boots",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Limelight Boa Snowboard Boots - Women's 2022",
		"formattedTitle": "burton-limelight-boa-snowboard-boots---women's-",
		"brand": "burton",
		"description": "The Burton Limelight Boa Snowboard Boots offer the mind-boggling comfort and all-mountain performance of the classic Limelight, along with the convenience of Boa® closure. This sleekly designed boot is easy to use and ultra with an Imprint™ 2 liner and 1:1 Medium Flex PowerUP Tongue for the utmost in all terrain versatility.",
		"image": "1653400923591.jpg",
		"price": "278.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 229,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "thirtytwo Lashed Double Boa B4BC Snowboard Boots - Women's 2022",
		"formattedTitle": "thirtytwo-lashed-double-boa-b4bc-snowboard-boots---women's-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Lashed Double Boa B4BC Snowboard Boots are tools for high-level skate-inspired snowboarders like Des Melancon, and they deserve a hard look from the likes of you as well. A super solid dual Boa Fit System with Evolution Foam Cushioning provide unbelievable fit and heel lock, while the mid-stiff flex will carry you from the alpine heights back to the lift line with power like a dive-bombing falcon.",
		"image": "1653400926521.jpg",
		"price": "271.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 22,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo TM-Two Double Boa Snowboard Boots - Women's 2020",
		"formattedTitle": "thirtytwo-tm-two-double-boa-snowboard-boots---women's-",
		"brand": "thirtytwo",
		"description": "Reliable and versatile. That's the name of the game with the thirtytwo TM-Two Snowboard Boots. Crafted with dual boa lacing, a Performance Rubber outsole, and STI Energy Foam cushioning make for a low maintenance season of sends. Featuring thirtytwo's Performance Fit package with customization for heel lock and all-around comfort -- these go anywhere, do anything boots, will take your riding up to 11 this year!",
		"image": "1653400929548.jpg",
		"price": "269.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 95,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®"
	},
	{
		"title": "K2 Contour Snowboard Boots - Women's 2021",
		"formattedTitle": "k2-contour-snowboard-boots---women's-",
		"brand": "k2",
		"description": "The K2 Contour Snowboard Boots are made for women who demand unparalleled precision and performance out of their footwear. They feature the stiffest flex of any offering in the K2 women's line, making them the kicks of choice for some of the top athletes in the world. The Intuition Control liner provides a perfect blend of stability and comfort, while the premium rubber outsoles dampen vibrations and help with power transfer to the board. Bottom line is; these boots crush, big time.",
		"image": "1653400932904.jpg",
		"price": "269.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 201,
		"type": "boots",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "Burton Limelight Boa Snowboard Boots - Women's 2022 - Used",
		"formattedTitle": "burton-limelight-boa-snowboard-boots---women's----used",
		"brand": "burton",
		"description": "The Burton Limelight Boa Snowboard Boots offer the mind-boggling comfort and all-mountain performance of the classic Limelight, along with the convenience of Boa® closure. This sleekly designed boot is easy to use and ultra with an Imprint™ 2 liner and 1:1 Medium Flex PowerUP Tongue for the utmost in all terrain versatility.",
		"image": "1653400935442.jpg",
		"price": "265.01",
		"sized": ["S", "M", "L", "XL"],
		"stock": 6,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "Salomon Kiana Dual Boa Snowboard Boots - Women's 2022",
		"formattedTitle": "salomon-kiana-dual-boa-snowboard-boots---women's-",
		"brand": "salomon",
		"description": "The Salomon Kiana Dual Boa Snowboard Boots are built for both comfort and convenience, with a fully moldable Ultralon foam liner and a dual Boa® closure system that you can dial up \"just right.\" Fit to Ride construction makes this boot 10% lighter and more compact all around, allowing you to use your energy for what really matters - the riding.",
		"image": "1653400937844.jpg",
		"price": "262.46",
		"sized": ["S", "M", "L", "XL"],
		"stock": 115,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "Vans Encore Pro Snowboard Boots - Women's 2022",
		"formattedTitle": "vans-encore-pro-snowboard-boots---women's-",
		"brand": "vans",
		"description": "The Vans Encore Pro Snowboard Boots are a mid-flexing, high performance boot suitable for all types of riding. Famous for their classic Vans style and superior comfort, the Encore Pro employs the V2 Ultracush Smartwool liner and dual Boa® closure system that lets you get the tension just right on a moment's notice without removing your gloves.",
		"image": "1653400941907.jpg",
		"price": "259.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 70,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo TM-Two Snowboard Boots - Women's 2022",
		"formattedTitle": "thirtytwo-tm-two-snowboard-boots---women's-",
		"brand": "thirtytwo",
		"description": "The thirtytwo TM-Two Snowboard Boots embrace old-school versatility with a hearty hug. A powerful and livable \"7\" flex gives you the oomph that hard charging riders crave with a classic traditional lace system for infinite adjustment. A Performance Inner Harness really locks your heel in. This boot has been around for years in one form or another, and the fact that it's still a workhorse is a testament to its greatness.",
		"image": "1653400944545.jpg",
		"price": "256.24",
		"sized": ["S", "M", "L", "XL"],
		"stock": 144,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Traditional",
		"binding_style": "Strap"
	},
	{
		"title": "K2 Format Snowboard Boots - Women's 2022 - Used",
		"formattedTitle": "k2-format-snowboard-boots---women's----used",
		"brand": "k2",
		"description": "Designed for women who push the limits both inbounds and out, the K2 Format Snowboard Boot is a super supportive boot for laying deep trenches and conquering steep lines. With Boa®'s premium H4/M3 dual fit system, a super moldable Intuition® Pro Foam 3D liner with SpaceHeater™ for comfort, and internal 3-Point Harness Liner Lacing for the best heel hold in the business, the Format is the boot for lady chargers who don't take slow for an answer.",
		"image": "1653400947323.jpg",
		"price": "255.97",
		"sized": ["S", "M", "L", "XL"],
		"stock": 129,
		"type": "boots",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "thirtytwo Lashed Double Boa Melancon Snowboard Boots - Women's 2022",
		"formattedTitle": "thirtytwo-lashed-double-boa-melancon-snowboard-boots---women's-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Lashed Double Boa Melancon Snowboard Boots may be a mouthful, but you double the fun with this versatile boot that doesn't require committing to either the park or the steeps. It goes either way with ease. The great thirtytwo fit is all there, backed up by a dual Boa closure system with the Team internal harness to really lock your heel in. The graphic on the tongue has lemons, so make lemonade.",
		"image": "1653400950041.jpg",
		"price": "255.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 245,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "thirtytwo Lashed Double Boa Snowboard Boots - Women's 2022",
		"formattedTitle": "thirtytwo-lashed-double-boa-snowboard-boots---women's-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Lashed Double Boa Snowboard Boots are full of versatility to ride the park, the street or big mountains with the convenience of a dual Boa Fit System. The comfy Team Liner locks you in with a great heel and ankle fit using the Team Internal Harness, while the \"6\" flex handles any and all conditions.",
		"image": "1653400953113.jpg",
		"price": "254.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 8,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "K2 Kinsley Snowboard Boots - Women's 2022",
		"formattedTitle": "k2-kinsley-snowboard-boots---women's-",
		"brand": "k2",
		"description": "The K2 Kinsley Snowboard Boots are a mainstay of the women's lineup, and it's easy to see why. They offer solid mid-flexing performance that kills it in every type of conditions, along with a handy dual Boa® H4/M3 Zonal Fit System and K2's 3-Point Harness that dramatically improves ankle and heel fit. Add the heat moldable Intuition® Control Foam liner and you've got the everyday rider's dream boot.",
		"image": "1653400955965.jpg",
		"price": "254.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 177,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "Ride Hera Snowboard Boots - Women's 2022 - Used",
		"formattedTitle": "ride-hera-snowboard-boots---women's----used",
		"brand": "ride",
		"description": "The Ride Hera Snowboard Boots will bring you down to earth with a smooth medium flex and comfortable fit that allows riders of any level to ride like royalty. With an Intuition® Support Foam liner and the classic Boa® H4 Coiler closure system, the Hera will lock you in painlessly for the utmost in performance.",
		"image": "1653400958115.jpg",
		"price": "252.41",
		"sized": ["S", "M", "L", "XL"],
		"stock": 132,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Ride Cadence Focus Boa Snowboard Boots - Women's 2021",
		"formattedTitle": "ride-cadence-focus-boa-snowboard-boots---women's-",
		"brand": "ride",
		"description": "The stiffest women's boot in the Ride lineup, the Ride Cadence Focus Boa Snowboard Boots deliver everything you'd expect from a high performance all-mountain boot. They fit snug, and offer exceptional responsiveness when making tight turns in dicey conditions or over exposed terrain. For ripping women who want a no-compromise tool to crush the mountain, but also want a boot that's comfortable and streamlined, look no further.",
		"image": "1653400960985.jpg",
		"price": "251.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 78,
		"type": "boots",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "K2 Contour Snowboard Boots - Women's 2022",
		"formattedTitle": "k2-contour-snowboard-boots---women's-",
		"brand": "k2",
		"description": "As K2's stiffest women's specific boot, the K2 Contour Snowboard Boots are designed for the big mountain ripper who lives for the steep and deep, and loves to lay her board over at speed on the groomed. This piece of no-compromise footwear includes the Boa® H4 Fit System outer lacing and Boa® Mobility Conda™ inner lacing, along with K2's Flex Zone Upper. With its powerful flex and dialed fit, the Contour is a perennial favorite of the Alliance riders, who have a pretty good idea of what they like.",
		"image": "1653400963537.jpg",
		"price": "250.76",
		"sized": ["S", "M", "L", "XL"],
		"stock": 62,
		"type": "boots",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "K2 Haven Snowboard Boots - Women's 2022",
		"formattedTitle": "k2-haven-snowboard-boots---women's-",
		"brand": "k2",
		"description": "The K2 Haven Snowboard Boots put all of the comfort and performance found in K2's high end boots into an easy flexing package perfect for riders progressing their craft. The aptly named Intuition Comfort Liner provides an all-day feel good interior, while the trusted security of the Boa Fit system keeps your feet locked in place for optimum performance.",
		"image": "1653400967923.jpg",
		"price": "212.46",
		"sized": ["S", "M", "L", "XL"],
		"stock": 65,
		"type": "boots",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "DC Mora Boa Snowboard Boots - Women's 2022",
		"formattedTitle": "dc-mora-boa-snowboard-boots---women's-",
		"brand": "dc",
		"description": "A boot made for the far reaches of the mountain, the DC Mora Boa Snowboard Boots prepare you for deep winter exploration. A stiff, responsive flex pairs keeps you in total control when the riding gets technical, while the premium Dual Boa closure and a Stormproof flap make adjustments quick, easy, and snow-free.",
		"image": "1653400972857.jpg",
		"price": "247.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 210,
		"type": "boots",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Limelight Snowboard Boots - Women's 2022",
		"formattedTitle": "burton-limelight-snowboard-boots---women's-",
		"brand": "burton",
		"description": "The Burton Limelight Snowboard Boots haven't faded away with time - in fact they're going stronger than ever. This quick-lace version of the Limelight remains a top seller, and is known for its excellent comfort and value. It comes equipped for fun with the Imprint™ 2 heat moldable liner and a medium flex for do-it-all comfort and performance.",
		"image": "1653400976097.jpg",
		"price": "247.46",
		"sized": ["S", "M", "L", "XL"],
		"stock": 35,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Quick-Pull",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Ride Context Snowboard Boots - Women's 2022",
		"formattedTitle": "ride-context-snowboard-boots---women's-",
		"brand": "ride",
		"description": "The Ride Context Snowboard Boots combine the best of two worlds, with a traditional lace system for the outer boot and a dial-up-the-tightness Boa® Tongue Tied™ liner to lock in the ankle and heel. This is a powerful women's freeride boot with versatility to burn, and put into the right context (i.e. between your bindings and feet) it's bound to bring you joy.",
		"image": "1653400979333.jpg",
		"price": "239.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 233,
		"type": "boots",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo Lashed Double Boa Snowboard Boots - Women's 2021",
		"formattedTitle": "thirtytwo-lashed-double-boa-snowboard-boots---women's-",
		"brand": "thirtytwo",
		"description": "Updated with a performance rubber outsole and evolution foam cushioning, the best-selling thirtytwo Lashed Double Boa Snowboard Boots maintain their reputation for a reliable fit, a durable construction, and all-mountain performance. With customizable features including the heel hold kit, heat-moldable liners, and foot-zonal Double Boa System, you'll be dialed through every turn. The thirtytwo Lashed Double Boa Snowboard Boots have enough flex for experimental endeavors and plenty of support to lean into your carves and push back against variable snow.",
		"image": "1653400982694.jpg",
		"price": "239.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 103,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Salomon Ivy Boa SJ Snowboard Boots - Women's 2022",
		"formattedTitle": "salomon-ivy-boa-sj-snowboard-boots---women's-",
		"brand": "salomon",
		"description": "The venerable Ivy keeps getting better and better. In its latest incarnation, the Salomon Ivy Boa SJ Snowboard Boots get a quick and convenient dual Boa® closure system with STR8JKT harness around the liner for vastly improved heel hold. Built as a medium-flexing freestyle boot, the Ivy Boa SJ is actually extremely versatile and thrives on the open mountain as well.",
		"image": "1653400986295.jpg",
		"price": "239.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 1,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "Salomon Pearl Boa Snowboard Boots - Women's 2023",
		"formattedTitle": "salomon-pearl-boa-snowboard-boots---women's-",
		"brand": "salomon",
		"description": "The Salomon Pearl Boa Snowboard Boots are a minimal boot with maximum comfort for new riders. The D-Light outsole dampens vibrations and enhances board feel and the Boa® coiler is quick and easy to adjust. The Fit to Ride construction and heat-moldable Ultralon foam liners are designed for ultimate comfort and customization too, so you can focus on your technique, not your gear.",
		"image": "1653400989674.jpg",
		"price": "239.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 112,
		"type": "boots",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo Shifty Boa Snowboard Boots - Women's 2023",
		"formattedTitle": "thirtytwo-shifty-boa-snowboard-boots---women's-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Shifty Boa Snowboard Boots are ideal for new and lighter riders, or those who prefer a softer, more forgiving setup. With great out-of-the-box comfort and a single, super convenient Boa closure system, the Shifty is ready for duty at a moment's notice.",
		"image": "1653400993243.jpg",
		"price": "239.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 151,
		"type": "boots",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Ride Cadence Focus Boa Snowboard Boots - Women's 2021 - Used",
		"formattedTitle": "ride-cadence-focus-boa-snowboard-boots---women's----used",
		"brand": "ride",
		"description": "The stiffest women's boot in the Ride lineup, the Ride Cadence Focus Boa Snowboard Boots deliver everything you'd expect from a high performance all-mountain boot. They fit snug, and offer exceptional responsiveness when making tight turns in dicey conditions or over exposed terrain. For ripping women who want a no-compromise tool to crush the mountain, but also want a boot that's comfortable and streamlined, look no further.",
		"image": "1653400996123.jpg",
		"price": "239.39",
		"sized": ["S", "M", "L", "XL"],
		"stock": 31,
		"type": "boots",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "K2 Contour Snowboard Boots - Women's 2022 - Used",
		"formattedTitle": "k2-contour-snowboard-boots---women's----used",
		"brand": "k2",
		"description": "As K2's stiffest women's specific boot, the K2 Contour Snowboard Boots are designed for the big mountain ripper who lives for the steep and deep, and loves to lay her board over at speed on the groomed. This piece of no-compromise footwear includes the Boa® H4 Fit System outer lacing and Boa® Mobility Conda™ inner lacing, along with K2's Flex Zone Upper. With its powerful flex and dialed fit, the Contour is a perennial favorite of the Alliance riders, who have a pretty good idea of what they like.",
		"image": "1653400999429.jpg",
		"price": "238.22",
		"sized": ["S", "M", "L", "XL"],
		"stock": 157,
		"type": "boots",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "Vans Encore Pro Snowboard Boots - Women's 2020 - Used",
		"formattedTitle": "vans-encore-pro-snowboard-boots---women's----used",
		"brand": "vans",
		"description": "That same dependable comfort but now with an updated style, the Vans Encore Pro Snowboard Boots are performance-driven boot built for versatility. They feature a dual-zone Custom Focus Boa Closure System which provides unlimited on the fly micro-adjustments and superior heel hold and response. And with the V2 UltraCush liner featuring SmartWool insulation to help you stay cozy and warm no matter the temps on the hill, the Vans Encore Pro Snowboard Boots make it easy to rip all day long.",
		"image": "1653401002310.jpg",
		"price": "237.49",
		"sized": ["S", "M", "L", "XL"],
		"stock": 199,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®"
	},
	{
		"title": "Vans Encore OG Snowboard Boots - Women's 2021",
		"formattedTitle": "vans-encore-og-snowboard-boots---women's-",
		"brand": "vans",
		"description": "Simple, lightweight, and effective. The Vans Encore OG Snowboard Boots provide the durability and performance you need out of an all-mountain boot, but with a pared-down design that doesn't distract itself with all of the bells and whistles. The single Boa system will have you dialed in for a good time, and a forgiving flex and super comfortable liner will help you get the most out of any style of riding.",
		"image": "1653401006025.jpg",
		"price": "199.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 100,
		"type": "boots",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Medium",
		"lacing_system": "Boa®"
	},
	{
		"title": "thirtytwo Lashed Double Boa B4BC Snowboard Boots - Women's 2020",
		"formattedTitle": "thirtytwo-lashed-double-boa-b4bc-snowboard-boots---women's-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Lashed Double Boa B4BC Snowboard Boots combines the convenience of a dual boa closure with an iconic staple of women's snowboarding. With a middle of the road flex, superior heel hold, and customizable features for maximum comfort the Lashed brings versatile performance you can feel in every turn. These special edition Boarding 4 Breast Cancer boots use a portion of the proceeds as a donation to breast cancer research making them the perfect blend of style meets cause -- double win!",
		"image": "1653401009700.jpg",
		"price": "229.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 188,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®"
	},
	{
		"title": "Ride Hera Snowboard Boots - Women's 2021",
		"formattedTitle": "ride-hera-snowboard-boots---women's-",
		"brand": "ride",
		"description": "Named after the Queen of the Gods, this confidence inspiring all-mountain boot will make you feel regal out there. The Ride Hera Snowboard Boots have a smooth medium flex and comfortable fit that allows riders of any level to step up their game and transfer their prowess and style to the big slopes, whether it's Mt. Olympus, or your local hill.",
		"image": "1653401012648.jpg",
		"price": "229.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 215,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Vans Luna Ventana Pro Snowboard Boots - Women's 2022",
		"formattedTitle": "vans-luna-ventana-pro-snowboard-boots---women's-",
		"brand": "vans",
		"description": "When you want the best of all worlds, slip into the Vans Luna Ventana Pro Snowboard Boots. Combining the infinite customization of traditional laces with the convenience of Boa closure over the instep, these hybrid boots set a new standard for comfort, performance, and versatility in a package that's positively dripping with classic Vans style.",
		"image": "1653401016038.jpg",
		"price": "229.49",
		"sized": ["S", "M", "L", "XL"],
		"stock": 155,
		"type": "boots",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Traditional, Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo Lashed Melancon Snowboard Boots - Women's 2022",
		"formattedTitle": "thirtytwo-lashed-melancon-snowboard-boots---women's-",
		"brand": "thirtytwo",
		"description": "Desiree Melancon throws down as hard as anyone, and the thirtytwo Lashed Melancon Snowboard Boots are what's on her feet when it's time to rip. This pro model is the time-tested full lace version, desiree-able for both the ability to fine tune the tightness and reliability. You get the Team Fit liner and harness system, Performance Backstay for support, and Evolution Foam underfoot cushioning. The guts to learn big tricks comes separately.",
		"image": "1653401019453.jpg",
		"price": "229.46",
		"sized": ["S", "M", "L", "XL"],
		"stock": 158,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "K2 Sapera Snowboard Boots - Women's 2022",
		"formattedTitle": "k2-sapera-snowboard-boots---women's-",
		"brand": "k2",
		"description": "The K2 Sapera Snowboard Boots are a great choice for everyday shredders seeking a boot they can just pick up and ride. They come ready to rock with the Boa® H4 fit System, a super conforming fit courtesy of an Articulating Cuff upper and Control Foam 3D liner, and a medium flex that's super versatile for any riding application.",
		"image": "1653401022829.jpg",
		"price": "223.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 125,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "Vans Encore Pro Snowboard Boots - Women's 2021",
		"formattedTitle": "vans-encore-pro-snowboard-boots---women's-",
		"brand": "vans",
		"description": "The Vans Encore Pro Snowboard Boots have a dual-zone Focus Boa system for optimal heel hold and adjustability, and an Ultracush liner wrapped Smartwool for soft, moisture-wicking comfort. The medium flex is supple yet supportive, perfect for high level all-mountain riding, and the boot is so comfy that when 4 o'clock hits, you'll want to do it all over again.",
		"image": "1653401025643.jpg",
		"price": "223.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 151,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®"
	},
	{
		"title": "thirtytwo STW Double Boa Snowboard Boots - Women's 2022",
		"formattedTitle": "thirtytwo-stw-double-boa-snowboard-boots---women's-",
		"brand": "thirtytwo",
		"description": "The thirtytwo STW Double Boa Snowboard Boots are a softer flexing option perfect for freestyle progression and ramping up the learning curve. They feature the thirtytwo Comfort Liner and harness system for all-day comfort and solid ankle hold plus a dual Boa® Fit System. That's a combination that enables convenient everyday usability and precision.",
		"image": "1653401029086.jpg",
		"price": "220.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 239,
		"type": "boots",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Vans Standard XF Snow MTE Pow Surfing Boots 2022",
		"formattedTitle": "vans-standard-xf-snow-mte-pow-surfing-boots-",
		"brand": "vans",
		"description": "When there's a meter of fresh in his driveway, Wolle Nyvelt pulls on the Vans Standard XF Snow MTE Snowboard Boots. When he can finally get his car out, he's ready to go powsurfing - the MTE grippy sole with its inverted waffle pattern is ready to do its thing, the velcro powerstrap gets the tension just right, and the snowboard-inspired V2 Popcush footbed is oh-so comfy when riding a bindingless setup in pow. If powsurfing is your thing, you won't want anything else.",
		"image": "1653401031294.jpg",
		"price": "220.00",
		"sized": ["S", "M", "L", "XL"],
		"stock": 181,
		"type": "boots",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Medium",
		"lacing_system": "Traditional"
	},
	{
		"title": "K2 Contour Snowboard Boots - Women's 2020",
		"formattedTitle": "k2-contour-snowboard-boots---women's-",
		"brand": "k2",
		"description": "Technical terrain demands power and response from your gear and the K2 Contour Snowboard Boots deliver. Get dialed quickly thanks to BOA® reel systems and J bars that offer premium edge control thanks to supportive heel hold and a performance-oriented fit. Spaceheater™ technology helps you stay cozy and toasty while you shred the gnar, with reflective heat blanket panels that keep the warmth in and keep the chills out. When it's time to ride for results, for glory, and for love of the sport, reward your feet with the K2 Contour Snowboard Boots and go hard.",
		"image": "1653401034218.jpg",
		"price": "219.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 30,
		"type": "boots",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®"
	},
	{
		"title": "K2 Kinsley Snowboard Boots - Women's 2021",
		"formattedTitle": "k2-kinsley-snowboard-boots---women's-",
		"brand": "k2",
		"description": "This is a boot for the bell-to-bell warriors. The women out there who get first chair not just on powder days, but on all the other days too. For those of you shredding the tiny strip of man-made snow in early fall and keep showing up until the slushy parks are all melted away in late spring. The K2 Kinsley Snowboard Boots, like you, are a machine that just can't be stopped. They've got the durability and performance that you need, plus the comfort that sure doesn't hurt when you're wearing the same pair of slippers dawn to dusk everyday, all winter long.",
		"image": "1653401038014.jpg",
		"price": "219.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 63,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "K2 Benes Snowboard Boots - Women's 2022",
		"formattedTitle": "k2-benes-snowboard-boots---women's-",
		"brand": "k2",
		"description": "K2 delivers once again with the K2 Benes Snowboard Boots, targeting the all mountain comfort and convenience crowd with unerring accuracy. These mid-flexing kicks rock a sleek and clean profile, and back it up with the Boa® H4 Collar Fit System and a heat moldable Intuition® Comfort Foam liner.",
		"image": "1653401041627.jpg",
		"price": "175.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 13,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "K2 Estate Snowboard Boots - Women's 2020 - Used",
		"formattedTitle": "k2-estate-snowboard-boots---women's----used",
		"brand": "k2",
		"description": "Make yourself the CEO of send with the feature packed K2 Estate Snowboard Boots. Custom-moldable Intuition® SpaceHeater™ technology keeps your feet toasty and comfortable on the mountain and combine with a burly Vibram® RollSole for grippy traction to your favorite lines. Bringing premium features to a mid-flexing, all-mountain design, the K2 Estate Snowboard Boots are designed for intermediate to expert riders that want to the absolute best comfort and convenience without compromising on top-end performance.",
		"image": "1653401044649.jpg",
		"price": "215.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 152,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®"
	},
	{
		"title": "Ride Karmyn Snowboard Boots - Women's 2021",
		"formattedTitle": "ride-karmyn-snowboard-boots---women's-",
		"brand": "ride",
		"description": "The Ride Karmyn Snowboard Boots are built with the terrain park in mind. Their medium flex makes them a perfect boot for freestyle rippers who like their boots a bit on the al dente side. Grab a pair of Karmyn's and find out why they're the boot of choice for women who crush the freestyle and pipe game.",
		"image": "1653401047494.jpg",
		"price": "215.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 218,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo Lashed Double Boa Snowboard Boots - Women's 2021 - Used",
		"formattedTitle": "thirtytwo-lashed-double-boa-snowboard-boots---women's----used",
		"brand": "thirtytwo",
		"description": "Updated with a performance rubber outsole and evolution foam cushioning, the best-selling thirtytwo Lashed Double Boa Snowboard Boots maintain their reputation for a reliable fit, a durable construction, and all-mountain performance. With customizable features including the heel hold kit, heat-moldable liners, and foot-zonal Double Boa System, you'll be dialed through every turn. The thirtytwo Lashed Double Boa Snowboard Boots have enough flex for experimental endeavors and plenty of support to lean into your carves and push back against variable snow.",
		"image": "1653401050536.jpg",
		"price": "215.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 160,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Mint Boa Snowboard Boots - Women's 2021",
		"formattedTitle": "burton-mint-boa-snowboard-boots---women's-",
		"brand": "burton",
		"description": "The Burton Mint Boa Snowboard Boots are the only thing fresh enough for all the lines you will shred this winter. Soft, playful flex for an easy and forgiving feel with lasting comfort, perfect for beginners and experienced riders alike. The Boa® Colier™ system makes getting in and out of the boots undeniably easy, making the Burton Mint Boa Snowboard Boots a must have this year.",
		"image": "1653401055019.jpg",
		"price": "215.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 103,
		"type": "boots",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"lacing_system": "Boa®"
	},
	{
		"title": "Ride Sage Snowboard Boots - Women's 2022",
		"formattedTitle": "ride-sage-snowboard-boots---women's-",
		"brand": "ride",
		"description": "The Ride Sage Snowboard Boots are mellow and sweet. Perfect for snowboarders of all levels, the plush liners are a joy to slip your feet into, and the toned-down flex means all day enjoyment for cruising around the resort. They're as comfy as a pair of slippers and still give you the confidence to keep progressing your riding.",
		"image": "1653401059300.jpg",
		"price": "201.84",
		"sized": ["S", "M", "L", "XL"],
		"stock": 12,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Vans Encore Pro Snowboard Boots - Women's 2021 - Used",
		"formattedTitle": "vans-encore-pro-snowboard-boots---women's----used",
		"brand": "vans",
		"description": "The Vans Encore Pro Snowboard Boots have a dual-zone Focus Boa system for optimal heel hold and adjustability, and an Ultracush liner wrapped Smartwool for soft, moisture-wicking comfort. The medium flex is supple yet supportive, perfect for high level all-mountain riding, and the boot is so comfy that when 4 o'clock hits, you'll want to do it all over again.",
		"image": "1653401062704.jpg",
		"price": "212.76",
		"sized": ["S", "M", "L", "XL"],
		"stock": 237,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®"
	},
	{
		"title": "Nitro Crown TLS Snowboard Boots - Women's 2022",
		"formattedTitle": "nitro-crown-tls-snowboard-boots---women's-",
		"brand": "nitro",
		"description": "Pushing yourself out of your comfort zone doesn't have to be uncomfortable on your feet. The Nitro Crown TLS Snowboard Boots combine a smooth, responsive flex with one of the most comfortable and supportive liners in the game to bring the best out of every day. The TLS 5 lacing system is intuitive to use, snugging your foot up in all the right places, and when the time comes to kick back, the Bail Out system makes unlacing easy as pie.",
		"image": "1653401065432.jpg",
		"price": "209.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 88,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Quick-Pull",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo STW Double Boa Snowboard Boots - Women's 2021",
		"formattedTitle": "thirtytwo-stw-double-boa-snowboard-boots---women's-",
		"brand": "thirtytwo",
		"description": "The zonal lockdown control provided by the thirtytwo STW Double Boa Snowboard Boots keeps your fit dialed in beautifully so you can use that extra control to concentrate on your progression. Built on a foundation of plush excellence — a comfort Liner, footbed, and harness on top of an evolution foam sole — the thirtytwo STW Double Boa Snowboard Boots keep your feet happy while you explore the mountain. The difference-maker here is the Double Boa System, providing dual zone precision for your feet. Think of it as a performance couch with a high-tech seatbelt.",
		"image": "1653401068388.jpg",
		"price": "209.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 167,
		"type": "boots",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Ride Context Snowboard Boots - Women's 2021",
		"formattedTitle": "ride-context-snowboard-boots---women's-",
		"brand": "ride",
		"description": "The Ride Context Snowboard Boots put traditional lacing boots back where they belong, at the head of the pack. Providing a stiff and comfortable platform for all-around rippin' excellence, the Context boots feature women's specific calf adjustment and Ride's new Waffle Flex soles made for stomping.",
		"image": "1653401072668.jpg",
		"price": "209.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 194,
		"type": "boots",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo Lashed Snowboard Boots - Women's 2021",
		"formattedTitle": "thirtytwo-lashed-snowboard-boots---women's-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Lashed Snowboard Boots are the do-it-all pair you need to put your winter to good use. Customizable features include the heel hold kit and heat-moldable liners that'll have you're feet singing through every turn. The thirtytwo Lashed Snowboard Boots have enough comfort to dazzle a terrain park with ample support to dig deep into your carves and stand up to pushy snow. Don't wait on these reliable, pro-model boots that Desiree Melancon holds so dear.",
		"image": "1653401075446.jpg",
		"price": "209.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 116,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo TM-Two Snowboard Boots - Women's 2020",
		"formattedTitle": "thirtytwo-tm-two-snowboard-boots---women's-",
		"brand": "thirtytwo",
		"description": "Reliable and versatile. That's the name of the game with the thirtytwo TM-Two Snowboard Boots. Tried and true traditional laces, a Performance Rubber outsole, and STI Energy Foam cushioning make for a low maintenance season of sends. Featuring thirtytwo's Performance Fit package with customization for heel lock and all-around comfort. These go anywhere, do anything boots, will take your riding up to 11 this year!",
		"image": "1653401078594.jpg",
		"price": "209.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 244,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Traditional"
	},
	{
		"title": "thirtytwo STW Double Boa Snowboard Boots - Women's 2022 - Used",
		"formattedTitle": "thirtytwo-stw-double-boa-snowboard-boots---women's----used",
		"brand": "thirtytwo",
		"description": "The thirtytwo STW Double Boa Snowboard Boots are a softer flexing option perfect for freestyle progression and ramping up the learning curve. They feature the thirtytwo Comfort Liner and harness system for all-day comfort and solid ankle hold plus a dual Boa® Fit System. That's a combination that enables convenient everyday usability and precision.",
		"image": "1653401082599.jpg",
		"price": "209.91",
		"sized": ["S", "M", "L", "XL"],
		"stock": 214,
		"type": "boots",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "K2 Contour Snowboard Boots - Women's 2020 - Used",
		"formattedTitle": "k2-contour-snowboard-boots---women's----used",
		"brand": "k2",
		"description": "Technical terrain demands power and response from your gear and the K2 Contour Snowboard Boots deliver. Get dialed quickly thanks to BOA® reel systems and J bars that offer premium edge control thanks to supportive heel hold and a performance-oriented fit. Spaceheater™ technology helps you stay cozy and toasty while you shred the gnar, with reflective heat blanket panels that keep the warmth in and keep the chills out. When it's time to ride for results, for glory, and for love of the sport, reward your feet with the K2 Contour Snowboard Boots and go hard.",
		"image": "1653401085525.jpg",
		"price": "197.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 148,
		"type": "boots",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Boa®"
	},
	{
		"title": "K2 Kinsley Snowboard Boots - Women's 2021 - Used",
		"formattedTitle": "k2-kinsley-snowboard-boots---women's----used",
		"brand": "k2",
		"description": "This is a boot for the bell-to-bell warriors. The women out there who get first chair not just on powder days, but on all the other days too. For those of you shredding the tiny strip of man-made snow in early fall and keep showing up until the slushy parks are all melted away in late spring. The K2 Kinsley Snowboard Boots, like you, are a machine that just can't be stopped. They've got the durability and performance that you need, plus the comfort that sure doesn't hurt when you're wearing the same pair of slippers dawn to dusk everyday, all winter long.",
		"image": "1653401088275.jpg",
		"price": "208.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 17,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "thirtytwo Lashed Snowboard Boots - Women's 2022",
		"formattedTitle": "thirtytwo-lashed-snowboard-boots---women's-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Lashed Snowboard Boots are a longtime team and customer favorite, with a powerful but not overly rigid flex, a classic lace system, and a fit that comes close to perfection. With a freeride-dialed flex with a heat moldable Team Fit Liner and harness, the Lashed rips all of the mountain, all of the time.",
		"image": "1653401092100.jpg",
		"price": "207.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 8,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Mint Boa Snowboard Boots - Women's 2021 - Used",
		"formattedTitle": "burton-mint-boa-snowboard-boots---women's----used",
		"brand": "burton",
		"description": "The Burton Mint Boa Snowboard Boots are the only thing fresh enough for all the lines you will shred this winter. Soft, playful flex for an easy and forgiving feel with lasting comfort, perfect for beginners and experienced riders alike. The Boa® Colier™ system makes getting in and out of the boots undeniably easy, making the Burton Mint Boa Snowboard Boots a must have this year.",
		"image": "1653401095339.jpg",
		"price": "205.16",
		"sized": ["S", "M", "L", "XL"],
		"stock": 106,
		"type": "boots",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"lacing_system": "Boa®"
	},
	{
		"title": "Nidecker Trinity Snowboard Boots - Women's 2022",
		"formattedTitle": "nidecker-trinity-snowboard-boots---women's-",
		"brand": "nidecker",
		"description": "Having trouble balancing the budget while you set up your rocking new winter setup? Well, the Nidecker Trinity Snowboard Boots are here to help. The Triton is a teched up mid-soft boot that offers performance-forward quality and innovative features that frankly, could cost a whole bunch more! The Dual Zone Boa features the super durable H4 Coiler™, allowing users to adjust the lower and upper boot independently. The Trinity has 5 degrees of forward lean so the rider won't be encouraged to engage their edges - perfect for intermediate shredders who want less edge bite as they progress.",
		"image": "1653401098958.jpg",
		"price": "199.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 100,
		"type": "boots",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "DC Lotus Boa Snowboard Boots - Women's 2022",
		"formattedTitle": "dc-lotus-boa-snowboard-boots---women's-",
		"brand": "dc",
		"description": "The DC Lotus Boa Snowboard Boots provide that impeccable balance of responsiveness and smooth flex that progressive riders are drawn to - enough power to react quickly on steep faces, but with the give and stability for pop and controlled style. Open your riding up to all terrain possibilities and leave no part of the mountain unexplored with the DC Lotus Boa Snowboard Boots.",
		"image": "1653401102384.jpg",
		"price": "199.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 82,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Vans Hi Standard OG Snowboard Boots - Women's 2022",
		"formattedTitle": "vans-hi-standard-og-snowboard-boots---women's-",
		"brand": "vans",
		"description": "Taking its cues from your favorite pair of shoes, the Vans Hi-Standard OG Snowboard Boots feature iconic style meets performance-driven versatility. Decked with the familiar comfort and feel of a good pair of Vans, the Hi-Standard features an Internal Web Harness throughout a comfy and intuitive V1 UltraCush Liner. With a V1 Waffle Lug Outsole and iconic sidestrip, this timeless blend is the ultimate showcase of street style meets the snow.",
		"image": "1653401106726.jpg",
		"price": "179.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 225,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Traditional"
	},
	{
		"title": "Burton Mint Boa Snowboard Boots - Women's 2021",
		"formattedTitle": "burton-mint-boa-snowboard-boots---women's-",
		"brand": "burton",
		"description": "The Burton Mint Boa Snowboard Boots are the only thing fresh enough for all the lines you will shred this winter. Soft, playful flex for an easy and forgiving feel with lasting comfort, perfect for beginners and experienced riders alike. The Boa® Colier™ system makes getting in and out of the boots undeniably easy, making the Burton Mint Boa Snowboard Boots a must have this year.",
		"image": "1653401110492.jpg",
		"price": "199.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 96,
		"type": "boots",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"lacing_system": "Boa®"
	},
	{
		"title": "thirtytwo Lashed Melancon Snowboard Boots - Women's 2021",
		"formattedTitle": "thirtytwo-lashed-melancon-snowboard-boots---women's-",
		"brand": "thirtytwo",
		"description": "When badass riders prefer specific equipment, there's a good chance you will, too. As the boots of choice for Desiree Melancon, the thirtytwo Lashed Melancon Snowboard Boots set the standard for reliability, comfort, and performance. Dial in your fit and get moving. Whether you're a casual rider who boards for leisure or you're out pushing the limits every day trying to get a boot namesake of your own, the thirtytwo Lashed Melancon Snowboard Boots are a solid base.",
		"image": "1653401113403.jpg",
		"price": "199.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 219,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo STW Double Boa Snowboard Boots - Women's 2021 - Used",
		"formattedTitle": "thirtytwo-stw-double-boa-snowboard-boots---women's----used",
		"brand": "thirtytwo",
		"description": "The zonal lockdown control provided by the thirtytwo STW Double Boa Snowboard Boots keeps your fit dialed in beautifully so you can use that extra control to concentrate on your progression. Built on a foundation of plush excellence — a comfort Liner, footbed, and harness on top of an evolution foam sole — the thirtytwo STW Double Boa Snowboard Boots keep your feet happy while you explore the mountain. The difference-maker here is the Double Boa System, providing dual zone precision for your feet. Think of it as a performance couch with a high-tech seatbelt.",
		"image": "1653401116402.jpg",
		"price": "199.49",
		"sized": ["S", "M", "L", "XL"],
		"stock": 37,
		"type": "boots",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Ride Context Snowboard Boots - Women's 2022 - Used",
		"formattedTitle": "ride-context-snowboard-boots---women's----used",
		"brand": "ride",
		"description": "The Ride Context Snowboard Boots combine the best of two worlds, with a traditional lace system for the outer boot and a dial-up-the-tightness Boa® Tongue Tied™ liner to lock in the ankle and heel. This is a powerful women's freeride boot with versatility to burn, and put into the right context (i.e. between your bindings and feet) it's bound to bring you joy.",
		"image": "1653401119348.jpg",
		"price": "191.97",
		"sized": ["S", "M", "L", "XL"],
		"stock": 212,
		"type": "boots",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"lacing_system": "Traditional",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Vans Encore OG Snowboard Boots - Women's 2021",
		"formattedTitle": "vans-encore-og-snowboard-boots---women's-",
		"brand": "vans",
		"description": "Simple, lightweight, and effective. The Vans Encore OG Snowboard Boots provide the durability and performance you need out of an all-mountain boot, but with a pared-down design that doesn't distract itself with all of the bells and whistles. The single Boa system will have you dialed in for a good time, and a forgiving flex and super comfortable liner will help you get the most out of any style of riding.",
		"image": "1653401124117.jpg",
		"price": "189.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 214,
		"type": "boots",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Medium",
		"lacing_system": "Boa®"
	},
	{
		"title": "DC Lotus Boa Snowboard Boots - Women's 2022 - Used",
		"formattedTitle": "dc-lotus-boa-snowboard-boots---women's----used",
		"brand": "dc",
		"description": "The DC Lotus Boa Snowboard Boots provide that impeccable balance of responsiveness and smooth flex that progressive riders are drawn to - enough power to react quickly on steep faces, but with the give and stability for pop and controlled style. Open your riding up to all terrain possibilities and leave no part of the mountain unexplored with the DC Lotus Boa Snowboard Boots.",
		"image": "1653401126861.jpg",
		"price": "189.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 247,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Nidecker Trinity Snowboard Boots - Women's 2022 - Used",
		"formattedTitle": "nidecker-trinity-snowboard-boots---women's----used",
		"brand": "nidecker",
		"description": "Having trouble balancing the budget while you set up your rocking new winter setup? Well, the Nidecker Trinity Snowboard Boots are here to help. The Triton is a teched up mid-soft boot that offers performance-forward quality and innovative features that frankly, could cost a whole bunch more! The Dual Zone Boa features the super durable H4 Coiler™, allowing users to adjust the lower and upper boot independently. The Trinity has 5 degrees of forward lean so the rider won't be encouraged to engage their edges - perfect for intermediate shredders who want less edge bite as they progress.",
		"image": "1653401129668.jpg",
		"price": "189.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 60,
		"type": "boots",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Salomon Ivy Boa SJ Snowboard Boots - Women's 2021",
		"formattedTitle": "salomon-ivy-boa-sj-snowboard-boots---women's-",
		"brand": "salomon",
		"description": "With a medium fit, a Comfort Liner, and a Boa lacing system, the Salomon Ivy Boa SJ Snowboard Boots appeal to a wide range of riders. The outer Boa keeps your boot shell dialed and has you read to rip with the flick of the wrist, while an interior Str8jkt system locks your heel in place for optimum comfort and performance. Finish it off with a featherweight outsole and a customizable fit, and you've yourself got a performance boot for all occasions.",
		"image": "1653401132898.jpg",
		"price": "188.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 154,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Mint Snowboard Boots - Women's 2022",
		"formattedTitle": "burton-mint-snowboard-boots---women's-",
		"brand": "burton",
		"description": "It's not always easy being fresh, but it's easy to see that the Burton Mint Snowboard Boots are the perfect boot for boarders who love a surfy, playful feel or want to develop their riding skills. You go snowboarding to have fun, not to fuss with your equipment -- that's why Speed Zone™ lacing makes boot entry and exit a breeze so you can fight with your boots less and ride more. Take a run with your friends, get your tweak on in the park, or just spend the day working on technique with the comfortable and forgiving Burton Mint Snowboard Boots.",
		"image": "1653401136110.jpg",
		"price": "188.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 110,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Soft",
		"lacing_system": "Quick-Pull"
	},
	{
		"title": "Ride Sage Snowboard Boots - Women's 2022 - Used",
		"formattedTitle": "ride-sage-snowboard-boots---women's----used",
		"brand": "ride",
		"description": "The Ride Sage Snowboard Boots are mellow and sweet. Perfect for snowboarders of all levels, the plush liners are a joy to slip your feet into, and the toned-down flex means all day enjoyment for cruising around the resort. They're as comfy as a pair of slippers and still give you the confidence to keep progressing your riding.",
		"image": "1653401139365.jpg",
		"price": "181.65",
		"sized": ["S", "M", "L", "XL"],
		"stock": 129,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Vans Encore Pro Snowboard Boots - Women's 2019",
		"formattedTitle": "vans-encore-pro-snowboard-boots---women's-",
		"brand": "vans",
		"description": "The Vans Encore Pro Snowboard Boots carefully blend performance, comfort, and style into one badass package. A medium flex and UltraCush liner and footbed bring dampness and support to a new level, while the custom focus Boa system and V1 harness keep you locked and loaded, ready for any terrain, anywhere, anytime.",
		"image": "1653401142138.jpg",
		"price": "179.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 149,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®"
	},
	{
		"title": "Vans Encore OG Snowboard Boots - Women's 2021 - Used",
		"formattedTitle": "vans-encore-og-snowboard-boots---women's----used",
		"brand": "vans",
		"description": "Simple, lightweight, and effective. The Vans Encore OG Snowboard Boots provide the durability and performance you need out of an all-mountain boot, but with a pared-down design that doesn't distract itself with all of the bells and whistles. The single Boa system will have you dialed in for a good time, and a forgiving flex and super comfortable liner will help you get the most out of any style of riding.",
		"image": "1653401145264.jpg",
		"price": "179.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 248,
		"type": "boots",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Medium",
		"lacing_system": "Boa®"
	},
	{
		"title": "Salomon Ivy Boa SJ Snowboard Boots - Women's 2021 - Used",
		"formattedTitle": "salomon-ivy-boa-sj-snowboard-boots---women's----used",
		"brand": "salomon",
		"description": "With a medium fit, a Comfort Liner, and a Boa lacing system, the Salomon Ivy Boa SJ Snowboard Boots appeal to a wide range of riders. The outer Boa keeps your boot shell dialed and has you read to rip with the flick of the wrist, while an interior Str8jkt system locks your heel in place for optimum comfort and performance. Finish it off with a featherweight outsole and a customizable fit, and you've yourself got a performance boot for all occasions.",
		"image": "1653401148231.jpg",
		"price": "179.51",
		"sized": ["S", "M", "L", "XL"],
		"stock": 56,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo STW Boa Snowboard Boots - Women's 2022",
		"formattedTitle": "thirtytwo-stw-boa-snowboard-boots---women's-",
		"brand": "thirtytwo",
		"description": "The thirtytwo STW Boa Snowboard Boots come through in the clutch with straight-out-of-the-box comfort, ease of use with the Boa closure system, and a forgiving flex. The perfect step up from a season of rentals or for the weekend warrior who is looking for a great value boot.",
		"image": "1653401151284.jpg",
		"price": "177.61",
		"sized": ["S", "M", "L", "XL"],
		"stock": 142,
		"type": "boots",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "DC Search Boa Snowboard Boots - Women's 2022",
		"formattedTitle": "dc-search-boa-snowboard-boots---women's-",
		"brand": "dc",
		"description": "Not your average entry-level boots, the DC Search Boa Snowboard Boots set you up for success with a Boa dial for quick and easy fit adjustments, a super cush outsole for all-day riding comfort, and a medium flex that is supportive yet forgiving. Beginners to advanced riders alike will love the practical performance of the DC Search Boa Snowboard Boots!",
		"image": "1653401155068.jpg",
		"price": "175.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 181,
		"type": "boots",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo STW Boa Snowboard Boots - Women's 2021",
		"formattedTitle": "thirtytwo-stw-boa-snowboard-boots---women's-",
		"brand": "thirtytwo",
		"description": "Quick and easy never looked so good. The thirtytwo STW Boa Snowboard Boots give you all-day comfort and super easy adjustment. A soft flex and Boa Fit System are perfect for entry-level ladies. Grip & Rip Heel Hold keeps you locked in for smooth carving while durable Evolution foam outsoles provide lasting comfort. Find your feet in a happy place on the mountain wearing the thirtytwo STW Boa Snowboard Boots.",
		"image": "1653401158337.jpg",
		"price": "174.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 124,
		"type": "boots",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Nidecker Lunar H-Lock Focus Snowboard Boots - Women's 2020 - Used",
		"formattedTitle": "nidecker-lunar-h-lock-focus-snowboard-boots---women's----used",
		"brand": "nidecker",
		"description": "The Nidecker Lunar H-Lock Focus Snowboard Boots are for daring dames who aim high. Stylish yet understated, these boots feature Heel-Lock Focus, 3D-molded tongues, and Silver-Level Heat-Moldable liners. In short, the Nidecker Lunar H-Lock Focus Snowboard Boots deliver the comfort and performance you need to shoot the moon.",
		"image": "1653401161456.jpg",
		"price": "172.77",
		"sized": ["S", "M", "L", "XL"],
		"stock": 174,
		"type": "boots",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Salomon Pearl Boa Snowboard Boots - Women's 2022",
		"formattedTitle": "salomon-pearl-boa-snowboard-boots---women's-",
		"brand": "salomon",
		"description": "The Salomon Pearl Boa Snowboard Boots stand out with a clean and simple design, an easy to use single Boa® closure system, and outstanding all-day comfort. This soft-flexing boot offers heat-moldable Gold Liners for a customized fit and a pared-down design for lightweight performance.",
		"image": "1653401164623.jpg",
		"price": "172.46",
		"sized": ["S", "M", "L", "XL"],
		"stock": 54,
		"type": "boots",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "Nidecker Onyx Snowboard Boots - Women's 2022",
		"formattedTitle": "nidecker-onyx-snowboard-boots---women's-",
		"brand": "nidecker",
		"description": "Designed to be the ideal boot for progressing intermediate riders, the Nidecker Onyx Snowboard Boots has ample support for shredders to explore higher demanding riding practices and tougher riding environments. 8 degrees of forward lean encourages users to engage their edge rather than ride flatfooted, and if comfort and accessibility are key, stay tuned: with a 3D-molded liner and single Boa® H4 dial, getting the Onyx boots on and making adjustments on the fly couldn't be easier.",
		"image": "1653401167692.jpg",
		"price": "172.46",
		"sized": ["S", "M", "L", "XL"],
		"stock": 48,
		"type": "boots",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Salomon Ivy Boa SJ Snowboard Boots - Women's 2020 - Used",
		"formattedTitle": "salomon-ivy-boa-sj-snowboard-boots---women's----used",
		"brand": "salomon",
		"description": "For park and freestyle riding, there are few offerings as comfortable as Salomon Ivy Boa SJ Snowboard Boots. Salomon starts at the feet and builds outwards, ensuring the best fit available. These have a women's specific liner, a shock-absorbing Ortholite footbed, and a low profile that keeps them light and free of the dreaded clunk foot. Dial in the medium flex with the Boa® wheel and drop in, feeling securely connected to your board without any discomfort!",
		"image": "1653401170884.jpg",
		"price": "170.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 150,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®"
	},
	{
		"title": "Nidecker Maya Snowboard Boots - Women's 2022",
		"formattedTitle": "nidecker-maya-snowboard-boots---women's-",
		"brand": "nidecker",
		"description": "There's no debate, the boots are the most important piece of equipment in your snowboard arsenal. Having happy feet in the right pair of boots makes finding the best bindings and board for you easier so you can score the setup of your dreams. If you're in need of an entry-level boot with a flex that offers support in the heel with an easy-going flex, then the Nidecker Maya Snowboard Boots are a fantastic candidate. The 3D molding liner is designed to be comfortable right out of the box but will continue to conform for personalized comfort the more it's used.",
		"image": "1653401173715.jpg",
		"price": "170.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 250,
		"type": "boots",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "K2 Haven Snowboard Boots - Women's 2022",
		"formattedTitle": "k2-haven-snowboard-boots---women's-",
		"brand": "k2",
		"description": "The K2 Haven Snowboard Boots put all of the comfort and performance found in K2's high end boots into an easy flexing package perfect for riders progressing their craft. The aptly named Intuition Comfort Liner provides an all-day feel good interior, while the trusted security of the Boa Fit system keeps your feet locked in place for optimum performance.",
		"image": "1653401177293.jpg",
		"price": "169.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 115,
		"type": "boots",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "thirtytwo Zephyr Boa Snowboard Boots - Women's 2020",
		"formattedTitle": "thirtytwo-zephyr-boa-snowboard-boots---women's-",
		"brand": "thirtytwo",
		"description": "Get reliable performance in all conditions with the friendly and versatile thirtytwo Zephyr FT Snowboard Boots. Pow day? No problem. Groomer day? Sweet. The thirtytwo Zephyr FT Snowboard Boots are ready to rip no matter what the snow report says. An easy-to-use Fast Track Lacing System lets you get in and out in a hurry, while the grippy outsole is perfect for helping to keep your traction under control when not on your board. With a medium flex and a heat-moldable liner, these feel broken in on Day One!",
		"image": "1653401179770.jpg",
		"price": "169.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 184,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®"
	},
	{
		"title": "thirtytwo Lashed Snowboard Boots - Women's 2020",
		"formattedTitle": "thirtytwo-lashed-snowboard-boots---women's-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Lashed Snowboard Boots feature an iconic profile that has become the standard of snowboard boots everywhere. They're made with a comfortable and performance-ready team liner, which are heat-moldable and prevent your heel from pulling out of the boot. With durable construction and responsive fit, the Lashed Boots feature a chassis system that's the perfect addition to every setup.",
		"image": "1653401182308.jpg",
		"price": "169.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 107,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®"
	},
	{
		"title": "Vans Encore Linerless Snowboard Boots - Women's 2022",
		"formattedTitle": "vans-encore-linerless-snowboard-boots---women's-",
		"brand": "vans",
		"description": "A lighter, slimmer, and yes, linerless version of the Encore OG, the Vans Encore Linerless Snowboard Boots are featherweight on your feet and ultra comfy from the get-go. A single Boa® closure offers perfect tension convenience, and a Reverse Waffle outsold guarantees reliable grip and shock absorption.",
		"image": "1653401186778.jpg",
		"price": "169.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 128,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "DC Search Boa Snowboard Boots - Women's 2022 - Used",
		"formattedTitle": "dc-search-boa-snowboard-boots---women's----used",
		"brand": "dc",
		"description": "Not your average entry-level boots, the DC Search Boa Snowboard Boots set you up for success with a Boa dial for quick and easy fit adjustments, a super cush outsole for all-day riding comfort, and a medium flex that is supportive yet forgiving. Beginners to advanced riders alike will love the practical performance of the DC Search Boa Snowboard Boots!",
		"image": "1653401189556.jpg",
		"price": "158.36",
		"sized": ["S", "M", "L", "XL"],
		"stock": 141,
		"type": "boots",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Medium",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo STW Boa Snowboard Boots - Women's 2021 - Used",
		"formattedTitle": "thirtytwo-stw-boa-snowboard-boots---women's----used",
		"brand": "thirtytwo",
		"description": "Quick and easy never looked so good. The thirtytwo STW Boa Snowboard Boots give you all-day comfort and super easy adjustment. A soft flex and Boa Fit System are perfect for entry-level ladies. Grip & Rip Heel Hold keeps you locked in for smooth carving while durable Evolution foam outsoles provide lasting comfort. Find your feet in a happy place on the mountain wearing the thirtytwo STW Boa Snowboard Boots.",
		"image": "1653401192346.jpg",
		"price": "122.49",
		"sized": ["S", "M", "L", "XL"],
		"stock": 187,
		"type": "boots",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Salomon Pearl Boa Snowboard Boots - Women's 2022 - Used",
		"formattedTitle": "salomon-pearl-boa-snowboard-boots---women's----used",
		"brand": "salomon",
		"description": "The Salomon Pearl Boa Snowboard Boots stand out with a clean and simple design, an easy to use single Boa® closure system, and outstanding all-day comfort. This soft-flexing boot offers heat-moldable Gold Liners for a customized fit and a pared-down design for lightweight performance.",
		"image": "1653401195344.jpg",
		"price": "163.84",
		"sized": ["S", "M", "L", "XL"],
		"stock": 174,
		"type": "boots",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"lacing_system": "Boa®",
		"binding_style": "Strap"
	},
	{
		"title": "thirtytwo Shifty Boa Snowboard Boots - Women's 2022",
		"formattedTitle": "thirtytwo-shifty-boa-snowboard-boots---women's-",
		"brand": "thirtytwo",
		"description": "The thirtytwo Shifty Boa Snowboard Boots are built for all-day comfort from day 1, with a super convenient Boa outer lacing system and thirtytwo's Comfort Fit liner. A soft flex makes these suitable for freestyle fanatics as well as newer riders.",
		"image": "1653401198894.jpg",
		"price": "161.46",
		"sized": ["S", "M", "L", "XL"],
		"stock": 104,
		"type": "boots",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo Shifty Boa Snowboard Boots - Women's 2022 - Used",
		"formattedTitle": "thirtytwo-shifty-boa-snowboard-boots---women's----used",
		"brand": "thirtytwo",
		"description": "The thirtytwo Shifty Boa Snowboard Boots are built for all-day comfort from day 1, with a super convenient Boa outer lacing system and thirtytwo's Comfort Fit liner. A soft flex makes these suitable for freestyle fanatics as well as newer riders.",
		"image": "1653401201718.jpg",
		"price": "153.39",
		"sized": ["S", "M", "L", "XL"],
		"stock": 13,
		"type": "boots",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"lacing_system": "Boa®",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "thirtytwo Shifty Boa Snowboard Boots - Women's 2020 - Used",
		"formattedTitle": "thirtytwo-shifty-boa-snowboard-boots---women's----used",
		"brand": "thirtytwo",
		"description": "Ultimate comfort, hassle-free lacing, and an affordable price make the thirtytwo Shifty Boa Snowboard Boots a great choice for beginner to intermediate riders. Featuring thirtytwo's Comfort Fit package for easy all day shredding, along with an Evolution Foam outsole that boosts confidence by dampening vibrations on rougher snow. Discomfort will be a thing of the past as you learn to connect turns and tackle steeper slopes in the thirtytwo Shifty Boa Boots!",
		"image": "1653401205164.jpg",
		"price": "151.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 126,
		"type": "boots",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"lacing_system": "Boa®"
	}
]
