[
	{
		"title": "Union Trilogy Snowboard Bindings - Women's 2023",
		"formattedTitle": "union-trilogy-snowboard-bindings---women's-",
		"brand": "union",
		"description": "Backountry lines, groomer days with the groms, and big stomps are just some of the things the Union Trilogy Snowboard Bindings excel at. Created for bomber all mountain riding wherever the weather takes you, the Trilogy is a classic that keeps on giving year after year. With an extra durable Stage 4 baseplate, a super responsive and highback, and Exoframe 4.0 ankle straps, there's no line you can't take on.",
		"image": "1653404353166.jpg",
		"price": "279.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 164,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Union Legacy Snowboard Binding - Women's 2023",
		"formattedTitle": "union-legacy-snowboard-binding---women's-",
		"brand": "union",
		"description": "The Union Legacy Snowboard Bindings are your ticket to a great day on the mountain. Functionally identical to the Strata, these classic rippers smash chunder, float through pow, and are made with a seamless and responsive chassis for when its time to stomp the park. The Legacy delivers a smooth yet surfy ride for all your freestyle shenanigans thanks to an Ultragrip toe strap and Forma Lab ankle strap that keep you locked to your board and ready to roll. Become one with the snow and experience the joy of performance wherever you choose to shred, you can't go wrong with the Union Legacy Snowboard Bindingss.",
		"image": "1653404355808.jpg",
		"price": "249.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 3,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Burton Step On Snowboard Bindings - Women's 2022",
		"formattedTitle": "burton-step-on-snowboard-bindings---women's-",
		"brand": "burton",
		"description": "Pair these bindings with some Burton Step On Boots to experience the simplest, most straightforward setup on the mountain. With the Burton Step On Snowboard Bindings you can (surprise) just step right onto your bindings. They're crazy intuitive, and they give you a perfect connection to your board for easy all-mountain stylin'. No straps, all shred.",
		"image": "1653404358914.jpg",
		"price": "284.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 114,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Step-On"
	},
	{
		"title": "Flow Mayon Plus Hybrid Snowboard Bindings - Women's 2022",
		"formattedTitle": "flow-mayon-plus-hybrid-snowboard-bindings---women's-",
		"brand": "flow",
		"description": "You're at the top of the chair staring down at the fresh snow that fell the night before. Life is good. But then you realize time is of the essence, as more and more riders pour out from the lift. Luckily you have the Flow Mayon Plus Hybrid Snowboard Bindings under your feet. These mid-flexing all-mountain bindings have Flow's signature easy in, easy out snowboarding experience. The Flow Mayon Plus Hybrid bindings also comes with Active Strap Technology, a lightweight and durable main strap that has great power transfer and wont freeze in the cold and wet conditions.",
		"image": "1653404363104.jpg",
		"price": "191.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 88,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Rear-Entry"
	},
	{
		"title": "Roxy Lola Snowboard Bindings - Women's 2022",
		"formattedTitle": "roxy-lola-snowboard-bindings---women's-",
		"brand": "roxy",
		"description": "The all-new Roxy Lola Snowboard Bindings are designed to meet the needs of riders seeking comfort, control, and all mountain performance. Features like contoured asymmetric highbacks with tool-less adjustability and dual ankle straps make the Lola easy to dial in for your perfect ride.",
		"image": "1653404366331.jpg",
		"price": "104.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 94,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "K2 Cinch Tryst Snowboard Bindings - Women's 2022",
		"formattedTitle": "k2-cinch-tryst-snowboard-bindings---women's-",
		"brand": "k2",
		"description": "The Cinch technology in the K2 Cinch Tryst Snowboard Bindings allows you to use the binding in a traditional strap style, or as a rear entry binding for added speed at the top of the lift, while the adjustable TriPod Chassis provides a custom fit and premium power transfer. In addition to the added ease of use, the Tryst still provides the well-honed, responsive ride you'd expect from a top-of-the-line K2 binder.",
		"image": "1653404368634.jpg",
		"price": "205.16",
		"sized": ["S", "M", "L", "XL"],
		"stock": 123,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Bent Metal Metta Snowboard Bindings - Women's 2022",
		"formattedTitle": "bent-metal-metta-snowboard-bindings---women's-",
		"brand": "bent",
		"description": "When they're on your board, Bent Metal Metta Snowboard Bindings are good vibe enhancers, powder run dancers, prime goofy - and regular - stancers. They're forgiving enough for park tweaks and mellow pow peelers yet stiff enough for some confident maneuvers in higher risk environs. That's when they're mounted on your board, though. When they're off your board they'll just make you walk funny.",
		"image": "1653404370871.jpg",
		"price": "149.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 236,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Ride A-10 Snowboard Bindings 2022",
		"formattedTitle": "ride-a-10-snowboard-bindings-",
		"brand": "ride",
		"description": "The Ride A-10 Snowboard Bindings are the stiffest offering in Ride's portfolio, jammed with all the tech at their disposal, and ready to take on the biggest and baddest terrain you can throw at them. As you might expect, the A-10 sports a \"10 out of 10\" flex, Carbon Slimeback™ highbacks, and the bomber A-Series Chassis. The two-part chassis allows perfect sizing and centering of any boot, and the binding comes with both aluminum (stiffer) and composite (damper) mount discs.",
		"image": "1653404373470.jpg",
		"price": "359.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 29,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Very Stiff",
		"binding_style": "Strap"
	},
	{
		"title": "Bent Metal Forte Snowboard Bindings - Women's 2022",
		"formattedTitle": "bent-metal-forte-snowboard-bindings---women's-",
		"brand": "bent",
		"description": "When you focus, you can flourish. Bent Metal Forte Snowboard Bindings score high marks across all of snowboarding's many genres, with no glaring deficiencies. Park, pow, no-fall steeps, whatever you like. This do-it-all nature lets you find your forte, discover your niche, and lay claim to your métier. Heck, you could even find your fave, if you're keeping it domestic. The Forte has the right mix of comfort, stiffness, and feel to really charge off into that unknown with confidence.",
		"image": "1653404376504.jpg",
		"price": "199.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 202,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Rome Brass Snowboard Bindings 2022",
		"formattedTitle": "rome-brass-snowboard-bindings-",
		"brand": "rome",
		"description": "Any terrain, any time. The Rome Brass Snowboard Bindings are designed with a FullWrap chassis for maximum power transfer at speeds. Lightweight PureFlex Ankle and PureGrip Toe Strap keeps your boots secure with a minimal footprint. Take your turns to the next level with this medium flex binding that loves full sends.",
		"image": "1653404379008.jpg",
		"price": "207.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 229,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Rossignol Diva Snowboard Bindings - Women's 2021",
		"formattedTitle": "rossignol-diva-snowboard-bindings---women's-",
		"brand": "rossignol",
		"description": "The Rossignol Diva Snowboard Bindings provide buttery smooth comfort in a high performance package. These all-mountain freestyle bindings have a stout flex with just enough give for tweakability and freestyle fun, and come pre-equipped with Magnebed footbeds to minimize fatigue during bell-to-bell sessions of shred 'til bed fun.",
		"image": "1653404382542.jpg",
		"price": "189.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 147,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"binding_style": "Strap"
	},
	{
		"title": "Salomon Hologram Snowboard Bindings - Women's 2022",
		"formattedTitle": "salomon-hologram-snowboard-bindings---women's-",
		"brand": "salomon",
		"description": "The Salomon Hologram Snowboard Bindings are Salomon's top freestyle offering, with a super light but ultra responsive design and the best fit in the business. The Hologram uses a stiffer composite material for better response, and the Shadow Fit baseplate/Kevlar Quickwire combination is tough to beat.",
		"image": "1653404385724.jpg",
		"price": "239.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 116,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Stiff",
		"binding_style": "Strap"
	},
	{
		"title": "Burton Escapade EST Snowboard Bindings - Women's 2022",
		"formattedTitle": "burton-escapade-est-snowboard-bindings---women's-",
		"brand": "burton",
		"description": "Here we go ladies, the Burton Escapade EST Snowboard Bindings are here and ready to have your back through deep or shallow and everything in-between. Its smooth medium-firm flex and Zero-Lean Canted Highback provide a responsive flex that is tweakable yet firm. Locking your boots to the board is a Hammockstrap™ ankle strap and Suregrip Capstrap™ 2.0 designed for even hold and wide, comfortable coverage. The Burton Escapade EST Snowboard Bindings are a hard charging binding with a Women's Specific True Fit™ and fine adjustability you'll come to trust as they take you through thick and thin cold or heavy.",
		"image": "1653404389137.jpg",
		"price": "279.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 135,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "K2 Cassette Snowboard Bindings - Women's 2022",
		"formattedTitle": "k2-cassette-snowboard-bindings---women's-",
		"brand": "k2",
		"description": "The K2 Cassette Snowboard Bindings are made to help flatten the learning curve and get you from falling leaf to leaving your friends in the dust in no time flat. The gentle, progressive flex of the bindings couples with a plush ankle strap and K2's women specific A-line chassis to keep you in the drivers seat and under control as you take your riding to new heights.",
		"image": "1653404391674.jpg",
		"price": "135.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 233,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"binding_style": "Strap"
	},
	{
		"title": "Flow NX2 Team Fusion Snowboard Bindings 2022",
		"formattedTitle": "flow-nx2-team-fusion-snowboard-bindings-",
		"brand": "flow",
		"description": "Dependability is key, and team riders know this: any time spent fiddling, puzzling, or troubleshooting can mean missing out on riding. That is completely unacceptable in this day and age! Flow NX2 Team Fusion Snowboard Bindings are built diesel-tough with aluminum baseplates for maximum durability. This model features Flow's Fusion straps, built to engulf your boot in secure, pressure-free comfort. Dial these in once and enjoy your run right away--let the two-strappers battle for your scraps as you drop in in milliseconds after exiting the chair!",
		"image": "1653404395017.jpg",
		"price": "239.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 226,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Ride C-9 Snowboard Bindings 2022",
		"formattedTitle": "ride-c-9-snowboard-bindings-",
		"brand": "ride",
		"description": "The Ride C-9 Snowboard Bindings nestle into that sweet spot between 8 and 10, where many top riders want their freeride bindings to flex for the optimal balance between power and suppleness. Think of the C-9 as a \"10\" with the edge taken off for better feel in softer conditions and better tweakability when the opportunity to throw that trick comes up. A touch damper than the all-aluminum chassis A-9 thanks to the hybrid aluminum heel cup with composite base plate construction, the C-9 is a welcome addition to the fold.",
		"image": "1653404397752.jpg",
		"price": "269.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 160,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"binding_style": "Strap"
	},
	{
		"title": "Flux GS Snowboard Bindings - Women's 2021",
		"formattedTitle": "flux-gs-snowboard-bindings---women's-",
		"brand": "flux",
		"description": "If you're looking for a binding to handle any and all terrain, look no further than the Flux GS Snowboard Bindings. The're made with the Flux Vogue base for natural board flex and a fine tuned feel from the jumps and rails of the terrain park to the ungroomed steeps of the upper mountain. Women's specific Ultima Wing Highbacks are engineered to fit your anatomy better thanks to larger wings and a lower height, and provide excellent support for high speed riding when you put the pedal to the metal.",
		"image": "1653404400022.jpg",
		"price": "234.00",
		"sized": ["S", "M", "L", "XL"],
		"stock": 29,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Burton Lexa EST Snowboard Bindings - Women's 2020 - Used",
		"formattedTitle": "burton-lexa-est-snowboard-bindings---women's----used",
		"brand": "burton",
		"description": "Built for the hard chargers, the Burton Lexa EST Snowboard Bindings take advantage of Burton's 40+ years of binding expertise to provide you with the board-feel, response and comfort you're looking for when you're putting in serious time on snow. Burton sets the Lexa up with a stiff yet cushy nylon composite baseplate, a Heel Hammock for lightning quick power and response to your board edges, along with extra-responsive asym Hammockstraps and perhaps the best toe strap known to man. When you're looking forward to a long season of riding hard no matter what the forecast holds, look to the Burton Lexa EST Snowboard Bindings for the ultimate locked in feel.",
		"image": "1653404402898.jpg",
		"price": "206.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 178,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"binding_style": "Strap"
	},
	{
		"title": "Burton Lexa X Snowboard Bindings - Women's 2022",
		"formattedTitle": "burton-lexa-x-snowboard-bindings---women's-",
		"brand": "burton",
		"description": "The Burton Lexa X Snowboard Bindings bring the pro to the people, with a stiffer flex than the regular version and all new highbacks for improved precision, response, and power. They're built with stiff nylon composite Re:Flex™ baseplates, cushy FullBED footbeds to dampen vibration, and grippy Heel Hammock construction to keep your heels locked in tight, even when your supersonic straight line turns to chunder and chop. Any line, any conditions, any day, you can trust the Burton Lexa X Snowboard Bindings to handle it in style.",
		"image": "1653404405277.jpg",
		"price": "251.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 202,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"binding_style": "Strap"
	},
	{
		"title": "Nitro Rythm Snowboard Bindings - Women's 2022",
		"formattedTitle": "nitro-rythm-snowboard-bindings---women's-",
		"brand": "nitro",
		"description": "Snowboarding is all about having fun and pushing your boundaries, things that the Nitro Rythm Snowboard Bindings know all too well. These bindings are all about progression with a smile, after all. They're crafted with a smooth, forgiving flex and women's specific highbacks designed to work with your body, not against it. With a perfect fit ankle strap and a convertible toe strap, they'll remain comfortable, secure, and responsive no matter what type of boot you're rocking.",
		"image": "1653404407799.jpg",
		"price": "113.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 59,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Burton Scribe Snowboard Bindings - Women's 2022",
		"formattedTitle": "burton-scribe-snowboard-bindings---women's-",
		"brand": "burton",
		"description": "Create your own legend with the Burton Scribe Snowboard Bindings, a sure way to make sure your efforts on the board are transcribed with unerring accuracy. The Scribes boast Re:Flex™ FullBED footbeds for a smooth ride and impact absorption, and Reactstrap™ straps with Smooth Glide™ buckles for the slickest operation in town.",
		"image": "1653404410719.jpg",
		"price": "186.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 40,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Nidecker Muon-W SE Snowboard Bindings - Women's 2022",
		"formattedTitle": "nidecker-muon-w-se-snowboard-bindings---women's-",
		"brand": "nidecker",
		"description": "The Nidecker Muon-W SE Snowboard Bindings are high-caliber bindings for the people. They provide a comfortable, easy ride for women who want to elevate their snowboarding skills. Comfort Fit ankle straps are as comfortable as their name implies and they'll give you plenty of support and control. The Hexo toe cap form-fits to your toe for ultimate power transfer, so you can lock down with the lightweight Proton ratchets and make precise turns. This SE version features evo exclusive colorways.",
		"image": "1653404413404.jpg",
		"price": "139.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 188,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Union Juliet Snowboard Bindings - Women's 2022",
		"formattedTitle": "union-juliet-snowboard-bindings---women's-",
		"brand": "union",
		"description": "When your day starts out with powder in the trees and ends with mellow laps in the park, you need a binding that can handle it all. The Union Juliet Snowboard Bindings are versatile all-mountain slayers built to excel in varied resort terrain, keep you dialed in the park, and never shy away from an adventure. With vibration dampening Thermoformed EVA bushings and Union's LG1 Duraflex highbacks, they hit the perfect balance of flex, comfort, and response to keep you cruising happy all season long.",
		"image": "1653404416936.jpg",
		"price": "178.46",
		"sized": ["S", "M", "L", "XL"],
		"stock": 80,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Union Rosa Snowboard Binding - Women's 2023",
		"formattedTitle": "union-rosa-snowboard-binding---women's-",
		"brand": "union",
		"description": "The Union Rosa Snowboard Binding bring high performance to beginners at a reasonable price. Their incredibly lightweight design and approachable soft flex makes learning the turns easy and intuitive, whether you're cruising the groomers or hitting your first rail.",
		"image": "1653404419982.jpg",
		"price": "169.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 10,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Flow Mayon Plus Fusion Snowboard Bindings - Women's 2022",
		"formattedTitle": "flow-mayon-plus-fusion-snowboard-bindings---women's-",
		"brand": "flow",
		"description": "You're at the top of the chair staring down at the fresh snow that fell the night before. Life is good. But then you realize time is of the essence, as more and more riders pour out from the lift. Luckily you have the Flow Mayon Plus Fusion Snowboard Bindings under your feet. These mid-flexing all-mountain bindings have Flow's signature easy in, easy out snowboarding experience. The Flow Mayon Plus Fusion bindings also comes with Active Strap Technology, a lightweight and durable main strap that has great power transfer and wont freeze in the cold and wet conditions.",
		"image": "1653404422680.jpg",
		"price": "191.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 113,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Rear-Entry"
	},
	{
		"title": "Arbor Sequoia LTD Snowboard Bindings - Women's 2022",
		"formattedTitle": "arbor-sequoia-ltd-snowboard-bindings---women's-",
		"brand": "arbor",
		"description": "Have you heard about these sequoias? They're the next big thing. And the previous big thing. And just like their namesake, the Arbor Sequoia Snowboard Bindings are larger than life. They define the genre of high performing mid-flexing binders that will help you feel comfortable and in control anywhere on the mountain. This LTD creme colorway is available exclusively from evo!",
		"image": "1653404425178.jpg",
		"price": "178.49",
		"sized": ["S", "M", "L", "XL"],
		"stock": 201,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Burton Citizen Snowboard Bindings - Women's 2022 - Used",
		"formattedTitle": "burton-citizen-snowboard-bindings---women's----used",
		"brand": "burton",
		"description": "You've paid your dues on the bunny hill and it's time to hit the big leagues. The Burton Citizen Snowboard Bindings have what you need with a comfortable and forgiving ride that helps you progress from zero to shred in no time. Featuring MicroFLAD™ adjustable forward lean, the Re:Flex™ FullBED cushioning system and women's specific True Fit™ design, the Citizen has something for everyone.",
		"image": "1653404427844.jpg",
		"price": "101.97",
		"sized": ["S", "M", "L", "XL"],
		"stock": 143,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"binding_style": "Strap"
	},
	{
		"title": "Salomon Vendetta Snowboard Bindings - Women's 2019 - Used",
		"formattedTitle": "salomon-vendetta-snowboard-bindings---women's----used",
		"brand": "salomon",
		"description": "The stylish and easy to use Salomon Vendetta Snowboard Bindings feature an asymmetrical mid-range flex that allows for precise control when you need it and more supple, compliant comfort when you don't. Catering to the all-mountain rider who wants bindings that won't restrict where they ride, the Salomon Vendetta Snowboard Bindings are here to avenge your season.",
		"image": "1653404430425.jpg",
		"price": "104.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 157,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Roxy Viva Snowboard Bindings - Women's 2022",
		"formattedTitle": "roxy-viva-snowboard-bindings---women's-",
		"brand": "roxy",
		"description": "Cruise the mountain with confidence in the Roxy Viva Snowboard Bindings. These all-mountain bindings pair perfectly with your favorite resort board for lasting comfort and balanced riding, with lightweight components and a forgiving flex to make you one happy shredder.",
		"image": "1653404433325.jpg",
		"price": "95.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 132,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Burton Citizen Snowboard Bindings - Women's 2022",
		"formattedTitle": "burton-citizen-snowboard-bindings---women's-",
		"brand": "burton",
		"description": "You've paid your dues on the bunny hill and it's time to hit the big leagues. The Burton Citizen Snowboard Bindings have what you need with a comfortable and forgiving ride that helps you progress from zero to shred in no time. Featuring MicroFLAD™ adjustable forward lean, the Re:Flex™ FullBED cushioning system and women's specific True Fit™ design, the Citizen has something for everyone.",
		"image": "1653404436117.jpg",
		"price": "169.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 143,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"binding_style": "Strap"
	},
	{
		"title": "Salomon Mirage Snowboard Bindings - Women's 2022",
		"formattedTitle": "salomon-mirage-snowboard-bindings---women's-",
		"brand": "salomon",
		"description": "The Salomon Mirage Snowboard Bindings are a medium-flexing park-oriented binding designed for comfort and response. The women-specific Mirage highback uses a flex line at the top to allow the binding to accommodate a larger and lower women's calf, keeping you comfortable and happy during long days on the hill.",
		"image": "1653404439028.jpg",
		"price": "199.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 222,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Salomon Rhythm Snowboard Bindings 2022",
		"formattedTitle": "salomon-rhythm-snowboard-bindings-",
		"brand": "salomon",
		"description": "If you value comfort above all else in a snowboard binding, the Rhythm was built just for you. Featuring cushy Full EVA footbeds, 3D Supreme ankle straps, and smooth flexing highbacks, the Salomon Rhythm Snowboard Bindings are ideal for beginner snowboarders getting into the swing of things, or mellow cruisers with a laid-back approach to the mountain.",
		"image": "1653404442014.jpg",
		"price": "129.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 72,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"binding_style": "Strap"
	},
	{
		"title": "Union Rosa Snowboard Bindings - Women's 2022",
		"formattedTitle": "union-rosa-snowboard-bindings---women's-",
		"brand": "union",
		"description": "Proving that entry level doesn't have to mean bottom of the barrel, the Union Rosa Snowboard Bindings bring top shelf technology to the people with an incredibly lightweight design inspired by one of Union's pro-level offerings. Not only that, they've been redesigned from the ground up, with an attention to detail that demonstrates Union's dedication to riders of every ability. If you're still getting the hang of things, or simply looking for a smooth, forgiving pair, the Union Rosa Snowboard Bindings are one of the best options out there.",
		"image": "1653404444523.jpg",
		"price": "144.46",
		"sized": ["S", "M", "L", "XL"],
		"stock": 208,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Ride CL-4 Snowboard Bindings - Women's 2022",
		"formattedTitle": "ride-cl-4-snowboard-bindings---women's-",
		"brand": "ride",
		"description": "The Ride CL-4 Snowboard Bindings are a durable, moderate flexing carbon fiber snowboard binding. They're perfect for intermediate riders or freestyle enthusiasts who like a bit more forgiveness and give from their bindings, but still need the high quality construction and dependability that Ride provides.",
		"image": "1653404447641.jpg",
		"price": "169.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 225,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Bent Metal Bolt Snowboard Bindings 2022",
		"formattedTitle": "bent-metal-bolt-snowboard-bindings-",
		"brand": "bent",
		"description": "Stomp your tricks and nail your turns with Bent Metal Bolt Snowboard Bindings. With a solid set of features and all-mountain flex, these are great for all but the most demanding riders. They're lightweight, comfortable, and very responsive. And, yeah, you'll be landing \"bolts\" every dang time!",
		"image": "1653404449943.jpg",
		"price": "119.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 61,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Medium"
	},
	{
		"title": "Rome Shift Snowboard Bindings - Women's 2023",
		"formattedTitle": "rome-shift-snowboard-bindings---women's-",
		"brand": "rome",
		"description": "The Rome Shift Snowboard Bindings may kick your hunger for snowboarding into high gear. Lightweight straps and the women's specific Shift Highback offer superior all-day comfort, while full highback rotation allows you to properly align with the heelside edge for better response and control no matter what stance you ride. Thoughtfully designed with a rider-first approach, the Shift snowboard bindings have everything you need for comfort, precision, and happy feet.",
		"image": "1653404452630.jpg",
		"price": "179.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 149,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Salomon Spell Snowboard Bindings - Women's 2022",
		"formattedTitle": "salomon-spell-snowboard-bindings---women's-",
		"brand": "salomon",
		"description": "The Salomon Spell Snowboard Bindings are a great entry-level binding that hit well above their class. Built for smooth riding and comfort while strapped-in, the Spell bindings are a great choice for riding up (and down) that learning curve.",
		"image": "1653404455244.jpg",
		"price": "98.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 159,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"binding_style": "Strap"
	},
	{
		"title": "Salomon Nova Snowboard Bindings - Women's 2021",
		"formattedTitle": "salomon-nova-snowboard-bindings---women's-",
		"brand": "salomon",
		"description": "The soft-flexing Salomon Nova Snowboard Bindings is a freestyle rider's dream with all-mountain chops, providing a smooth and comfortable ride that absorbs the bucks and bumps of the resort terrain while keeping the lateral freedom you need for showing off and upping your progression. Seek out quality turns, play on everything, and ride your board the way it was meant to be ridden. The Salomon Nova Snowboard Bindings is stellar for the all-around rider with a playful style.",
		"image": "1653404458010.jpg",
		"price": "199.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 242,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Soft",
		"binding_style": "Strap"
	},
	{
		"title": "GNU Fantast Snowboard Bindings - Women's 2022",
		"formattedTitle": "gnu-fantast-snowboard-bindings---women's-",
		"brand": "gnu",
		"description": "GNU Fantast Snowboard Bindings are, like their name suggests, fantastic, with an obvious lack of ick. By combining their great Speed/In rear entry design with a responsive aluminum baseplate, GNU has created an all-round binding that's shockingly easy to use. Comfortable and secure, these allow you to head straight to the goods. Never miss out on first tracks again!",
		"image": "1653404460549.jpg",
		"price": "207.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 120,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Rear-Entry"
	},
	{
		"title": "Flow Mayon Snowboard Bindings - Women's 2022",
		"formattedTitle": "flow-mayon-snowboard-bindings---women's-",
		"brand": "flow",
		"description": "Looking for an easy way to boost your riding experience? Check out the Flow Mayon Snowboard Bindings. They come with Flow's latest Fusion Exo-Frame PowerStraps for a supremely comfortable and responsive board connection, and 2.5º Canted BankBeds that put your feet and legs in the optimal position to reduce fatigue over the course of the day. Add it up with their legendary rear-entry design and Active Strap Technology, and the Flow Mayon Snowboard Bindings are sure to be a winner.",
		"image": "1653404463910.jpg",
		"price": "179.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 249,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Scribe Snowboard Bindings - Women's 2020",
		"formattedTitle": "burton-scribe-snowboard-bindings---women's-",
		"brand": "burton",
		"description": "Strap into the Burton Scribe Snowboard Bindings for a fluid, dreamy ride worthy of waxing lyrical about. Suitable for experienced riders and progressing shredders alike, these medium flex binders feature Re:Flex™ FullBED cushioning for supreme comfort and bomber Supergrip Capstraps™ for locked in performance whether you're laying into a mean carve or buttering off the lip. Surf the hill like never before; the Scribe Snowboard Bindings are poetry in motion.",
		"image": "1653404467239.jpg",
		"price": "219.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 161,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Burton Lexa Snowboard Bindings - Women's 2022",
		"formattedTitle": "burton-lexa-snowboard-bindings---women's-",
		"brand": "burton",
		"description": "The Burton Lexa Snowboard Bindings are built for the hard charger, the ripper who's out there for the good and the bad, whether it's waist deep or boilerplate. They're built with stiff nylon composite Re:Flex™ baseplates, cushy FullBED footbeds to soak up impacts, and extra-responsive ankle and toe straps to keep you locked in tight, no matter how rowdy your ride gets. Just like you, they have the guts to perform no matter what the conditions hold, so grab the Lexas and get after it.",
		"image": "1653404469825.jpg",
		"price": "219.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 22,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"binding_style": "Strap"
	},
	{
		"title": "Union Juliet Snowboard Bindings - Women's 2023",
		"formattedTitle": "union-juliet-snowboard-bindings---women's-",
		"brand": "union",
		"description": "I think you're fine, you really blow my mind. I just want you to know, the Union Juliet Snowboard Bindings are the perfect introduction to all mountain riding. Made with a medium flex and a durable and responsive S11 highback, you don't have to break the bank to get a binding that performs like a dream. With 2% of profits donated to Boarding for Breast Cancer, these bindings give back to more than just your sweet riding ability. Be the mountain 's Romeo with your new Union Juliet Snowboard Bindings.",
		"image": "1653404472590.jpg",
		"price": "219.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 109,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Burton Lexa X EST Snowboard Bindings - Women's 2022",
		"formattedTitle": "burton-lexa-x-est-snowboard-bindings---women's-",
		"brand": "burton",
		"description": "The Burton Lexa X EST Snowboard Bindings are top level all-mountain binders to get you charging hard on your Burton board. By using Burton's EST system, you get the closest boot to board contact of any binding. When paired with the responsive highback and featherweight construction of the Lexa X, your bindings and feet disappear as you become one with your snowboard, commanding it to rip ever faster down the hill powered by nothing but pure, distilled stoke.",
		"image": "1653404475599.jpg",
		"price": "220.46",
		"sized": ["S", "M", "L", "XL"],
		"stock": 22,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"binding_style": "Strap"
	},
	{
		"title": "Burton Lexa X EST Snowboard Bindings - Women's 2022",
		"formattedTitle": "burton-lexa-x-est-snowboard-bindings---women's-",
		"brand": "burton",
		"description": "The Burton Lexa X EST Snowboard Bindings are top level all-mountain binders to get you charging hard on your Burton board. By using Burton's EST system, you get the closest boot to board contact of any binding. When paired with the responsive highback and featherweight construction of the Lexa X, your bindings and feet disappear as you become one with your snowboard, commanding it to rip ever faster down the hill powered by nothing but pure, distilled stoke.",
		"image": "1653404478803.jpg",
		"price": "209.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 125,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"binding_style": "Strap"
	},
	{
		"title": "Burton Lexa X EST Snowboard Bindings - Women's 2022 - Used",
		"formattedTitle": "burton-lexa-x-est-snowboard-bindings---women's----used",
		"brand": "burton",
		"description": "The Burton Lexa X EST Snowboard Bindings are top level all-mountain binders to get you charging hard on your Burton board. By using Burton's EST system, you get the closest boot to board contact of any binding. When paired with the responsive highback and featherweight construction of the Lexa X, your bindings and feet disappear as you become one with your snowboard, commanding it to rip ever faster down the hill powered by nothing but pure, distilled stoke.",
		"image": "1653404482024.jpg",
		"price": "199.46",
		"sized": ["S", "M", "L", "XL"],
		"stock": 84,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"binding_style": "Strap"
	},
	{
		"title": "Arbor Acacia Snowboard Bindings - Women's 2022",
		"formattedTitle": "arbor-acacia-snowboard-bindings---women's-",
		"brand": "arbor",
		"description": "Arbor Acacia Snowboard Bindings make for an easy entry to snowboarding, in both the general and specific sense. They're angled and shaped to cradle your boots comfortably, with asymmetrical highbacks and canted footbeds that place your knees in line with their natural stance. The straps are plush and easily adjustable, letting you get to the task at hand (shredding) instead of taking pain breaks every ten minutes.",
		"image": "1653404485156.jpg",
		"price": "141.30",
		"sized": ["S", "M", "L", "XL"],
		"stock": 93,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"binding_style": "Strap"
	},
	{
		"title": "Flow Juno Fusion Snowboard Bindings - Women's 2023",
		"formattedTitle": "flow-juno-fusion-snowboard-bindings---women's-",
		"brand": "flow",
		"description": "The Flow Juno Snowboard Bindings deliver a lively ride suitable for rippers of any ability. Their soft flex is ideal for those learning the ropes, but more experienced riders will appreciate their forgiving personality in the park and beyond. Rockered AXIS-Series baseplates ensure balanced power transfer to your edges, and Reclining Highbacks make them a breeze to get in and out of without having to sit in the snow. If you're looking for a setup you can get along with right off the bat, look no further than the Flow Juno Snowboard Bindings.",
		"image": "1653404487574.jpg",
		"price": "199.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 105,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Flow Juno Fusion Snowboard Bindings - Women's 2023 - Used",
		"formattedTitle": "flow-juno-fusion-snowboard-bindings---women's----used",
		"brand": "flow",
		"description": "The Flow Juno Snowboard Bindings deliver a lively ride suitable for rippers of any ability. Their soft flex is ideal for those learning the ropes, but more experienced riders will appreciate their forgiving personality in the park and beyond. Rockered AXIS-Series baseplates ensure balanced power transfer to your edges, and Reclining Highbacks make them a breeze to get in and out of without having to sit in the snow. If you're looking for a setup you can get along with right off the bat, look no further than the Flow Juno Snowboard Bindings.",
		"image": "1653404490414.jpg",
		"price": "189.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 17,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Arbor Acacia Snowboard Bindings - Women's 2023",
		"formattedTitle": "arbor-acacia-snowboard-bindings---women's-",
		"brand": "arbor",
		"description": "The Arbor Acacia Snowboard Bindings are a progression friendly choice that hit the sweet spot of comfort, performance, and value. The single mold baseplate provides precise, responsive board feel and tons of durability, and the women's specific highbacks deliver the control you need to progress from greens to blues to blacks. The latest model features all new ergonomic, pre-curved ankle straps for improved comfort and control, getting you moving and shaking up the learning curve.",
		"image": "1653404492836.jpg",
		"price": "199.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 99,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"binding_style": "Strap"
	},
	{
		"title": "Bataleon Spirit Snowboard Bindings - Women's 2022",
		"formattedTitle": "bataleon-spirit-snowboard-bindings---women's-",
		"brand": "bataleon",
		"description": "The Bataleon Spirit Snowboard Bindings are Bataleon's choice to pair with the Spirit snowboard, the softest and easiest to master in their lineup. Easy-flexing, comfortable and light, the Spirit bindings are a great choice for your first setup.",
		"image": "1653404495056.jpg",
		"price": "145.31",
		"sized": ["S", "M", "L", "XL"],
		"stock": 221,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"binding_style": "Strap"
	},
	{
		"title": "Rossignol Gala Snowboard Bindings - Women's 2022",
		"formattedTitle": "rossignol-gala-snowboard-bindings---women's-",
		"brand": "rossignol",
		"description": "Its a party on the bunny hill in the Rossignol Gala Snowboard Bindings, an entry-level chassis that makes snowboarding accessible and takes the stoke to new peaks. You deserve to focus your energy on riding and not adjusting your gear. Mainframe Highbacks and One Shot 3D Molded Straps give the Galas the response and precision you need without feeling overly punishing, and Puffy Pad Footbeds ensure every turn feels smooth. Get in a good headspace with the Rossignol Gala Snowboard Bindings, you'll be riding powder before you know it.",
		"image": "1653404497402.jpg",
		"price": "129.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 126,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"binding_style": "Strap"
	},
	{
		"title": "Burton Escapade Snowboard Bindings - Women's 2022",
		"formattedTitle": "burton-escapade-snowboard-bindings---women's-",
		"brand": "burton",
		"description": "Here we go ladies, the Burton Escapade Snowboard Bindings are here and ready to have your back through deep or shallow and everything in-between. Its smooth medium-firm flex and Zero-Lean Canted Highback provide a responsive flex that is tweakable yet firm. Locking your boots to the board is a Hammockstrap™ ankle strap and Suregrip Capstrap™ 2.0 designed for even hold and wide, comfortable coverage. The Burton Escapade Snowboard Bindings are a hard charging binding with a Women's Specific True Fit™ and fine adjustability you'll come to trust as they take you through thick and thin cold or heavy.",
		"image": "1653404500640.jpg",
		"price": "297.46",
		"sized": ["S", "M", "L", "XL"],
		"stock": 181,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Flow Omni Hybrid Snowboard Bindings - Women's 2023",
		"formattedTitle": "flow-omni-hybrid-snowboard-bindings---women's-",
		"brand": "flow",
		"description": "The Flow Omni Hybrid Snowboard Bindings are designed to make you feel omnipotent on snow, with rockered FUSE-Series baseplates and Carbon-infused highbacks for unrivaled support and power when you crank up the speed. Built with the latest iteration of the acclaimed Hybrid PowerStrap and all new Hexo Toecap Straps, these premium binders cradle your boot comfortably and precisely, creating a direct connection between you and your board for better-than-ever response and control. More comfortable, easier to use, and zero compromise on performance - just another day for the Flow Omni Hybrid Snowboard Bindings.",
		"image": "1653404503208.jpg",
		"price": "299.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 116,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Flow Omni Hybrid Snowboard Bindings - Women's 2023 - Used",
		"formattedTitle": "flow-omni-hybrid-snowboard-bindings---women's----used",
		"brand": "flow",
		"description": "The Flow Omni Hybrid Snowboard Bindings are designed to make you feel omnipotent on snow, with rockered FUSE-Series baseplates and Carbon-infused highbacks for unrivaled support and power when you crank up the speed. Built with the latest iteration of the acclaimed Hybrid PowerStrap and all new Hexo Toecap Straps, these premium binders cradle your boot comfortably and precisely, creating a direct connection between you and your board for better-than-ever response and control. More comfortable, easier to use, and zero compromise on performance - just another day for the Flow Omni Hybrid Snowboard Bindings.",
		"image": "1653404505386.jpg",
		"price": "284.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 208,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Burton Escapade Snowboard Bindings - Women's 2022 - Used",
		"formattedTitle": "burton-escapade-snowboard-bindings---women's----used",
		"brand": "burton",
		"description": "Here we go ladies, the Burton Escapade Snowboard Bindings are here and ready to have your back through deep or shallow and everything in-between. Its smooth medium-firm flex and Zero-Lean Canted Highback provide a responsive flex that is tweakable yet firm. Locking your boots to the board is a Hammockstrap™ ankle strap and Suregrip Capstrap™ 2.0 designed for even hold and wide, comfortable coverage. The Burton Escapade Snowboard Bindings are a hard charging binding with a Women's Specific True Fit™ and fine adjustability you'll come to trust as they take you through thick and thin cold or heavy.",
		"image": "1653404508589.jpg",
		"price": "237.97",
		"sized": ["S", "M", "L", "XL"],
		"stock": 181,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Rome Glade Snowboard Bindings - Women's 2021",
		"formattedTitle": "rome-glade-snowboard-bindings---women's-",
		"brand": "rome",
		"description": "The Rome Glade SE Snowboard Bindings are about fun at the hill and all-day, all-terrain performance. The Unibody baseplate is built simple and built to last, with a pared down construction that transfers power super well to the board. The Glade SE is as rugged as they come without being needlessly bulky. The Minimist straps and soft flexing highback make this binding great for beginner riders and for soul surfers looking to swoop their way around the mountain. The SE model is a limited colorway for extra style points.",
		"image": "1653404511991.jpg",
		"price": "134.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 27,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"binding_style": "Strap"
	},
	{
		"title": "Flow Omni Fusion Snowboard Bindings - Women's 2023",
		"formattedTitle": "flow-omni-fusion-snowboard-bindings---women's-",
		"brand": "flow",
		"description": "The Flow Omni Fusion Snowboard Bindings are designed to make you feel omnipotent on snow, with rockered FUSE-Series baseplates and Carbon-infused highbacks for unrivaled support and power when you crank up the speed. Built with the latest iteration of the acclaimed Fusion PowerStrap, these premium binders cradle your boot comfortably and precisely, creating a direct connection between you and your board for better-than-ever response and control. More comfortable, easier to use, and zero compromise on performance - just another day for the Flow Omni Fusion Snowboard Bindings.",
		"image": "1653404514700.jpg",
		"price": "299.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 170,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Arbor Sequoia Snowboard Bindings - Women's 2021",
		"formattedTitle": "arbor-sequoia-snowboard-bindings---women's-",
		"brand": "arbor",
		"description": "Snowboarding is too fun to limit yourself to just one dimension of the mountain. Ripping the groomers is fun, playing in the trees is fun, and messing around just for the sake of it is also fun. That's why the Arbor Sequoia Snowboard Bindings are made to do it all. With their responsive and energy efficient System X baseplate design, clever asymmetrical highbacks, adjustable heel cups, and light but durable aluminum buckles, the Sequoias are elegant and impressive at the same time, just like their namesake.",
		"image": "1653404517740.jpg",
		"price": "179.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 201,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Burton Lexa EST Snowboard Bindings - Women's 2022",
		"formattedTitle": "burton-lexa-est-snowboard-bindings---women's-",
		"brand": "burton",
		"description": "The Burton Lexa EST Snowboard Bindings are built for the hard charger, the ripper who's out there for the good and the bad, whether it's waist deep or boilerplate. They're built with stiff nylon composite Re:Flex™ baseplates, cushy FullBED footbeds to soak up impacts, and extra-responsive ankle and toe straps to keep you locked in tight, no matter how rowdy your ride gets. Just like you, they have the guts to perform no matter what the conditions hold, so grab the Lexas and get after it.",
		"image": "1653404520145.jpg",
		"price": "192.46",
		"sized": ["S", "M", "L", "XL"],
		"stock": 220,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"binding_style": "Strap"
	},
	{
		"title": "Burton Lexa EST Snowboard Bindings - Women's 2022 - Used",
		"formattedTitle": "burton-lexa-est-snowboard-bindings---women's----used",
		"brand": "burton",
		"description": "The Burton Lexa EST Snowboard Bindings are built for the hard charger, the ripper who's out there for the good and the bad, whether it's waist deep or boilerplate. They're built with stiff nylon composite Re:Flex™ baseplates, cushy FullBED footbeds to soak up impacts, and extra-responsive ankle and toe straps to keep you locked in tight, no matter how rowdy your ride gets. Just like you, they have the guts to perform no matter what the conditions hold, so grab the Lexas and get after it.",
		"image": "1653404523471.jpg",
		"price": "182.84",
		"sized": ["S", "M", "L", "XL"],
		"stock": 149,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"binding_style": "Strap"
	},
	{
		"title": "Bent Metal Stylist Snowboard Bindings - Women's 2022",
		"formattedTitle": "bent-metal-stylist-snowboard-bindings---women's-",
		"brand": "bent",
		"description": "When you drop in to a white carpet affair, it's good to know you're in good hands. Good feet. Bindings... Look: your stylist did the research, and you're dialed. Bent Metal Stylist Snowboard Bindings are in the know, they're in the flow, and they're quite frankly good to go. They're stiff enough for powering out of rough choices (like your aunt's shoulder-padded jumpsuit) but smooth enough to facilitate devastating style at any surprise cocktail party / terrain park.",
		"image": "1653404525854.jpg",
		"price": "174.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 79,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "GNU B-Real Snowboard Bindings - Women's 2022",
		"formattedTitle": "gnu-b-real-snowboard-bindings---women's-",
		"brand": "gnu",
		"description": "The versatility of the GNU B-Real Snowboard Bindings shines through no matter how or where you ride. A reclining highback ensures a super speedy entry so you can get up and riding quickly after dismounting from the lift, translating to at least 50 more untracked powder turns per season. And with automatically opening ankle straps for unmatched ease of use, your days will be that much more chill and frustration-free.",
		"image": "1653404528372.jpg",
		"price": "159.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 138,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Soft",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Arbor Sequoia Snowboard Bindings - Women's 2022",
		"formattedTitle": "arbor-sequoia-snowboard-bindings---women's-",
		"brand": "arbor",
		"description": "Have you heard about these sequoias? They're the next big thing. And the previous big thing. And just like their namesake, the Arbor Sequoia Snowboard Bindings are larger than life. They define the genre of high performing mid-flexing binders that will help you feel comfortable and in control anywhere on the mountain.",
		"image": "1653404530771.jpg",
		"price": "178.49",
		"sized": ["S", "M", "L", "XL"],
		"stock": 49,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Nidecker Kaon-W Snowboard Bindings - Women's 2022",
		"formattedTitle": "nidecker-kaon-w-snowboard-bindings---women's-",
		"brand": "nidecker",
		"description": "Nidecker Kaon-W Snowboard Bindings are ideal for skilled freeriders, precision carvers, and all-mountain alpha females. Lightweight, strong, and responsive, these bindings feature Asym Hadron Hibacks and glass-filled Axis.N1-Series baseplates and heelcups. ExoFrame ankle straps and Hexo toecaps give you seamless edge-to-edge energy transfer and secure foothold, so your board moves with you, and not the other way around.",
		"image": "1653404533691.jpg",
		"price": "199.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 221,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"binding_style": "Strap"
	},
	{
		"title": "Nidecker Kaon-W Snowboard Bindings - Women's 2022 - Used",
		"formattedTitle": "nidecker-kaon-w-snowboard-bindings---women's----used",
		"brand": "nidecker",
		"description": "Nidecker Kaon-W Snowboard Bindings are ideal for skilled freeriders, precision carvers, and all-mountain alpha females. Lightweight, strong, and responsive, these bindings feature Asym Hadron Hibacks and glass-filled Axis.N1-Series baseplates and heelcups. ExoFrame ankle straps and Hexo toecaps give you seamless edge-to-edge energy transfer and secure foothold, so your board moves with you, and not the other way around.",
		"image": "1653404536761.jpg",
		"price": "151.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 72,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"binding_style": "Strap"
	},
	{
		"title": "Arbor Sequoia Snowboard Bindings - Women's 2022 - Used",
		"formattedTitle": "arbor-sequoia-snowboard-bindings---women's----used",
		"brand": "arbor",
		"description": "Have you heard about these sequoias? They're the next big thing. And the previous big thing. And just like their namesake, the Arbor Sequoia Snowboard Bindings are larger than life. They define the genre of high performing mid-flexing binders that will help you feel comfortable and in control anywhere on the mountain.",
		"image": "1653404538870.jpg",
		"price": "169.57",
		"sized": ["S", "M", "L", "XL"],
		"stock": 43,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Ride AL-8 Snowboard Bindings - Women's 2021",
		"formattedTitle": "ride-al-8-snowboard-bindings---women's-",
		"brand": "ride",
		"description": "This season, Ride introduces a fully refreshed binding lineup with elegant nomenclature to boot. AL-8 for aluminum, ladies, 8 flex. The Ride AL-8 Snowboard Bindings are Ride's stiffest, burliest offering in women's bindings. For women looking for the pinnacle of performance in an aluminum chassis, the AL-8 is the answer.",
		"image": "1653404541050.jpg",
		"price": "209.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 43,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"binding_style": "Strap"
	},
	{
		"title": "K2 Cassette Snowboard Bindings - Women's 2023",
		"formattedTitle": "k2-cassette-snowboard-bindings---women's-",
		"brand": "k2",
		"description": "You got your first snowboard and now all you need is the right bindings to finish it off. You've come to the right place. The K2 Cassette Snowboard Bindings are made just for you. They're flexible, durable, and adjustable, so you can progress quickly and easily, and tweak your setup on the fly while you figure out what you need out of a binding. These versatile bindings will do it all and keep you comfortable while you learn your stuff on the hill.",
		"image": "1653404543524.jpg",
		"price": "169.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 7,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"binding_style": "Strap"
	},
	{
		"title": "K2 Bedford Snowboard Bindings - Women's 2023",
		"formattedTitle": "k2-bedford-snowboard-bindings---women's-",
		"brand": "k2",
		"description": "The K2 Bedford Snowboard Bindings are comfortable and versatile to enable any kind of all-mountain riding. These bindings come with extra cushy Custom Caddi ankle straps to keep you comfortable all day long, with a lightweight A-line Chassis to provide dialed-in power transfer and performance. The Bedford is an easy solution: one binding that does it all.",
		"image": "1653404546710.jpg",
		"price": "209.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 135,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Soft",
		"binding_style": "Strap"
	},
	{
		"title": "K2 Meridian Snowboard Bindings - Women's 2023",
		"formattedTitle": "k2-meridian-snowboard-bindings---women's-",
		"brand": "k2",
		"description": "The K2 Meridian Snowboard Bindings are just plain good. Whatever your style, they can accommodate it. They have a smooth medium flex, precision power transfer, excellent board feel, and tons of adjustability. Whether you're charging big lines, playing in the pow, jibbing the park, or cruising the groomers, these bindings have the performance and versatility to keep you in control.",
		"image": "1653404548979.jpg",
		"price": "239.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 52,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Salomon Rhythm Snowboard Bindings 2023",
		"formattedTitle": "salomon-rhythm-snowboard-bindings-",
		"brand": "salomon",
		"description": "Lightweight, asymmetrical, and easy flexing. When these three traits are combined, it makes for the smoothest, easiest riding binding you'll find. The asymmetrical design of both the highbacks and the baseplates allows the Salomon Rhythm Snowboard Bindings to provide power and precision on the outsides as well as forgiving maneuverability on the insides. The result is one of the best progression minded bindings on the market.",
		"image": "1653404552118.jpg",
		"price": "169.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 19,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"binding_style": "Strap"
	},
	{
		"title": "K2 Hue Snowboard Bindings - Women's 2023",
		"formattedTitle": "k2-hue-snowboard-bindings---women's-",
		"brand": "k2",
		"description": "The K2 Hue Snowboard Bindings are K2's premier offering for high level women's snowboarding. These stiff, responsive bindings offer you best-in-class stability and power transfer, perfect for aggressive freeriding and full-throttle shredding.",
		"image": "1653404554594.jpg",
		"price": "279.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 182,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Ride CL-4 Snowboard Bindings - Women's 2023",
		"formattedTitle": "ride-cl-4-snowboard-bindings---women's-",
		"brand": "ride",
		"description": "The Ride CL-4 Snowboard Bindings offer no frills functionality in a durable package suitable for riders of all abilities. They're perfect for intermediate riders tackling ever more demanding lines, or freestyle enthusiasts who like a bit more forgiveness and play from their bindings, but still appreciate the high quality construction and dependability that Ride provides.",
		"image": "1653404557104.jpg",
		"price": "219.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 118,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Ride CL-6 Snowboard Bindings - Women's 2023",
		"formattedTitle": "ride-cl-6-snowboard-bindings---women's-",
		"brand": "ride",
		"description": "If you're after a binding that's nailed on for all mountain capability, look no further than the Ride CL-6 Snowboard Bindings. These versatile bindings hit the sweet spot in flex and style, treading the line between freeride support and freestyle suppleness for do anything, go anywhere rideability. Laid up with a bomber C-Series Performance Chassis and buttery smooth Slimeback™ urethane infused highbacks, the CL-6 is the all mountain slayer you've been waiting for.",
		"image": "1653404559518.jpg",
		"price": "279.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 193,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Ride AL-6 Snowboard Bindings - Women's 2023",
		"formattedTitle": "ride-al-6-snowboard-bindings---women's-",
		"brand": "ride",
		"description": "The Ride AL-6 Snowboard Bindings are awesome all-mountain bindings designed specifically for women. The use a powerful aluminum chassis, reversible ankle straps, and a smooth-flexing Slimeback highback to provide all day response and comfort for park and resort riding.",
		"image": "1653404562970.jpg",
		"price": "299.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 20,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Ride A-10 Snowboard Bindings 2023",
		"formattedTitle": "ride-a-10-snowboard-bindings-",
		"brand": "ride",
		"description": "The math on the Ride A-10 Snowboard Bindings is pretty simple. The A is for aluminum. These come with the A-series metal chassis for bombproof power transfer. The 10 is for 10/10 flex. Put it together and you get the stiffest, most responsive binders in the Ride lineup. Decked out with the Carbon Slimeback™ Highback, the A-10 binding will have any freeride snowboarder or gas pedal groomer masher feeling large and in charge while they shred up the mountain.",
		"image": "1653404566109.jpg",
		"price": "449.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 33,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Very Stiff",
		"binding_style": "Strap"
	},
	{
		"title": "Ride C-9 Snowboard Bindings 2023",
		"formattedTitle": "ride-c-9-snowboard-bindings-",
		"brand": "ride",
		"description": "The Ride C-9 Snowboard Bindings offer the same stiff, responsive feel of the A-9 bindings, but with a composite chassis rather than an aluminum one. The composite chassis is a touch less rigid and more flexible, making this a top choice for high level freestyle riders, and hard charging freeriders with a penchant for flowy lines.",
		"image": "1653404568762.jpg",
		"price": "349.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 44,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"binding_style": "Strap"
	},
	{
		"title": "Salomon Mirage Snowboard Bindings - Women's 2023",
		"formattedTitle": "salomon-mirage-snowboard-bindings---women's-",
		"brand": "salomon",
		"description": "The Salomon Mirage Snowboard Bindings bring the supreme heel hold and natural flexion of Salomon's signature ShadowFit Baseplate to a softer, freestyle-friendly package. The smooth-flexing Mirage utilizes asymmetrical highbacks and ankle straps to maintain control and board feel, while adding supreme ease of handling. Perfect for mellow groomer cruising, anytime resort hotlapping, or all-out park ripping.",
		"image": "1653404571266.jpg",
		"price": "259.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 181,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Salomon Spell Snowboard Bindings - Women's 2023",
		"formattedTitle": "salomon-spell-snowboard-bindings---women's-",
		"brand": "salomon",
		"description": "The Salomon Spell Snowboard Bindings will help you charm the mountain into revealing its secrets. These easy-going bindings open up the enchanting world of snowboarding to newer riders. With a magically smooth flex and dependable natures, the Salomon Spell Snowboard Bindings will transfigure you from first timer to snow sorceress in no time.",
		"image": "1653404573585.jpg",
		"price": "139.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 81,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"binding_style": "Strap"
	},
	{
		"title": "Ride A-9 Snowboard Bindings 2023",
		"formattedTitle": "ride-a-9-snowboard-bindings-",
		"brand": "ride",
		"description": "The Ride A-9 Snowboard Bindings pair the super responsive A-Series aluminum chassis with a nylon highback for smooth rigidity and great response. A high performance package with a good balance of power and dampness, the A-9 is a great choice for aggressive riders hitting a varied terrain.",
		"image": "1653404576035.jpg",
		"price": "369.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 233,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"binding_style": "Strap"
	},
	{
		"title": "Roxy Viva Snowboard Bindings - Women's 2023",
		"formattedTitle": "roxy-viva-snowboard-bindings---women's-",
		"brand": "roxy",
		"description": "Who said bindings had to be stiff and uncomfortable? Not the Roxy Viva Snowboard Bindings, that's for sure. These all-mountain bindings are built with lightweight components and a forgiving flex for lasting comfort and balanced riding. Pair with a playful all mountain board for maximum fun all season long.",
		"image": "1653404578426.jpg",
		"price": "139.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 229,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Bent Metal Stylist Snowboard Bindings - Women's 2023",
		"formattedTitle": "bent-metal-stylist-snowboard-bindings---women's-",
		"brand": "bent",
		"description": "It not hard to figure out what the Bent Metal Stylist Snowboard Bindings are all about. With a selection of designs from sleek black to funky retro, they're certainly stylish to the eye. And with a softer all-mountain flex and powerful uni-body chassis, they enable riding that lets your own kinetic steelo shine. This bindings are dripping with style and jam packed with performance, destined for days of creative riding on all aspects of the mountain.",
		"image": "1653404581247.jpg",
		"price": "279.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 143,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Roxy Lola Snowboard Bindings - Women's 2023",
		"formattedTitle": "roxy-lola-snowboard-bindings---women's-",
		"brand": "roxy",
		"description": "The Roxy Lola Snowboard Bindings are a great option for riders who value simplicity but don't want to skimp on all mountain performance. Features like contoured asymmetric highbacks with tool-less adjustability and cushy EVA footbeds keep the comfort quota sky high, allowing you to keep cruising around the mountain until your legs turn to jelly.",
		"image": "1653404583705.jpg",
		"price": "169.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 4,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Bent Metal Forte Snowboard Bindings - Women's 2023",
		"formattedTitle": "bent-metal-forte-snowboard-bindings---women's-",
		"brand": "bent",
		"description": "Strong and smooth, the Bent Metal Forte Snowboard Bindings are brewed like a fine cup of coffee to wake you up in the morning and keep you going throughout the day. These all-mountain rippers are gentle, precise, and comfortable. They blend together a two-piece chassis, a nylon highback, and a magnesium fiber baseplate like a barista perfectly blending foam, steamed milk, and extra strong espresso to create a snowboarding masterpiece that will give you the boost you need.",
		"image": "1653404586806.jpg",
		"price": "319.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 43,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Bent Metal Metta Snowboard Bindings - Women's 2023",
		"formattedTitle": "bent-metal-metta-snowboard-bindings---women's-",
		"brand": "bent",
		"description": "When you get your board set up with the Bent Metal Metta Snowboard Bindings, you're setting yourself up for a good time. These mid flexing bindings are all about all-mountain style. They provide solid power transfer and dampening, so you can ride with precision and confidence on- or off-piste, plus they utilize a medium soft highback and baseplate to allow for easy turn initiation and a smooth, flowy ride.",
		"image": "1653404589486.jpg",
		"price": "209.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 138,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Soft",
		"binding_style": "Strap"
	},
	{
		"title": "Union Ultra Snowboard Binding - Women's 2023",
		"formattedTitle": "union-ultra-snowboard-binding---women's-",
		"brand": "union",
		"description": "Ride the rails, stomp the jumps, and show off your freestyle chops in your Union Ultra Snowboard Bindings. Utilizing Union's all new s16 Duraflex Highback and a super damp baseplate, you'll feel ultra cushioned on landings, ultra springy on takeoff, and ultra ready to take on whatever the day brings.",
		"image": "1653404592076.jpg",
		"price": "299.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 40,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Ride C-10 Snowboard Bindings 2023",
		"formattedTitle": "ride-c-10-snowboard-bindings-",
		"brand": "ride",
		"description": "Like all of Ride's bindings, the \"Big Boy\" 10 flex comes in both aluminum and composite options. The Ride C-10 Snowboard Bindings fall into the latter camp but are by no means a lesser binding. Still the stiffest option of the line, but with a touch more give for chattery snow and hard landings, the C-10 is the way to go for hard charging riders who demand the best support and prefer the smooth feel of a composite chassis.",
		"image": "1653404594611.jpg",
		"price": "419.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 39,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Very Stiff",
		"binding_style": "Strap"
	},
	{
		"title": "Ride CL-2 Snowboard Bindings - Women's 2023",
		"formattedTitle": "ride-cl-2-snowboard-bindings---women's-",
		"brand": "ride",
		"description": "If you like your flex marshmallow soft, we have the bindings for you. The Ride CL-2 Snowboard Bindings offer the mellowest flex in the Ride lineup, combining a lightweight chassis with a forgiving nylon highback and cruise-control power transfer. Perfect for beginners and those who prefer to keep it extra chill.",
		"image": "1653404596938.jpg",
		"price": "179.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 51,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"binding_style": "Strap"
	},
	{
		"title": "Flow Fenix Plus Fusion Snowboard Bindings 2023",
		"formattedTitle": "flow-fenix-plus-fusion-snowboard-bindings-",
		"brand": "flow",
		"description": "Rock beats scissor beats paper, but the Flow Fenix Plus Fusion Snowboard Bindings smashes them all. Forego the silly games for first tracks: these bindings are lightning quick to get into, so you can just drop in and let the two-strappers struggle for seconds. These all-rounders are extremely comfortable, cradling your boots with their wide straps--no hot spots! They're freestyle-friendly, with some lateral give for press- and grab- tweakability, but they're solid performers outside the park too. Dropping!",
		"image": "1653404599077.jpg",
		"price": "269.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 190,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Flow Fenix Plus Hybrid Snowboard Bindings 2023",
		"formattedTitle": "flow-fenix-plus-hybrid-snowboard-bindings-",
		"brand": "flow",
		"description": "Rock beats scissor beats paper, but the Flow Fenix Plus Hybrid Snowboard Bindings smashes them all. Forego the silly games for first tracks: these bindings are lightning quick to get into, so you can just drop in and let the two-strappers struggle for seconds. These all-rounders are extremely comfortable, cradling your boots with their wide straps--no hot spots! They're freestyle-friendly, with some lateral give for press- and grab- tweakability, but they're solid performers outside the park too. Dropping!",
		"image": "1653404601356.jpg",
		"price": "269.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 206,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Bataleon Donna Snowboard Bindings - Women's 2023",
		"formattedTitle": "bataleon-donna-snowboard-bindings---women's-",
		"brand": "bataleon",
		"description": "The Bataleon Donna Snowboard Bindings pair modern day ergonomics with an mid-range flex profile to create an incredibly comfortable binding with versatile range. Fit with their smaller QuarterBack highback to properly cradle women's size boots, plus an adjustable footpad to properly match your boot's outsole, the Donna provides the perfect fit to allow for unrestricted riding no matter where your adventure takes you.",
		"image": "1653404603707.jpg",
		"price": "269.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 154,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Flow NX2 Team Hybrid Snowboard Bindings 2023",
		"formattedTitle": "flow-nx2-team-hybrid-snowboard-bindings-",
		"brand": "flow",
		"description": "Dependability is key, and team riders know this: any time spent fiddling, puzzling, or troubleshooting can mean missing out on riding. That is completely unacceptable in this day and age! Flow NX2 Team Hybrid Snowboard Bindings are built diesel-tough with aluminum baseplates for maximum durability. This model features Flow's Hybrid straps, designed for a traditional two-strap vibe with a high level of convenience. Dial these in once and eliminate all that time hunkered down strapping in before every run. \"Dine on my scraps, y'all with those old straps.\"",
		"image": "1653404606239.jpg",
		"price": "239.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 159,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"binding_style": "Rear-Entry, Strap"
	},
	{
		"title": "Ride C-10 Snowboard Bindings 2022",
		"formattedTitle": "ride-c-10-snowboard-bindings-",
		"brand": "ride",
		"description": "Like all of Ride's adult bindings, the \"Big Boy\" 10 flex comes in both aluminum and composite options. The Ride C-10 Snowboard Bindings fall into the latter camp but are by no means a lesser binding. Still the stiffest option of the line, but with a touch more give for chattery snow and hard landings, the C-10 is the way to go for hard charging freeriders who demand the best support going.",
		"image": "1653404608665.jpg",
		"price": "319.16",
		"sized": ["S", "M", "L", "XL"],
		"stock": 175,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Very Stiff",
		"binding_style": "Strap"
	},
	{
		"title": "K2 Clicker X HB Snowboard Bindings - Women's 2022",
		"formattedTitle": "k2-clicker-x-hb-snowboard-bindings---women's-",
		"brand": "k2",
		"description": "Comfort, performance, and convenience - choose one, two if you're lucky. Said every binding ever, until the K2 Clicker X HB Snowboard Bindings. The latest evolution of K2's long standing Clicker lineup nails the full trifecta, combining rock solid toe and heel mount points with the added support of a women's specific Nylon highback for superb support and razor sharp edge control. Tool-less forward lean adjustment lets you tune your stance on the fly, and 3° canted footbeds ensure a natural and comfortable riding position to keep you feeling fine during all day shred sessions. No more fiddling with straps, no more putting up with instep crushing pressure points, just click it and rip it with the K2 Clicker X HB Snowboard Bindings.",
		"image": "1653404611451.jpg",
		"price": "223.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 150,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "K2 Clicker"
	},
	{
		"title": "Now Brigada Snowboard Bindings - Women's 2022",
		"formattedTitle": "now-brigada-snowboard-bindings---women's-",
		"brand": "now",
		"description": "Join the squad of stoked out shredders on the Now Brigada Snowboard Bindings. These time-tested bindings are built on Now's infamous Skate Tech chassis, engineered to zap energy directly to your edges for responsive riding in any terrain. Boasting a medium flex and Now's latest strap hardware, the Brigadas are perfect for freestylers laying it on thick both in and out of the park.",
		"image": "1653404615046.jpg",
		"price": "212.46",
		"sized": ["S", "M", "L", "XL"],
		"stock": 85,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Ride AL-6 Snowboard Bindings - Women's 2022",
		"formattedTitle": "ride-al-6-snowboard-bindings---women's-",
		"brand": "ride",
		"description": "The Ride AL-6 Snowboard Bindings are back without missing a beat, and that's great news for riders who want it all. The burly aluminum chassis offers great power transfer without being overly rigid, and the AL-6 continues to be offer durable value and top-notch performance in equal measure.",
		"image": "1653404618390.jpg",
		"price": "239.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 226,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Rome Flare Snowboard Bindings - Women's 2022",
		"formattedTitle": "rome-flare-snowboard-bindings---women's-",
		"brand": "rome",
		"description": "For those that want to cruise instead of get bruised, the Rome Flare Snowboard Bindings are the mellow-flexing binding for you. A supportive highback and comfy PureFlex Ankle Strap allows progression at whatever pace you desire.",
		"image": "1653404621039.jpg",
		"price": "191.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 25,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Soft",
		"binding_style": "Strap"
	},
	{
		"title": "Nidecker Muon-W Snowboard Bindings - Women's 2022",
		"formattedTitle": "nidecker-muon-w-snowboard-bindings---women's-",
		"brand": "nidecker",
		"description": "The Nidecker Muon-W Snowboard Bindings are high-caliber bindings for the people. They provide a comfortable, easy ride for women who want to elevate their snowboarding skills. Comfort Fit ankle straps are as comfortable as their name implies and they'll give you plenty of support and control. The Hexo toe cap form-fits to your toe for ultimate power transfer, so you can lock down with the lightweight Proton ratchets and make precise turns.",
		"image": "1653404623600.jpg",
		"price": "135.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 151,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Beginner-Intermediate",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "K2 Bedford Snowboard Bindings - Women's 2022",
		"formattedTitle": "k2-bedford-snowboard-bindings---women's-",
		"brand": "k2",
		"description": "The K2 Bedford Snowboard Bindings are focused on all-mountain comfort and durability. They feature a medium-soft flex that's forgiving and supple, as well as a fully tool-less customizable fit so you can get them nice and snug while you're on the go. The Bedford is simple and sweet, and good at what it does. It's lightweight and drives the board through the rigors of a good day at the hill.",
		"image": "1653404627015.jpg",
		"price": "167.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 177,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Soft",
		"binding_style": "Strap"
	},
	{
		"title": "Union Jamie Anderson Snowboard Bindings - Women's 2022",
		"formattedTitle": "union-jamie-anderson-snowboard-bindings---women's-",
		"brand": "union",
		"description": "You need bindings that perform when the chips are down, bindings tough enough to ride hard and come out swinging no matter the snow conditions. But, that doesn't mean they can't look good doing it. The Union Jamie Anderson Snowboard Bindings are a stunning take on the classic Union Trilogy bindings. They come with an extra durable Stage 4 baseplate, a super responsive and versatile highback, and new Exoframe 4.0 ankle straps that have you covered for comfort, support, and performance. And yeah, they look damn good, too.",
		"image": "1653404629846.jpg",
		"price": "319.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 31,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Union Juliet Snowboard Bindings - Women's 2022 - Used",
		"formattedTitle": "union-juliet-snowboard-bindings---women's----used",
		"brand": "union",
		"description": "When your day starts out with powder in the trees and ends with mellow laps in the park, you need a binding that can handle it all. The Union Juliet Snowboard Bindings are versatile all-mountain slayers built to excel in varied resort terrain, keep you dialed in the park, and never shy away from an adventure. With vibration dampening Thermoformed EVA bushings and Union's LG1 Duraflex highbacks, they hit the perfect balance of flex, comfort, and response to keep you cruising happy all season long.",
		"image": "1653404632660.jpg",
		"price": "169.54",
		"sized": ["S", "M", "L", "XL"],
		"stock": 65,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Ride A-9 Snowboard Bindings 2022",
		"formattedTitle": "ride-a-9-snowboard-bindings-",
		"brand": "ride",
		"description": "The Ride A-9 Snowboard Bindings pair the super responsive A-Series aluminum chassis with a nylon highback for smooth rigidity and great response. A high performance package with a good balance of power and dampness, the A-9 is a great choice for aggressive riders hitting a varied terrain.",
		"image": "1653404635123.jpg",
		"price": "295.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 193,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Stiff",
		"binding_style": "Strap"
	},
	{
		"title": "Flux GS Snowboard Bindings - Women's 2022",
		"formattedTitle": "flux-gs-snowboard-bindings---women's-",
		"brand": "flux",
		"description": "Flux GS Snowboard Bindings clamp. They clamp like the clampers they are. Just bindings being bindings? You bet. They're compact without compromising support, they're ergonomically shaped to hold your boot without digging in or snagging, and they just look perfect. An all-around binding that's comfortable with any boot, any terrain, and any mood. If your perfect day on the snow mixes mellow cruisers with moments of hyper-focused concentration, the Flux GS is a very solid choice.",
		"image": "1653404638728.jpg",
		"price": "214.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 73,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Rome Guild Snowboard Bindings 2022",
		"formattedTitle": "rome-guild-snowboard-bindings-",
		"brand": "rome",
		"description": "Surf the snow or hita backcountry booter with the Rome Guild Snowboard Bindings 2022. These playful bindings are built with an Ultralight Ankle Strap to make hiking with your skier friends a little less painful. PivotMount offers 16 different ankle strap configurations so you can customize your ride. Roll out with the squad knowing you'll be locked in all day long, weather it be on the groomers or in the sidecountry.",
		"image": "1653404641849.jpg",
		"price": "219.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 57,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "Ride CL-6 Snowboard Bindings - Women's 2022",
		"formattedTitle": "ride-cl-6-snowboard-bindings---women's-",
		"brand": "ride",
		"description": "The Ride CL-6 Snowboard Bindings are a solid choice for a freeride binding that is stiff enough to rip steeps and variable snow, but not too stiff to trick it up in the park. Featuring a hybrid aluminum / nylon design along with a Slimeback™ highback that are both stiff and smooth, the CL-6 has quickly become a favorite of the Ride lineup.",
		"image": "1653404645676.jpg",
		"price": "209.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 29,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Intermediate-Advanced",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	},
	{
		"title": "K2 Hue Snowboard Bindings - Women's 2022",
		"formattedTitle": "k2-hue-snowboard-bindings---women's-",
		"brand": "k2",
		"description": "OK, so the K2 Hue Snowboard Bindings only come in one hue - black. On the plus side they're designed with the fully customizable TriPod Chassis that optimizes power transmission and features K2's Lock Out Block for a super stable heelside feel. For women who ride hard and cherish the feel of a well-executed turn, the Hue is real.",
		"image": "1653404648806.jpg",
		"price": "212.76",
		"sized": ["S", "M", "L", "XL"],
		"stock": 193,
		"type": "bindings",
		"gender": "women",
		"ability_level": "Advanced-Expert",
		"flex_rating": "Medium",
		"binding_style": "Strap"
	}
]
