[
	{
		"title": "Von Zipper Encore Goggles",
		"formattedTitle": "von-zipper-encore-goggles",
		"brand": "von",
		"description": "One more lap? Sure, why not. It's impossible to resist when the snow looks this good, and it's all down to the Von Zipper Encore Goggles. The dual cylindrical polycarbonate lens offers 100% UV protection, and patented Wildlife Lens Technology really has to be seen to be believed, offering superior clarity and turbo-charged contrast to keep you coming back for more.",
		"image": "1653417387567.jpg",
		"price": "44.79",
		"sized": ["S", "M", "L", "XL"],
		"stock": 241,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Smith Frontier Low Bridge Fit Goggles",
		"formattedTitle": "smith-frontier-low-bridge-fit-goggles",
		"brand": "smith",
		"description": "The Smith Frontier Low Bridge Fit Goggles pack a lot of visibility into an affordable package. The cylindrical lens with airflow vents prevent fogging and the frame integrates seamlessly with Smith helmets for the streamlined look of a seasoned rider.",
		"image": "1653417389987.jpg",
		"price": "30.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 79,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Giro Method Goggles",
		"formattedTitle": "giro-method-goggles",
		"brand": "giro",
		"description": "A standout for their modern angular looks and huge field of vision, the Giro Method Goggles also boast crystal clear VIVID optics courtesy of Zeiss Optics. This new style features EXV (Expansion View) Technology so you'll see absolutely everything the mountain throws at you, and EVAK venting to help keep your view fog-free. Giro delivers again with one of the best combinations of style and function in the goggle world.",
		"image": "1653417393467.jpg",
		"price": "139.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 165,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Large",
		"lens_type": "Cylindrical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Von Zipper Cleaver Goggles",
		"formattedTitle": "von-zipper-cleaver-goggles",
		"brand": "von",
		"description": "Trusty goggles are a must on the slopes. A good day gone bad due to foggy goggles is easily avoidable with the Von Zipper Cleaver Goggles. The dual-layered anti-fog cylindrical lens and wide field of vision combine to perform as your spy gadget for mountain missions. Plus, when your James Bonding your way through the steep, the Tri Density face foam wicks moisture from your face and keeps you comfortable through the tough stuff. Alright 007, time to show 'em what you've got.",
		"image": "1653417396174.jpg",
		"price": "82.44",
		"sized": ["S", "M", "L", "XL"],
		"stock": 231,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Large",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Dragon D1 OTG Goggles",
		"formattedTitle": "dragon-d1-otg-goggles",
		"brand": "dragon",
		"description": "Got glasses? No problem! The Dragon D1 OTG Goggles are designed specifically to accommodate your spectacles as they simultaneously shield your face from the pelting sting of snow and/or harsh rays. Updated with a 200% stronger Super Anti-Fog coating, on-trend cylindrical lenses, and Dragon's celebrated LUMALENS® optimized color technology (select colorways only), the Dragon D1 OTG Goggles boast incredible value, especially if you need a pair of goggles that play nice with your glasses.",
		"image": "1653417398911.jpg",
		"price": "62.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 23,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Large, OTG (Over The Glasses)",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Dragon X1s Goggles",
		"formattedTitle": "dragon-x1s-goggles",
		"brand": "dragon",
		"description": "For all your gnarly astronauts, the Dragon X1s Goggles have landed. With the same frameless design as the original APX, but a slightly smaller frame size, the Dragon X1s Goggles are for interstellar explorers without Jupiter-sized domes. These goggles feature Dragon's optically-correct lenses, super anti-fog coating, and the patented easy lens interchange system. Armored venting along the top of the frame is burly but still allows moisture to move freely. Whether you're thinking about sending it into orbit, or just spaced and cruising groomers, the Dragon X1s Goggles come in peace.",
		"image": "1653417402046.jpg",
		"price": "118.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 65,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Spherical"
	},
	{
		"title": "Dragon DXs Goggles",
		"formattedTitle": "dragon-dxs-goggles",
		"brand": "dragon",
		"description": "The Dragon DXs Goggles bring the same superior tech and show-stopping style as the DX goggles but in a smaller size. They come equipped with top-of-the-line Lumalenses for crisp and vibrant vision, plus a helmet compatible design and dual layer face foam. These let smaller shredders see the mountain in clarity with a goggle that fits their face perfectly.",
		"image": "1653417404454.jpg",
		"price": "24.64",
		"sized": ["S", "M", "L", "XL"],
		"stock": 78,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Small",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Dragon DXT OTG Goggles",
		"formattedTitle": "dragon-dxt-otg-goggles",
		"brand": "dragon",
		"description": "Clean and simple styling that doesn't break the bank, the Dragon DXT OTG Goggles can be worn over your glasses while their Super Anti Fog lenses and small fit make them ideal for tweens, teens, or just those with smaller faces.",
		"image": "1653417407584.jpg",
		"price": "41.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 136,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Small",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Giro Contact AF Goggles",
		"formattedTitle": "giro-contact-af-goggles",
		"brand": "giro",
		"description": "Do you sweat a lot? Are your goggles always fogged? Have you ever found yourself uttering, \"Is it blurry out, or is that just me?\" Snag a pair of the Giro Contact AF Goggles, with the Snapshot Lens Interchange System, and say goodbye to those days of constantly drying out goggles and taking extra time to swap lenses. These spherical goggs come with two lenses and integrate seamlessly with any Giro helmet. Welcome to whole days of shredding without goggle problems.",
		"image": "1653417410084.jpg",
		"price": "195.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 139,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Large",
		"lens_type": "Spherical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Smith Skyline XL Low Bridge Fit Goggles",
		"formattedTitle": "smith-skyline-xl-low-bridge-fit-goggles",
		"brand": "smith",
		"description": "The time has come! Expand your sights to the furthest horizons with the rimless Smith Skyline XL Low Bridge Fit Goggles featuring the Spherical Carbonic-X Lens. Cutting edge ChromaPop™ technology optics improve detail and color for unrivaled clarity while carving out your mountain legacy. A Fog-X Anti-Fog Inner Lens fights moisture build up from the inside, so you can focus on your line and minimize downtime spent clearing annoying goggle fogginess. Embrace the future of goggle technology with the Over The Glasses compatible Smith Skyline XL Goggles.",
		"image": "1653417412432.jpg",
		"price": "108.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 163,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Large, OTG (Over The Glasses)",
		"lens_type": "Spherical"
	},
	{
		"title": "Smith Prophecy OTG Goggles",
		"formattedTitle": "smith-prophecy-otg-goggles",
		"brand": "smith",
		"description": "Folks who good vision don't even know how easy they have it, but the Smith Prophecy OTG Goggles bring a little bit of simplicity back to your eyewear. The Over the Glasses fit is roomy enough for your rims and the floating foam membrane eliminates pressure from the arms. Two layer DriWix foam wicks moisture and the adjustable lens ventilation ensure a fog-free ski session for all day performance and comfort.",
		"image": "1653417414864.jpg",
		"price": "72.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 141,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Large, OTG (Over The Glasses)",
		"lens_type": "Spherical"
	},
	{
		"title": "Giro Millie Goggles - Women's",
		"formattedTitle": "giro-millie-goggles---women's",
		"brand": "giro",
		"description": "Designed with a slightly smaller women's specific frame, the Giro Millie Goggles are the friend you wants to help you see clearly on the mountain. With Giro's premium VIVID lenses with optics by ZEISS, they have supreme contrast, clarity, and smooth style. The Millie fits nicely over glasses, is compatible with all Giro helmets, and features a ton of colorways to match your style. Give this glass a friendship bracelet, you're sure to get along great!",
		"image": "1653417417313.jpg",
		"price": "75.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 155,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Spherical"
	},
	{
		"title": "Smith Showcase OTG Low Bridge Fit Goggles - Women's",
		"formattedTitle": "smith-showcase-otg-low-bridge-fit-goggles---women's",
		"brand": "smith",
		"description": "An over-the-glasses solution that stays low-profile - is it too good to be true? Nope. The Smith Showcase OTG Low Bridge Fit Goggles allow you to ride hard with your spectacles in a slimmed down, low-bulk style. Designed for easy all day wearability and top shelf optical clarity, these goggles feature Smith's premium ChromaPop™ lens technology for enhanced contrast and color definition in every light condition. Shred your way to freedom with a fit that works for you.",
		"image": "1653417420891.jpg",
		"price": "72.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 227,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Small, OTG (Over The Glasses)",
		"lens_type": "Spherical"
	},
	{
		"title": "Smith Skyline XL Goggles",
		"formattedTitle": "smith-skyline-xl-goggles",
		"brand": "smith",
		"description": "The time has come! Expand your sights to the furthest horizons with the rimless Smith Skyline XL Goggles featuring the Spherical Carbonic-X Lens. Cutting edge ChromaPop™ technology optics improve detail and color for unrivaled clarity while carving out your mountain legacy. A Fog-X Anti-Fog Inner Lens fights moisture build up from the inside, so you can focus on your line and minimize downtime spent clearing annoying goggle fogginess. Embrace the future of goggle technology with the Over The Glasses compatible Smith Skyline XL Goggles.",
		"image": "1653417423784.jpg",
		"price": "108.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 171,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Large, OTG (Over The Glasses)",
		"lens_type": "Spherical"
	},
	{
		"title": "Giro Dylan Goggles - Women's",
		"formattedTitle": "giro-dylan-goggles---women's",
		"brand": "giro",
		"description": "The Giro Dylan Goggles provide the modern features you need to keep your vision sharp on the mountains. The cylindrical no-frills design harkens back to the good old days, but Giro realizes that the times they are a changin' so they've fitted this staple with EXV technology for wide-screen optic. They also include a swappable low light lens with every pair.",
		"image": "1653417428220.jpg",
		"price": "67.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 81,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Smith Squad MAG Goggles",
		"formattedTitle": "smith-squad-mag-goggles",
		"brand": "smith",
		"description": "This iconic goggle is equipped with the best in class Smith MAG™ interchangeable system, making the Smith Squad MAG Goggles even better than ever. A simple push lever releases the cylindrical lens for quick lens swaps whenever, wherever, allowing you to roll with the (you guessed it) squad, without missing a beat!",
		"image": "1653417430761.jpg",
		"price": "240.00",
		"sized": ["S", "M", "L", "XL"],
		"stock": 25,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium, Large",
		"lens_type": "Cylindrical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Smith Proxy Goggles",
		"formattedTitle": "smith-proxy-goggles",
		"brand": "smith",
		"description": "Packing a huge field of vision in a medium-sized frame, the Smith Proxy Goggles provide no-nonsense clarity in a fuzzy world. Contrast enhancing ChromaPop™ lenses, triple face foam, and Fog-X anti fog coating on the inner lens mean clear sailing (or riding) no matter what the weather.",
		"image": "1653417433899.jpg",
		"price": "90.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 193,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Spherical"
	},
	{
		"title": "Smith Squad XL Goggles",
		"formattedTitle": "smith-squad-xl-goggles",
		"brand": "smith",
		"description": "When in doubt, go big with the Smith Squad XL Goggles. Same great goggle - even bigger field of view. Plus, the minimal, semi rimless Responsive Fit™ Frame removes the bulk while maintaining a fully functional and stylish cylindrical fit. Topped with Fog-X technology and TLT optics for clear vision in all conditions, squad up for a sendy time in the mountains with the crew.",
		"image": "1653417437521.jpg",
		"price": "90.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 32,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Large",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Smith Skyline Goggles",
		"formattedTitle": "smith-skyline-goggles",
		"brand": "smith",
		"description": "The time has come! Expand your horizons with the rimless Smith Skyline Goggles featuring the Spherical Carbonic-X Lens. Cutting edge ChromaPop™ technology optics improve detail and color for unrivaled clarity while carving out your mountain legacy. A Fog-X Anti-Fog Inner Lens fights moisture build up from the inside, so you can focus on your line and minimize downtime spent clearing annoying goggle fogginess. Embrace the future of goggle technology and rock a pair of rimless Smith Skyline Goggles.",
		"image": "1653417440000.jpg",
		"price": "108.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 167,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Spherical"
	},
	{
		"title": "Dragon RVX OTG Goggles",
		"formattedTitle": "dragon-rvx-otg-goggles",
		"brand": "dragon",
		"description": "The Dragon RVX OTG Goggles offer incredible optics and an epic field of view bigger than a starry night sky in the middle of Nebraska. LUMALENS® tech lets you see every variation in the landscape with vivid color and detail, and they fit right over your glasses so you never have to compromise on seeing clearly. Plus, the new Swiftlock 2.0 lens change system makes swapping lenses easier than ever, you won't even have to take your goggles off.",
		"image": "1653417443250.jpg",
		"price": "130.89",
		"sized": ["S", "M", "L", "XL"],
		"stock": 3,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Large, OTG (Over The Glasses)",
		"lens_type": "Cylindrical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Dragon NFX2 Goggles",
		"formattedTitle": "dragon-nfx2-goggles",
		"brand": "dragon",
		"description": "Building upon the popular NFX, Dragon continues to up the ante with the Dragon NFX2 Goggles. A slightly smaller profile better accommodates a variety of face shapes/sizes while the all-new Swiftlock Technology makes swapping lenses easier than ever - simply flip a lever and pop out the old, click in the new, and you're ready to roll. The patented frameless technology, paired with the optically correct cylindrical lenses provides the best peripheral vision in the game, it's like you're not even wearing goggles! With 2 lens options straight out of the box, you'll kick yourself for ever hesitating to pull the trigger.",
		"image": "1653417446274.jpg",
		"price": "125.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 191,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Cylindrical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Dragon PXV Goggles",
		"formattedTitle": "dragon-pxv-goggles",
		"brand": "dragon",
		"description": "The new Dragon PXV Goggles bring a new standard to the goggle market. Panotech lenses feature a unique toric lens curvature that'll bring your visibility to a whole new level. Also featuring Lumalens® optimized color tints, Super Anti-Fog treatment, and face swaddling triple-layer face foam, these goggles cover all the bases you'd expect from a company like Dragon. The ultimate goggle for the ultimate shredding experience.",
		"image": "1653417448986.jpg",
		"price": "125.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 213,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Large",
		"lens_type": "Toric"
	},
	{
		"title": "Von Zipper Jetpack AF Goggles",
		"formattedTitle": "von-zipper-jetpack-af-goggles",
		"brand": "von",
		"description": "Get ready to blast into another solar system with the Von Zipper Jetpack AF Goggles. The 4Play lens interchange system is warp speed fast and is held in a rimless frame for ultimate visibility. The triple density foam is moisture-wicking and lined with polar-fleece, providing ultimate comfort as you conquer the mountain, the galaxies, and beyond.",
		"image": "1653417451090.jpg",
		"price": "160.19",
		"sized": ["S", "M", "L", "XL"],
		"stock": 21,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Large",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Von Zipper Capsule Goggles",
		"formattedTitle": "von-zipper-capsule-goggles",
		"brand": "von",
		"description": "Treat your eyes right this Winter with the Von Zipper Capsule Goggles. Boasting an oversized cylindrical lens, a semi-rimless frame, and superb optics in a variety of light conditions, they bring out the best in your retinas so you can focus on enjoying the turns.",
		"image": "1653417454269.jpg",
		"price": "150.44",
		"sized": ["S", "M", "L", "XL"],
		"stock": 95,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Large, OTG (Over The Glasses)",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Von Zipper MACH Goggles",
		"formattedTitle": "von-zipper-mach-goggles",
		"brand": "von",
		"description": "The Von Zipper MACH Goggles delivers classic good looks in a premium, well ventilated package. Designed to pull fresh air in and expel moist air quickly, the Proprietary Venturi Ventilation System keeps the view crystal clear and fog free. Combined with comfy, close fitting face foam and superb peripheral vision, the MACH ticks all the boxes for riders of all stripes.",
		"image": "1653417456911.jpg",
		"price": "116.09",
		"sized": ["S", "M", "L", "XL"],
		"stock": 11,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Oakley Unity Collection Flight Deck L Goggles",
		"formattedTitle": "oakley-unity-collection-flight-deck-l-goggles",
		"brand": "oakley",
		"description": "Jump higher, fly farther, just become a bird while you're at it. Kidding of course, goggles can't make you transform into a new person, but the Oakley Unity Collection Flight Deck L Goggles will make you feel like you're on top of the world. With colors inspired by your favorite Olympic athletes, you can carry a piece of your inspiration with you wherever you shred. The Flight Deck is defined by an exceptionally clean frameless design, with a sub frame attachment system that makes lens changes easy as pie. The traditional Oakley niceties like best-in-class optics, F3 anti-fog coating, and temple notches to accommodate eyeglasses are all there, too. Level up your gear and get in the mindset that your riding isn't far behind.",
		"image": "1653417459316.jpg",
		"price": "181.60",
		"sized": ["S", "M", "L", "XL"],
		"stock": 140,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Large, OTG (Over The Glasses)",
		"lens_type": "Spherical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Oakley Fall Line XL Goggles",
		"formattedTitle": "oakley-fall-line-xl-goggles",
		"brand": "oakley",
		"description": "The über-hot spherical style of the Fall Line goggles goes big this winter with the Oakley Fall Line XL Goggles. If you love the look of the Fall Line but want a bigger field of vision, this is your goggle. And with at least one Prizm™ lens included in each package, you'll not only see BIGGER, you'll see BETTER.",
		"image": "1653417463163.jpg",
		"price": "76.50",
		"sized": ["S", "M", "L", "XL"],
		"stock": 43,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Large",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Giro Facet Goggles - Women's",
		"formattedTitle": "giro-facet-goggles---women's",
		"brand": "giro",
		"description": "The Giro Facet Goggles are just another facet of your killer ski game. What do awesome skis do if you can't see well? Nothing. That's where the Facet Goggles come in! Their Expansion View frame gives you unparalleled peripheral vision, and the anti-fog coating and EVAK venting make sure the only visual obstruction is the snow dumping from the sky. A quick-change magnetic lens system lets you sub lenses out like hockey lines, and you can wear your glasses with these, too. Do-it-all riders need do-it-all goggles, and the Giro Facet Goggles are it.",
		"image": "1653417466837.jpg",
		"price": "104.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 109,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium, OTG (Over The Glasses)",
		"lens_type": "Spherical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Dragon x evo D1 OTG Goggles",
		"formattedTitle": "dragon-x-evo-d1-otg-goggles",
		"brand": "dragon",
		"description": "Got glasses? No problem! The Dragon x evo D1 OTG Goggles are designed specifically to accommodate your spectacles as they simultaneously shield your face from the pelting sting of snow and harsh cosmic rays. Updated with a 200% stronger Super Anti-Fog coating, on-trend cylindrical lenses, and Dragon's celebrated LUMALENS® optimized color technology, the Dragon x evo D1 OTG Goggles boast incredible value, especially if you need a pair of goggles that play nice with your glasses.",
		"image": "1653417469458.jpg",
		"price": "55.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 133,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Large, OTG (Over The Glasses)",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Zeal Beacon Goggles",
		"formattedTitle": "zeal-beacon-goggles",
		"brand": "zeal",
		"description": "As the first goggle on their line to feature the Observation Deck Technology (ODT), the Zeal Beacon Goggles are the technical and performance first goggles that you've been looking to upgrade into. ODT puts the bottom of the goggle frame closer to the face for improved vertical peripheral, and teaming with the Zeal polarized technology, offering superior protection against sun rays. The Beacons are over the glasses compatible and have an upper and lower vent system.",
		"image": "1653417472111.jpg",
		"price": "90.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 196,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium, OTG (Over The Glasses)",
		"lens_type": "Cylindrical"
	},
	{
		"title": "GoggleSoc Protective Goggle Cover",
		"formattedTitle": "gogglesoc-protective-goggle-cover",
		"brand": "gogglesoc",
		"description": "Say goodbye to scratched and smudged goggle lenses with the GoggleSoc Protective Goggle Cover. This protective microfiber cover fits easily over goggles, even when they're still on your helmet. The GoggleSoc comes in a variety of prints and will keep your lenses crispy all season long.",
		"image": "1653417474648.jpg",
		"price": "14.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 26,
		"type": "goggles",
		"gender": "women"
	},
	{
		"title": "Smith Squad Low Bridge Fit Goggles",
		"formattedTitle": "smith-squad-low-bridge-fit-goggles",
		"brand": "smith",
		"description": "You know that term \"squad goals\" that seems to be popping up in every teenage girl's Instagram captions lately? We're still not totally sure what it means, but we think it might be referring to the redesigned Smith Squad Low Bridge Fit Goggles. They feature a massive cylindrical lens, made from tough Carbonic-X material, with Fog-X technology and TLT lens technology for crystal clear vision, plus minimal semi-rimless frame technology and a fully integrated strap connection point for functionality and style points. Add in Helmet compatibility and an ultra-wide, silicone backed strap and you've got yourself an enviable goggle that won't let you down when you need it most. Achieve all of your squad goals with the Smith Squad Low Bridge Fit Goggles.",
		"image": "1653417477312.jpg",
		"price": "72.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 246,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Giro Index 2.0 Goggles",
		"formattedTitle": "giro-index-2.0-goggles",
		"brand": "giro",
		"description": "We've all been there (well, those of us with less-than-perfect vision): do you wear your contacts and risk getting the dreaded dry eye by lunch, or do you risk crashing into a tree by going without? Giro Index 2.0 Goggles revisit that never-quite-good-enough option: the Over-the-Glasses fit. And, believe us, they've nailed it! These frames have cutouts specifically designed to accommodate your eyeglasses, and extra volume inside to help prevent the double-fogger. Drop in with your true prescription!",
		"image": "1653417480382.jpg",
		"price": "52.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 17,
		"type": "goggles",
		"gender": "women",
		"frameSize": "OTG (Over The Glasses)",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Oakley Line Miner L Goggles",
		"formattedTitle": "oakley-line-miner-l-goggles",
		"brand": "oakley",
		"description": "The renamed Oakley Line Miner L Goggles are designed to sit closer to the face than any previous model, so you get unparalleled downward and peripheral vision. Plus, they're fully helmet compatible and feature discreet frame notches at the temples for compatibility with most prescription eyewear. Add Oakley's Prizm™ technology (in select colorways) and you've got yourself a goggle that provides Oakley's seamless mix of superior performance and effortless style. *Note: some models may say XL. This is a name change - the goggles are the same.*",
		"image": "1653417484665.jpg",
		"price": "99.20",
		"sized": ["S", "M", "L", "XL"],
		"stock": 181,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Large, OTG (Over The Glasses)",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Zeal Lookout Goggles",
		"formattedTitle": "zeal-lookout-goggles",
		"brand": "zeal",
		"description": "Forget what you once knew about goggles, the games have changed! The Zeal Lookout Goggles are polarized for protection, have a factory anti-fog coating, and revolutionary new lens technology, Observation Deck Technology, expanding your vertical view by 20%. And adjusting to the day's veritable lighting conditions with the Lookout Goggles is a piece of cake. Automatic+ lenses adjust to changing light in real-time, and when it changes from day to night, the Rail Lock System ensures the cleanest and quickest lens swap.",
		"image": "1653417487917.jpg",
		"price": "174.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 101,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium, OTG (Over The Glasses)",
		"lens_type": "Cylindrical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Zeal Hemisphere Goggles",
		"formattedTitle": "zeal-hemisphere-goggles",
		"brand": "zeal",
		"description": "Maximize your eyesight and your goggle's lifespan with the Zeal Hemisphere Goggle. The low profile frame optimizes your peripheral vision and the Everclear anti-fog treatment and scratch-resistant Permashield hardcoat ensure you'll always have 20/20 vision.",
		"image": "1653417490026.jpg",
		"price": "129.00",
		"sized": ["S", "M", "L", "XL"],
		"stock": 21,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Spherical"
	},
	{
		"title": "Oakley Line Miner XM Goggles",
		"formattedTitle": "oakley-line-miner-xm-goggles",
		"brand": "oakley",
		"description": "Not everyone fits the massive goggles of today, so Oakley came around with the XM (extra-medium) Line Miner Goggle for the smaller faces out there. The original Line Miner has one of the largest peripheral views on the market, and the Oakley Line Miner XM Goggles are no exception to this top-of-the-line construction. Combine that with revolutionary Prizm™ lenses for definition and clarity across a wide range of light conditions and you get one of the sweetest, best performing goggles on the market today.",
		"image": "1653417494043.jpg",
		"price": "71.50",
		"sized": ["S", "M", "L", "XL"],
		"stock": 161,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium, OTG (Over The Glasses)",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Airblaster Pill Air Goggles",
		"formattedTitle": "airblaster-pill-air-goggles",
		"brand": "airblaster",
		"description": "Somewhere on spaceship earth, a rider dons their Airblaster Pill Air Goggles and steps out of their comfort zone to seek adventure. It's a good thing they are wearing goggles that refuse to fog, won't break easily, and stay put through rough terrain.",
		"image": "1653417496593.jpg",
		"price": "69.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 28,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Dragon D1 OTG Goggles - Used",
		"formattedTitle": "dragon-d1-otg-goggles---used",
		"brand": "dragon",
		"description": "Got glasses? No problem! The Dragon D1 OTG Goggles are designed specifically to accommodate your spectacles as they simultaneously shield your face from the pelting sting of snow and/or harsh rays. Updated with a 200% stronger Super Anti-Fog coating, on-trend cylindrical lenses, and Dragon's celebrated LUMALENS® optimized color technology (select colorways only), the Dragon D1 OTG Goggles boast incredible value, especially if you need a pair of goggles that play nice with your glasses.",
		"image": "1653417499182.jpg",
		"price": "59.84",
		"sized": ["S", "M", "L", "XL"],
		"stock": 19,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Large, OTG (Over The Glasses)",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Giro Method Goggles",
		"formattedTitle": "giro-method-goggles",
		"brand": "giro",
		"description": "A standout for their modern angular looks and huge field of vision, the Giro Method Goggles also boast crystal clear VIVID optics courtesy of Zeiss Optics. This new style features EXV (Expansion View) Technology so you'll see absolutely everything the mountain throws at you, and EVAK venting to help keep your view fog-free. Giro delivers again with one of the best combinations of style and function in the goggle world.",
		"image": "1653417502196.jpg",
		"price": "83.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 71,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Large",
		"lens_type": "Cylindrical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Anon WM1 Goggles - Women's - Used",
		"formattedTitle": "anon-wm1-goggles---women's---used",
		"brand": "anon",
		"description": "When the storm is raging, winds are pelting your face, and the light is flat, look to the Anon WM1 Goggles for crystal clear vision to see you through. They feature a distortion-free spherical lens, fog-fighting Outlast® face foam, and a super easy Magna-Tech™ quick change lens system. Michelle Parker relies on the Anon WM1 Goggles to spot her landings and guide her down the mountain, and now you can too.",
		"image": "1653417505892.jpg",
		"price": "151.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 134,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Spherical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Oakley Flight Deck L Goggles",
		"formattedTitle": "oakley-flight-deck-l-goggles",
		"brand": "oakley",
		"description": "The Flight Deck L — you've made it, Ace. With ridiculous peripheral vision and the latest in easily interchangeable lenses, the Oakley Flight Deck L Goggles will take your riding to atmospheric levels. Smash that together with a rimless design and you've got a winner. Stealth looks, crisp vision - you're set to fly fo' sho'!",
		"image": "1653417508737.jpg",
		"price": "141.60",
		"sized": ["S", "M", "L", "XL"],
		"stock": 150,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Large, OTG (Over The Glasses)",
		"lens_type": "Spherical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Anon M4 Cylindrical Snapback Goggles",
		"formattedTitle": "anon-m4-cylindrical-snapback-goggles",
		"brand": "anon",
		"description": "The Anon M4 Cylindrical Snapback Goggles offer a precise helmet to Goggle fit without sacrificing clarity. Featuring cylindrical lenses and Magna-Tech™ Quick Lens Change Technology, you can change your vision with the click of a magnet. Their intuitive Snapback Strap is designed to be worn under helmets and eliminate unwanted pressure points from a strap or layered with a hat for cozy mountain style. Hit rails or slash pow, the Anon M4 Cylindrical Snapback Goggles are made to do it all.",
		"image": "1653417511176.jpg",
		"price": "239.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 42,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium, Large",
		"lens_type": "Spherical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Smith I/O MAG S Goggles - Women's - Used",
		"formattedTitle": "smith-i/o-mag-s-goggles---women's---used",
		"brand": "smith",
		"description": "Welcome to the world of optical clarity with the Smith I/O MAG S Goggles. Leading the charge for anyone with a smaller face, the MAG S features a clean design that's rimless where you need it, combined with an easy to use interchangeable lens system for quick lens swaps mid-day. Smith's proven optics make this the #1 choice for the true enthusiast.",
		"image": "1653417514211.jpg",
		"price": "142.49",
		"sized": ["S", "M", "L", "XL"],
		"stock": 50,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Spherical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Anon Sync Goggles",
		"formattedTitle": "anon-sync-goggles",
		"brand": "anon",
		"description": "The Sync Goggles are a new offering from anon, combining simple low profile style and superior functionality with top end goggle tech. These primo snow shades offer superb clarity of vision with large cylindrical ZEISS Sonar lenses, Wall-to-Wall vision and Full Perimeter Channel Venting working together to provide sharp optics with zero fogging when the going gets tough. Featuring comfortable triple density face foam and M-Fusion lens change tech for switching things up in a snap, the anon Sync Goggles an easy choice for serious shredders.",
		"image": "1653417517897.jpg",
		"price": "149.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 231,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium, Large",
		"lens_type": "Cylindrical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Anon WM3 MFI Goggles - Women's",
		"formattedTitle": "anon-wm3-mfi-goggles---women's",
		"brand": "anon",
		"description": "The Anon WM3 MFI Goggles deliver supersized performance in a petite frame designed to fit small to medium faces. You can't ride if you can't see, so Anon packed a ton of features into this pint-size package to help you maintain crystal clear vision through any weather. Things like razor sharp PERCEIVE Lenses, Magna-Tech™ Quick Lens Change Technology, and Full Perimeter Channel Venting for fog free performance in stormy conditions. They even come with an MFI facemask that magnetically attaches for seamless protection. The WM3 MFI Goggles have it all, what are you waiting for?",
		"image": "1653417521208.jpg",
		"price": "202.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 177,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Small, OTG (Over The Glasses)",
		"lens_type": "Cylindrical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Anon WM1 Goggles - Women's",
		"formattedTitle": "anon-wm1-goggles---women's",
		"brand": "anon",
		"description": "When the storm is raging, winds are pelting your face, and the light is flat, look to the Anon WM1 Goggles for crystal clear vision to see you through. They feature a distortion-free spherical lens, fog-fighting Outlast® face foam, and a super easy Magna-Tech™ quick change lens system. Michelle Parker relies on the Anon WM1 Goggles to spot her landings and guide her down the mountain, and now you can too.",
		"image": "1653417524599.jpg",
		"price": "176.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 4,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Spherical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Anon Sync Goggles - Women's",
		"formattedTitle": "anon-sync-goggles---women's",
		"brand": "anon",
		"description": "The Sync Goggles are a new offering from anon, combining simple low profile style and superior functionality with top end goggle tech. These primo snow shades offer superb clarity of vision with large cylindrical ZEISS Sonar lenses, Wall-to-Wall vision and Full Perimeter Channel Venting working together to provide sharp optics with zero fogging when the going gets tough. Featuring comfortable triple density face foam and M-Fusion lens change tech for switching things up in a snap, the anon Sync Goggles an easy choice for serious shredders.",
		"image": "1653417527873.jpg",
		"price": "149.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 183,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium, Large",
		"lens_type": "Cylindrical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "POC Zonula Clarity Goggles",
		"formattedTitle": "poc-zonula-clarity-goggles",
		"brand": "poc",
		"description": "You'll be able to see clearly even in the rain with the POC Zonula Clarity Goggles. Their toric lens mimics the curvature of your eye, which provides a wide field of vision that gives you the highest probability of seeing the racer kids before they cut you off. A quick change lens system adds ease to adjusting when the weather conditions change, and anti fog and scratch treatments make them extra durable and ready for the next big storm. With a sleek design, the Zonula Clarity Goggles mesh snugly with your helmet and protect your eyes from the sun, for a close to body fit that performs well all over the snow.",
		"image": "1653417531270.jpg",
		"price": "219.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 239,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Toric",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Smith Proxy Low Bridge Fit Goggles",
		"formattedTitle": "smith-proxy-low-bridge-fit-goggles",
		"brand": "smith",
		"description": "Featuring a medium fit frame, the Smith Proxy Low Bridge Fit Goggles offer a huge field of vision and clean, modern lines. With Smith's heralded ChromaPop™ lens technology, you'll see all of the contours on the hill and then some.",
		"image": "1653417533876.jpg",
		"price": "90.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 102,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Spherical"
	},
	{
		"title": "Volcom Stoney Goggles",
		"formattedTitle": "volcom-stoney-goggles",
		"brand": "volcom",
		"description": "Volcom head to toe - that's the dream. And with the Volcom Stoney Goggles, it's a reality. These low profile goggles make a stylish addition to anyone's kit, with a solid feature set that belies a very reasonable price. They have tough, anti-scratch cylindrical lenses and offer great optics for snow sliders of all stripes.",
		"image": "1653417536427.jpg",
		"price": "65.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 179,
		"type": "goggles",
		"gender": "women",
		"frameSize": "OTG (Over The Glasses)",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Anon M4 Toric Low Bridge Fit Goggles",
		"formattedTitle": "anon-m4-toric-low-bridge-fit-goggles",
		"brand": "anon",
		"description": "The Anon M4 Toric Low Bridge Fit Goggles offer precise helmet to goggle fit with a huge field of vision and razor sharp optics to keep you seeing clearly in the mountains. Featuring a toric lens that mimics the curvature of the eye for improved vision and full perimeter channel venting to keep the inner lens breezy and fog free, the Anon M4 is the ultimate goggle for the ultimate shredder.",
		"image": "1653417539014.jpg",
		"price": "319.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 35,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium, Large, OTG (Over The Glasses)",
		"lens_type": "Toric",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Anon Helix 2.0 Perceive Goggles",
		"formattedTitle": "anon-helix-2.0-perceive-goggles",
		"brand": "anon",
		"description": "Keep your eyes on the prize this season with the Anon Helix 2.0 Perceive Goggles, packing all the tech you need at a price that won't break the bank. Lightweight, durable and highly resistant to fogging, these suave snow shades come with a cylindrical PERCEIVE lens for superb peripheral vision and contrast boosting clarity through a wide range of light conditions.",
		"image": "1653417541771.jpg",
		"price": "78.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 127,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Small, OTG (Over The Glasses)",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Von Zipper Cleaver Goggles - Used",
		"formattedTitle": "von-zipper-cleaver-goggles---used",
		"brand": "von",
		"description": "Trusty goggles are a must on the slopes. A good day gone bad due to foggy goggles is easily avoidable with the Von Zipper Cleaver Goggles. The dual-layered anti-fog cylindrical lens and wide field of vision combine to perform as your spy gadget for mountain missions. Plus, when your James Bonding your way through the steep, the Tri Density face foam wicks moisture from your face and keeps you comfortable through the tough stuff. Alright 007, time to show 'em what you've got.",
		"image": "1653417544924.jpg",
		"price": "78.32",
		"sized": ["S", "M", "L", "XL"],
		"stock": 23,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Large",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Anon Relapse Goggles - Used",
		"formattedTitle": "anon-relapse-goggles---used",
		"brand": "anon",
		"description": "Rad days, hot laps and stompin' sends for the boys are what the Anon Relapse Goggles are all about. Wall to wall vision ensures great peripheral vision at lightspeed, and an Integral Clarity lens keeps fogging to a minimum. The Anon Relapse Goggle are also MFI facemask compatible, for those windy storm days that lash your face but keep getting better as the snow piles up.",
		"image": "1653417547664.jpg",
		"price": "85.49",
		"sized": ["S", "M", "L", "XL"],
		"stock": 46,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium, OTG (Over The Glasses)",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Dragon RVX OTG Goggles - Used",
		"formattedTitle": "dragon-rvx-otg-goggles---used",
		"brand": "dragon",
		"description": "The Dragon RVX OTG Goggles offer incredible optics and an epic field of view bigger than a starry night sky in the middle of Nebraska. LUMALENS® tech lets you see every variation in the landscape with vivid color and detail, and they fit right over your glasses so you never have to compromise on seeing clearly. Plus, the new Swiftlock 2.0 lens change system makes swapping lenses easier than ever, you won't even have to take your goggles off.",
		"image": "1653417550349.jpg",
		"price": "130.00",
		"sized": ["S", "M", "L", "XL"],
		"stock": 111,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Large, OTG (Over The Glasses)",
		"lens_type": "Cylindrical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Von Zipper Skylab Goggles",
		"formattedTitle": "von-zipper-skylab-goggles",
		"brand": "von",
		"description": "Grab the Von Zipper Skylab Goggles and set thrusters to maximum, you're heading for the Stratosphere. Whether you're a flyboy or a rocket queen, the crisp visual acuity of the Skylab Goggles provide a tantalizing taste of a birds-eye view.",
		"image": "1653417552826.jpg",
		"price": "102.84",
		"sized": ["S", "M", "L", "XL"],
		"stock": 12,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Spherical"
	},
	{
		"title": "Smith I/O Goggles - Used",
		"formattedTitle": "smith-i/o-goggles---used",
		"brand": "smith",
		"description": "A fan favorite for years and for good reason. The Smith I/O Goggles stand as one of the most trustworthy goggles on the market and feature top technology to enhance your time on the mountain. With ChromaPop™ Lens Technology, 5X™ Anti-Fog Inner Lens and Tapered Lens Technology, you can expect to fly down your line while minimizing the effects of variable light and pesky fogging.",
		"image": "1653417555481.jpg",
		"price": "199.50",
		"sized": ["S", "M", "L", "XL"],
		"stock": 42,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Spherical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Julbo Airflux Goggles - Used",
		"formattedTitle": "julbo-airflux-goggles---used",
		"brand": "julbo",
		"description": "Get the most flux for your hucks with the Julbo Airflux Goggles. What we're trying to say is, ride hard, go big without worrying about goggle fog. The SuperFlow System lets you edge your lens forward to release heat and maximize air flow during a hard hike or on the lift after a rippin' descent. The minimalist frame is super thin so skiers can get the biggest field of view through a signature Julbo lens. You may never take these off.",
		"image": "1653417558013.jpg",
		"price": "142.45",
		"sized": ["S", "M", "L", "XL"],
		"stock": 187,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Large",
		"lens_type": "Spherical"
	},
	{
		"title": "Electric EG2-T.S Goggles - Used",
		"formattedTitle": "electric-eg2-t.s-goggles---used",
		"brand": "electric",
		"description": "\"More lens, less frame.\" That's the design philosophy behind the Electric EG2-T.S Goggles, and this smaller-framed version takes it even further. With full peripheral vision and comfy face foam, these fit snugly on your face and are compatible with any helmets. They have fantastic optics, thanks to their toric shape which has some of the best characteristics from cylindrical and spherical lenses. Fog- and scratch-proof, they're up for the challenges of a season on the hill, too.",
		"image": "1653417560500.jpg",
		"price": "107.34",
		"sized": ["S", "M", "L", "XL"],
		"stock": 182,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Toric"
	},
	{
		"title": "Oakley Fall Line XL Goggles - Used",
		"formattedTitle": "oakley-fall-line-xl-goggles---used",
		"brand": "oakley",
		"description": "The über-hot spherical style of the Fall Line goggles goes big this winter with the Oakley Fall Line XL Goggles. If you love the look of the Fall Line but want a bigger field of vision, this is your goggle. And with at least one Prizm™ lens included in each package, you'll not only see BIGGER, you'll see BETTER.",
		"image": "1653417563937.jpg",
		"price": "94.08",
		"sized": ["S", "M", "L", "XL"],
		"stock": 239,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Large",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Smith Vice Goggles - Used",
		"formattedTitle": "smith-vice-goggles---used",
		"brand": "smith",
		"description": "A fantastic choice for budget-minded shoppers looking for the modern looks of a spherical goggle, the Smith Vice Goggles come through in the clutch with uncompromising ChromaPop lens technology, plush 3-layer face foam, and a balanced medium fit that errs away from the bug-eyed look of many oversized spherical designs.",
		"image": "1653417566925.jpg",
		"price": "94.04",
		"sized": ["S", "M", "L", "XL"],
		"stock": 207,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Spherical"
	},
	{
		"title": "Smith Squad MAG Goggles - Used",
		"formattedTitle": "smith-squad-mag-goggles---used",
		"brand": "smith",
		"description": "The iconic Squad goggle just got an upgrade. Now with the best in class Smith MAG™ interchangeable system, the Smith Squad MAG Goggles are better than ever. A simple push lever releases the cylindrical lens for quick lens swaps whenever, wherever, allowing you to roll with the (you guessed it) squad, without missing a beat!",
		"image": "1653417569573.jpg",
		"price": "127.29",
		"sized": ["S", "M", "L", "XL"],
		"stock": 8,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium, Large",
		"lens_type": "Cylindrical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Smith I/O MAG XL Goggles - Used",
		"formattedTitle": "smith-i/o-mag-xl-goggles---used",
		"brand": "smith",
		"description": "Go MAG™ and go big at the same time with the Smith I/O MAG XL Goggles; you won't regret either choice. Designed for larger faces and expansive views, the I/O MAG XL provides super secure lens lock with both magnetic and mechanical fastening, and proven Smith ChromaPop optics make the best of any landscape.",
		"image": "1653417572798.jpg",
		"price": "142.49",
		"sized": ["S", "M", "L", "XL"],
		"stock": 210,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Large",
		"lens_type": "Spherical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Anon Sync Goggles - Used",
		"formattedTitle": "anon-sync-goggles---used",
		"brand": "anon",
		"description": "The Sync Goggles are a new offering from anon, combining simple low profile style and superior functionality with top end goggle tech. These primo snow shades offer superb clarity of vision with large cylindrical ZEISS Sonar lenses, Wall-to-Wall vision and Full Perimeter Channel Venting working together to provide sharp optics with zero fogging when the going gets tough. Featuring comfortable triple density face foam and M-Fusion lens change tech for switching things up in a snap, the anon Sync Goggles an easy choice for serious shredders.",
		"image": "1653417575510.jpg",
		"price": "142.49",
		"sized": ["S", "M", "L", "XL"],
		"stock": 201,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium, Large",
		"lens_type": "Cylindrical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Dragon NFX2 Goggles - Used",
		"formattedTitle": "dragon-nfx2-goggles---used",
		"brand": "dragon",
		"description": "Building upon the popular NFX, Dragon continues to up the ante with the Dragon NFX2 Goggles. A slightly smaller profile better accommodates a variety of face shapes/sizes while the all-new Swiftlock Technology makes swapping lenses easier than ever - simply flip a lever and pop out the old, click in the new, and you're ready to roll. The patented frameless technology, paired with the optically correct cylindrical lenses provides the best peripheral vision in the game, it's like you're not even wearing goggles! With 2 lens options straight out of the box, you'll kick yourself for ever hesitating to pull the trigger.",
		"image": "1653417579160.jpg",
		"price": "126.34",
		"sized": ["S", "M", "L", "XL"],
		"stock": 47,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Cylindrical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Oakley Line Miner XM Goggle Lens - Used",
		"formattedTitle": "oakley-line-miner-xm-goggle-lens---used",
		"brand": "oakley",
		"description": "The Oakley Line Miner XM Goggle Lens is a replacement or add-on to your Line Miner XM goggles. Thanks to their easy change design, you can stock up on the right lens for the right situation, or replace them after taking one too many branches to the face.",
		"image": "1653417581606.jpg",
		"price": "95.00",
		"sized": ["S", "M", "L", "XL"],
		"stock": 214,
		"type": "goggles",
		"gender": "women"
	},
	{
		"title": "Smith Squad XL Low Bridge Fit Goggles - Used",
		"formattedTitle": "smith-squad-xl-low-bridge-fit-goggles---used",
		"brand": "smith",
		"description": "When in doubt, go big with the Smith Squad XL Low Bridge Fit Goggles. Same great goggle - even bigger field of view. Plus, the minimal, semi rimless Responsive Fit™ Frame removes the bulk while maintaining a fully functional and stylish cylindrical fit. Topped with Fog-X technology and TLT optics for clear vision in all conditions, squad up for a sendy time in the mountains with the crew.",
		"image": "1653417584191.jpg",
		"price": "86.44",
		"sized": ["S", "M", "L", "XL"],
		"stock": 55,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Large",
		"lens_type": "Cylindrical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Smith Squad Goggles - Used",
		"formattedTitle": "smith-squad-goggles---used",
		"brand": "smith",
		"description": "Now iconic, the Smith Squad Goggles have risen to the top for good reason. The minimal, semi rimless Responsive Fit™ Frame removes the bulkiness while maintaining a fully functional and stylish cylindrical fit. Topped with Fog-X technology and TLT optics for clear vision in all conditions, Squad up for an enjoyable time in the mountains with the crew.",
		"image": "1653417586990.jpg",
		"price": "63.64",
		"sized": ["S", "M", "L", "XL"],
		"stock": 247,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Dragon X1 Goggles",
		"formattedTitle": "dragon-x1-goggles",
		"brand": "dragon",
		"description": "The best part about the Dragon X1 Goggles and their mirrored oversized lenses? They keep the haters out and your business in, along with a sleek profile and frameless design. Beyond looks, they're loaded with features; Dragon's most advanced lenses keep your vision clear no matter what the haters say. A Super Anti-Fog treatment and vents keep your vision fog-free so you can stay 100%, and easy lens swapping lets you adjust to conditions no matter how hazy, fuzzy, sunny, or stormy it gets. Unlimited peripheral vision keeps you dialed to your surroundings, whether scoping the park line, snow bunnies, pow fields, or at the tippy top of a ridge line. If you're looking for goggles that keeps it as real as you do, go with the Dragon X1 Goggles. You won't be let down.",
		"image": "1653417590188.jpg",
		"price": "118.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 173,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Large",
		"lens_type": "Spherical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Dragon X2 Goggles",
		"formattedTitle": "dragon-x2-goggles",
		"brand": "dragon",
		"description": "The Dragon X2 Goggles are an evolution of the APX Goggles. Yes, it might be hard to imagine, because the APXs were already mind blowing. But technology does what technology wants, and keeps on moving. The X2s feature a simpler and more robust goggle locking mechanism; now you can swap lenses without taking the X2s off your face. The design of the X2s is essentially frameless, and has a super clean look. The X2s have Dragon's high-quality polycarbonate lenses that offer insane peripheral vision and distortion-free clarity. Since we live in the future, you may as well make technology work for you with the Dragon X2 Goggles. Personal robot assistant not included.",
		"image": "1653417593005.jpg",
		"price": "153.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 179,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Large",
		"lens_type": "Spherical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Dragon DX3 OTG Goggles",
		"formattedTitle": "dragon-dx3-otg-goggles",
		"brand": "dragon",
		"description": "The Dragon DX3 OTG Goggles offer ample room and complete coverage for the shredder who prefers the look and feel of a cylindrical frame. Featuring tried and proven LUMALENS® technology and a bomber anti-fog coating, the DX3 is a retro-inspired frame for the modern mountain rider.",
		"image": "1653417595672.jpg",
		"price": "41.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 248,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Dragon PXV2 Goggles",
		"formattedTitle": "dragon-pxv2-goggles",
		"brand": "dragon",
		"description": "The Dragon PXV2 Goggles are the Goldilocks goggs in Dragon's premium lineup. Slightly smaller than the PVX and slightly larger than the best-selling NFX2, the PVX2s are the result of years of fine tuning and innovation. Featuring LUMALENS® Optimized Color Technology, Panotech lens shape, and the revolutionary Swiftlock lens change system, you're never more than a click away from perfect snow vision.",
		"image": "1653417599093.jpg",
		"price": "160.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 203,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Large",
		"lens_type": "Toric",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Dragon NFXs Goggles",
		"formattedTitle": "dragon-nfxs-goggles",
		"brand": "dragon",
		"description": "Dragon never mentioned what NFX stands for, so we did some field research. We think NFX stands for New French X-plorers. Because, science (and France). Well, maybe it doesn't, but the Dragon NFXs Goggles don't make excuses. The s in NFXs stands for small; the NFXs is a scaled-down version of the NFX, because goggles aren't meant to take up your entire forehead and face. With stand-out looks and easily swappable cylindrical lenses, the NFXs Goggles stand apart. Anti-fog coating and venting fight fog while the silicone backed strap won't slide around on your hat or helmet. Next time you're shredding, stand out and hold it down with the Dragon NFXs.",
		"image": "1653417601494.jpg",
		"price": "75.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 84,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Cylindrical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Smith Moment Goggles",
		"formattedTitle": "smith-moment-goggles",
		"brand": "smith",
		"description": "A small-framed convex option designed for women's faces, the Smith Moment Goggles feature classic Smith ChromaPop™ optics in a sweet package. Fog-X anti-fog coating on the inner lens, plus 3-layer DriWix face foam for luxurious comfort all add up to an all-winter winner.",
		"image": "1653417605007.jpg",
		"price": "90.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 33,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Small",
		"lens_type": "Spherical"
	},
	{
		"title": "Giro Moxie Goggles - Women's",
		"formattedTitle": "giro-moxie-goggles---women's",
		"brand": "giro",
		"description": "Low profile, high tech. The Giro Moxie Goggles are a cylindrical lens goggle with a wide field of view and an anti-fog coating. Built with a slightly smaller, women's specific medium frame and Expansion View Technology that increases peripheral vision, this fleece lined gogg is one for the books. Build up some Moxie and hit the slopes!",
		"image": "1653417608189.jpg",
		"price": "45.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 200,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Electric EG2-T.S Goggles",
		"formattedTitle": "electric-eg2-t.s-goggles",
		"brand": "electric",
		"description": "\"More lens, less frame.\" That's the design philosophy behind the Electric EG2-T.S Goggles, and this smaller-framed version takes it even further. With full peripheral vision and comfy face foam, these fit snugly on your face and are compatible with any helmets. They have fantastic optics, thanks to their toric shape which has some of the best characteristics from cylindrical and spherical lenses. Fog- and scratch-proof, they're up for the challenges of a season on the hill, too.",
		"image": "1653417611391.jpg",
		"price": "112.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 17,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Toric"
	},
	{
		"title": "BlackStrap Goggle Cover",
		"formattedTitle": "blackstrap-goggle-cover",
		"brand": "blackstrap",
		"description": "A little goggle cover goes a long way. Keep your goggle lenses scratch-free and dry with the BlackStrap Goggle Cover. Made in the USA with re-purposed fabric, this goggle cover minimizes your impact on the environment while minimizing the environment's impact on your lenses. Talk about a win-win situation!",
		"image": "1653417615867.jpg",
		"price": "14.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 113,
		"type": "goggles",
		"gender": "women"
	},
	{
		"title": "Atomic Four Q Stereo Goggles",
		"formattedTitle": "atomic-four-q-stereo-goggles",
		"brand": "atomic",
		"description": "The Atomic Four Q Stereo Goggles are for snow-goers who like an understated frame with a killer lens and a comfortable fit. The Cylindrical Fusion Double Lens with Stereo Lens Technology sits closer to your face and broadens field of view by 20% while reducing glare, eliminating reflections, rerouting fog and condensation, and preventing scratches. If you need to put your lens on the bench, Atomic's Quick Click Lens System lets you swap easily and in no time at all. The Live Fit Frame with Adaptive LF Tri-Layer Face Foam forms to your face for a fit that you can live with, heck, you could sleep in these goggles. Enjoy the mountain without any hang-ups or fog-ups with the Atomic Four Q Stereo Goggles.",
		"image": "1653417618897.jpg",
		"price": "219.95",
		"sized": ["S", "M", "L", "XL"],
		"stock": 5,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium, Large",
		"lens_type": "Cylindrical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "GoggleSoc B4BC Goggle Cover",
		"formattedTitle": "gogglesoc-b4bc-goggle-cover",
		"brand": "gogglesoc",
		"description": "Say goodbye to scratched and smudged goggle lenses with the help of the GoggleSoc B4BC Goggle Cover. The B4BC GoggleSoc not only keeps your lenses nice and crispy all season long, but all the proceeds go to fight breast cancer too. Double whammy!",
		"image": "1653417621398.jpg",
		"price": "15.00",
		"sized": ["S", "M", "L", "XL"],
		"stock": 106,
		"type": "goggles",
		"gender": "women"
	},
	{
		"title": "POC Zonula Clarity Comp Goggles",
		"formattedTitle": "poc-zonula-clarity-comp-goggles",
		"brand": "poc",
		"description": "Bio-Based Materials, a wide frame of view, and easily interchangeable lenses are just a few of the things that make the POC Zonula Clarity Comp Goggles a great all around freeride choice. Their toric lens mimics the shape of your eye, for exceptional sight when you're trying to avoid patrollers in slow zones. Almost identical to their non-comp counter part, the Comp series is optimized for competition, where the light frequency of their lenses has been tailored for use in intense short periods like racing. Whether you're dropping into your first freeride course, hitting the beer league with friends after work, or just going really really fast, the POC Zonula Clarity Comp Goggles are designed with an anti-fog and scratch treatment to make your adventure haze free.",
		"image": "1653417625110.jpg",
		"price": "198.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 127,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Toric",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Oakley Line Miner XM Goggles",
		"formattedTitle": "oakley-line-miner-xm-goggles",
		"brand": "oakley",
		"description": "Not everyone fits the massive goggles of today, so Oakley came around with the XM (extra-medium) Line Miner Goggle for the smaller faces out there. The original Line Miner has one of the largest peripheral views on the market, and the Oakley Line Miner XM Goggles are no exception to this top-of-the-line construction. Combine that with revolutionary Prizm™ lenses for definition and clarity across a wide range of light conditions and you get one of the sweetest, best performing goggles on the market today.",
		"image": "1653417634350.jpg",
		"price": "99.20",
		"sized": ["S", "M", "L", "XL"],
		"stock": 149,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium, OTG (Over The Glasses)",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Anon M3 Goggles",
		"formattedTitle": "anon-m3-goggles",
		"brand": "anon",
		"description": "It's all about the accessories, we know that, you know that, let everyone else know it with the Anon M3 Goggles. Their Magna-Tech™ Quick Lens Change Technology allows for an easy transition between different lenses so that you can customize how you outfit your eyes. Their compatibility to MFI facemasks allows you to get as snug a fit as possible between your goggles and mask so that icy blasts can't reach you. You and your eyes deserve it, make the Anon M3 Goggle a part of your mountain-going get up!",
		"image": "1653417637211.jpg",
		"price": "176.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 61,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium, OTG (Over The Glasses)",
		"lens_type": "Cylindrical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Smith Drift Goggles - Women's",
		"formattedTitle": "smith-drift-goggles---women's",
		"brand": "smith",
		"description": "A clean and effective design make the Smith Drift Goggles a trustworthy companion in the snow. With their women's medium fit and Airflow lens technology, you can expect active ventilation to reduce fog in the worst of conditions. Take flight with the Smith Drift Goggles.",
		"image": "1653417640252.jpg",
		"price": "36.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 216,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Small",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Anon WM1 MFI Goggles - Women's",
		"formattedTitle": "anon-wm1-mfi-goggles---women's",
		"brand": "anon",
		"description": "When the storm is raging and the winds are pelting your face with snowflakes, rely on the magnetically sealed facemask integration of the Anon WM1 MFI Goggles. Beyond having an awesome goggle-to-facemask interface, the WM1 MFI Goggles feature a distortion-free spherical lens, fog-fighting Outlast® face foam, and a super easy Magna-Tech™ quick change lens system. Michelle Parker relies on the Anon WM1 MFI Goggles to spot her landings and guide her down the mountain, and now you can too.",
		"image": "1653417643413.jpg",
		"price": "202.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 237,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Spherical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Airblaster Awesome Co. Air Goggles",
		"formattedTitle": "airblaster-awesome-co.-air-goggles",
		"brand": "airblaster",
		"description": "Somewhere out there on the mountain is a poor soul who's having no fun. They're struggling with fogging, fragile and inadequate goggles, thankfully, you can't relate. You have the Airblaster Awesome Co. Air Goggles. The simple design makes it as durable and fog-resistant as a goggle can be.",
		"image": "1653417646783.jpg",
		"price": "69.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 175,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Volcom Garden Goggles",
		"formattedTitle": "volcom-garden-goggles",
		"brand": "volcom",
		"description": "Take off your rose tinted spectacles and see what the Volcom Garden Goggles have to offer. This OTG design works for many face types, providing a wide field of vision for all types of riding and a durable, anti-scratch hard coating for dependability, season after season.",
		"image": "1653417649545.jpg",
		"price": "57.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 67,
		"type": "goggles",
		"gender": "women",
		"frameSize": "OTG (Over The Glasses)",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Anon Insight Goggles - Women's",
		"formattedTitle": "anon-insight-goggles---women's",
		"brand": "anon",
		"description": "Flat light and foggy goggles can easily ruin a perfectly good day in the mountains, so give yourself the gift of clear vision with the Anon Insight Goggles. Their high contrast PERCEIVE Lenses are tuned for clarity and sharpness in a wide range of light conditions, while Integral Clarity Technology ensures fog free performance in stormy weather - no more frustrating mid run stops to wipe your goggles clean. Less time fussing with your goggles means more time swooping with your pals, so make sure you swoop on the Anon Insight Goggles!",
		"image": "1653417653000.jpg",
		"price": "78.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 114,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Small",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Volcom Migrations Goggles",
		"formattedTitle": "volcom-migrations-goggles",
		"brand": "volcom",
		"description": "The Volcom Migrations Goggles bring fantastic optical clarity and comfort to smaller faces, not to mention classic Volcom style. Spherical lenses curve both horizontally and vertically for optimal peripheral visibility on the mountain, and their triple layer foam sits comfortably on the face for easy all day wearability.",
		"image": "1653417655846.jpg",
		"price": "48.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 108,
		"type": "goggles",
		"gender": "women",
		"frameSize": "OTG (Over The Glasses)",
		"lens_type": "Spherical"
	},
	{
		"title": "Oakley Line Miner L Goggles",
		"formattedTitle": "oakley-line-miner-l-goggles",
		"brand": "oakley",
		"description": "The renamed Oakley Line Miner L Goggles are designed to sit closer to the face than any previous model, so you get unparalleled downward and peripheral vision. Plus, they're fully helmet compatible and feature discreet frame notches at the temples for compatibility with most prescription eyewear. Add Oakley's Prizm™ technology (in select colorways) and you've got yourself a goggle that provides Oakley's seamless mix of superior performance and effortless style. *Note: some models may say XL. This is a name change - the goggles are the same.*",
		"image": "1653417662652.jpg",
		"price": "99.20",
		"sized": ["S", "M", "L", "XL"],
		"stock": 17,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Large, OTG (Over The Glasses)",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Anon Relapse Goggles",
		"formattedTitle": "anon-relapse-goggles",
		"brand": "anon",
		"description": "Rad days, hot laps and stompin' sends for the boys are what the Anon Relapse Goggles are all about. Wall to wall vision ensures great peripheral vision at lightspeed, and an Integral Clarity lens keeps fogging to a minimum. The Anon Relapse Goggle are also MFI facemask compatible, for those windy storm days that lash your face but keep getting better as the snow piles up.",
		"image": "1653417666232.jpg",
		"price": "89.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 189,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium, OTG (Over The Glasses)",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Julbo Aerospace Goggles",
		"formattedTitle": "julbo-aerospace-goggles",
		"brand": "julbo",
		"description": "The Julbo Aerospace Goggles are suited for aspiring jet pilots, astronauts, and rippin' snow riders. The REACTIV Photochromic Spherical Double Lens changes with current light conditions to give you an unparalleled picture of the mountain while the minimalist frame opens up your field of view. The SuperFlow System lets you edge your lens out to increase ventilation and release heat when you're kicking it up a notch - now that's progress!",
		"image": "1653417669680.jpg",
		"price": "220.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 250,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Large",
		"lens_type": "Spherical"
	},
	{
		"title": "Roxy Feelin Color Luxe Goggles - Women's",
		"formattedTitle": "roxy-feelin-color-luxe-goggles---women's",
		"brand": "roxy",
		"description": "The Roxy Feelin Color Luxe Goggles are the real deal. They are solid performers in an array of light conditions, fit seamlessly to your helmet of choice and offer a look that is bound to make your shredder friends jealous. Look at the big picture this season with the Roxy Feelin Color Luxe Goggles.",
		"image": "1653417673164.jpg",
		"price": "93.46",
		"sized": ["S", "M", "L", "XL"],
		"stock": 91,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Roxy Popscreen Color Luxe Goggles - Women's",
		"formattedTitle": "roxy-popscreen-color-luxe-goggles---women's",
		"brand": "roxy",
		"description": "Unleash your inner snow wizardry in the Roxy Popscreen Color Luxe Goggles. These goggles feature Color Lexe Lens Technology for dependable UV protection all season long. So whether the sun is MIA due to a copious amount of snow, or it's high and bright on a mid-Spring day, the Roxy Popscreen Color Luxe Goggles will get you through!",
		"image": "1653417676069.jpg",
		"price": "98.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 77,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Spherical"
	},
	{
		"title": "Roxy Rosewood Goggles - Women's",
		"formattedTitle": "roxy-rosewood-goggles---women's",
		"brand": "roxy",
		"description": "Roses are red, violets are blue, the Roxy Rosewood Goggles will look oh so sweet on you! Whether you're a helmet gal or not, there is nothing to worry about when it comes to these bad boys. They come fitted with top-notch technology like magnetic Speed Connect lens swaps and double density face foam for maximum comfort. It's a party on the slopes everywhere you look in the Roxy Rosewood Goggles!",
		"image": "1653417678975.jpg",
		"price": "179.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 154,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Spherical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Anon Helix 2.0 Perceive Low Bridge Fit Goggles",
		"formattedTitle": "anon-helix-2.0-perceive-low-bridge-fit-goggles",
		"brand": "anon",
		"description": "Keep your eyes on the prize this season with the Anon Helix 2.0 Perceive Low Bridge Fit Goggles, packing all the tech you need at a price that won't break the bank. Lightweight, durable and highly resistant to fogging, these suave snow shades are made to accommodate a more shallow nose bridge and come with a cylindrical PERCEIVE lens for superb peripheral vision and contrast boosting clarity through a wide range of light conditions.",
		"image": "1653417682586.jpg",
		"price": "78.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 236,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Small, OTG (Over The Glasses)",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Smith Squad MAG Goggles",
		"formattedTitle": "smith-squad-mag-goggles",
		"brand": "smith",
		"description": "The iconic Squad goggle just got an upgrade. Now with the best in class Smith MAG™ interchangeable system, the Smith Squad MAG Goggles are better than ever. A simple push lever releases the cylindrical lens for quick lens swaps whenever, wherever, allowing you to roll with the (you guessed it) squad, without missing a beat!",
		"image": "1653417685163.jpg",
		"price": "133.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 171,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium, Large",
		"lens_type": "Cylindrical",
		"quick_lens": "Yes",
		"helmet_compatible": "Yes"
	},
	{
		"title": "Roxy Popscreen NXT Goggles - Women's",
		"formattedTitle": "roxy-popscreen-nxt-goggles---women's",
		"brand": "roxy",
		"description": "Pop through the fog and experience crystal clear vision with the Roxy Popscreen NXT Goggles. These goggles feature photochromic NXT® lenses by Essilor for dependable UV protection and outstanding depth perception. So whether the sun is MIA due to a copious amount of snow, or it's high and bright on a mid-Spring day, the Roxy Popscreen NXT Goggles is here to slay.",
		"image": "1653417688415.jpg",
		"price": "125.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 104,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Spherical"
	},
	{
		"title": "Roxy Feenity Color Luxe Goggles - Women's",
		"formattedTitle": "roxy-feenity-color-luxe-goggles---women's",
		"brand": "roxy",
		"description": "The Roxy Feenity Color Luxe Goggles offer the light protection you need with the comfort and style that makes them shine. Don't let bright days and flat light take you for their own wild ride. Look to and look through the Roxy Feenity Color Luxe Goggles for some backup.",
		"image": "1653417691182.jpg",
		"price": "98.96",
		"sized": ["S", "M", "L", "XL"],
		"stock": 172,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Medium",
		"lens_type": "Cylindrical"
	},
	{
		"title": "Scott Shield Goggles",
		"formattedTitle": "scott-shield-goggles",
		"brand": "scott",
		"description": "The fact that you're fog-free and comfortable will be lost on them. When they see you in your Scott Shield Goggles, if they're able to lift their jaws up off the snow, all they'll remember is how cool you look. These goggles are less fighter pilot and more 80s snow cyborg, and there's just nothing cooler in the lift line. All that great optics yadda yadda – sure it's all true – but these just HAVE it.",
		"image": "1653417694476.jpg",
		"price": "69.99",
		"sized": ["S", "M", "L", "XL"],
		"stock": 110,
		"type": "goggles",
		"gender": "women",
		"frameSize": "Large",
		"lens_type": "Cylindrical"
	}
]
